{"id":10103,"date":"2021-05-27T20:26:43","date_gmt":"2021-05-27T20:26:43","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=10103"},"modified":"2021-06-25T15:05:34","modified_gmt":"2021-06-25T19:05:34","slug":"fluent-voices-aapi-heritage-month-2021","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/fluent-voices-aapi-heritage-month-2021\/","title":{"rendered":"Fluent Voices: Supporting the AAPI Community Through Awareness and Activism"},"content":{"rendered":"\n<p>Fluent Voices is a blog series designed to give employees across all levels and departments within our organization the opportunity to share their unique stories and passions. In honor of Asian American and Pacific Islander Heritage Month, we&#8217;re shining a spotlight on the&nbsp;AAPI&nbsp;community&nbsp;and their allies&nbsp;at Fluent and&nbsp;AdParlor.&nbsp;Stay tuned throughout the year as we continue to feature and celebrate more of our bright minds.<\/p>\n\n\n\n<h2>AAPI Leaders Advocating for Positive Social Change<\/h2>\n\n\n\n<div style=\"height:40px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-image inline-img__margin-right\"><figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna.jpg\" alt=\"Aleyna Yamaguchi Headshot\" class=\"wp-image-10104\" width=\"200\" height=\"200\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna.jpg 500w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna-300x300.jpg 300w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna-150x150.jpg 150w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna-100x100.jpg 100w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Aleyna-200x200.jpg 200w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/figure><\/div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<h2>Aleyna Yamaguchi<\/h2>\n\n\n\n<p class=\"subheading\">Survey Operations Manager, Fluent<\/p>\n<\/div><\/div>\n\n\n\n<p><strong>What led you to your current role at Fluent?<\/strong><\/p>\n\n\n\n<p>&#8220;Originally I was working in sports marketing, then I made the switch to tech marketing. A couple of years into it I found I like working on the ops side and saw an opening at Fluent on LinkedIn &#8211; the rest is history.&#8221;<\/p>\n\n\n\n<p><strong>Who is your biggest role model\/mentor\/career influence and why?<\/strong><\/p>\n\n\n\n<p>&#8220;My parents 100%. They push me every day to be the best person I can possibly be and I don’t know where I’d be without their support.&#8221;<\/p>\n\n\n\n<p><strong>Name your current favorites:<\/strong><\/p>\n\n\n\n<ul><li><strong>Watching:<\/strong> Vincenzo (Netflix Korean drama)<\/li><li><strong>Reading:<\/strong>&nbsp;The Odyssey<\/li><li><strong>Listening to: <\/strong>And That’s Why We Drink podcast<\/li><li><strong>Inspired by:<\/strong>&nbsp;Bruce Lee<\/li><\/ul>\n\n\n\n<p><strong>How has your heritage shaped the person you are today?<\/strong><\/p>\n\n\n\n<p>&#8220;With my mother’s side being Chinese and my father’s side being Japanese, this has played a huge role in who I am now. My grandparents on both sides immigrated to the United States to build a new life, and from them, I’ve learned resilience and discipline. My dad always liked to remind us that our Japanese side descends from a line of samurai, so he taught us to be as strong as we can – both physically and mentally. And even though these are more rigid traits, we never forget to always put kindness and generosity at the forefront – be there to give a helping hand to others, treat others with respect, and stand up for what’s right.&#8221;<\/p>\n\n\n\n<p><strong>In light of the current events surrounding anti-Asian-related attacks, what is something you&#8217;d like others to be aware of?<\/strong><\/p>\n\n\n\n<p>&#8220;I think it’s really important for others to know that unfortunately, these anti-Asian sentiments are nothing new &#8211; every generation has its share of stories of discrimination. My grandparents were redlined from buying a house in certain areas of Seattle, my Chinese grandfather had to wear an “I am not a Jap” button on his U.S. military uniform during WWII so he wouldn’t be mistaken as a Japanese soldier, my parents have been called derogatory names\/told to go back to their countries, and my siblings and I have experienced many microaggressions – “Can you see out of your eyes?” “Just be the quiet little Asian girl and don’t speak.” “Where are you from? No where are you <em>really<\/em> from?” I think it’s so important for others to know that in many Asian cultures, we’re taught not to speak up, not to make a fuss or put our burdens on others and just ignore it. But because of the escalations in violence towards Asians that haven’t gotten to this level in generations, we can no longer be silent about it.&#8221;<\/p>\n\n\n\n<p><strong>We want our AAPI employees to feel safe and supported – how would you like allies to get involved?<\/strong><\/p>\n\n\n\n<p>&#8220;I think there are a couple of things allies can do in the immediate. The first is to have a moment of self-reflection – Have you ever cracked any Asian jokes? Have you made any sort of derogatory comments about our culture, someone’s accent, our eyes, our food, etc.? Think about that. If you or a friend\/family member has, this is an opportunity to check yourself or check them. This may seem like a simple joke, but perpetuating these stereotypes has a domino effect in dehumanizing people and leading to further racism and violence.<\/p>\n\n\n\n<p>A second way allies can get involved is to be aware when you’re out in the community and there are other Asians around you. It’s a scary time right now for the Asian community, and something as simple as riding the subway is nerve-wracking. I never leave my home now without my 4 self-defense weapons, and riding the subway or going to the store has become a stressful thing. So if you see someone sitting by themselves on the subway, try sitting next to them to provide a level of security. Or if you see someone being harassed, intervene if you think the situation won’t turn dangerous. If you think it might, go up to the person after and just ask if they’re okay &#8211; it will mean so much that you reached out. Maybe offer to walk them to their car or their subway stop so they feel a little safer. A single moment of reaching out to help makes a world of a difference.&#8221;<\/p>\n\n\n\n<div style=\"height:30px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:100%\">\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-block-image inline-img__margin-right\"><figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie.jpg\" alt=\"Cassie Chan Headshot\" class=\"wp-image-10105\" width=\"200\" height=\"200\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie.jpg 500w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie-300x300.jpg 300w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie-150x150.jpg 150w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie-100x100.jpg 100w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Cassie-200x200.jpg 200w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/figure><\/div>\n<\/div><\/div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<h2>Cassie Chan<\/h2>\n<\/div><\/div>\n\n\n\n<p class=\"subheading\">Performance Graphic Designer, AdParlor<\/p>\n\n\n\n<p class=\"subheading\"><strong>What led you to your current role at AdParlor?<\/strong><\/p>\n\n\n\n<p>&#8220;Complete chance honestly – I was freelancing before I started at AdParlor and actually used a lot of their tools (shout out to the <a href=\"https:\/\/adparlor.com\/ad-mockups\/\" target=\"_blank\" rel=\"noreferrer noopener\">ad mockup generator<\/a>) in a lot of the jobs I took on. Decided to shoot my shot when I saw the opening and here I am now!&#8221;<\/p>\n\n\n\n<p><strong>Who is your biggest role model\/mentor\/career influence and why?<\/strong><\/p>\n\n\n\n<p>&#8220;I’m constantly influenced by my small circle of friends and fellow creatives. I’m always learning from them (and vice versa) and it’s cool to be able to collectively grow together like this.&#8221;<\/p>\n\n\n\n<p><strong>Name your current favorites:&nbsp;<\/strong><\/p>\n\n\n\n<ul><li><strong>Watching:&nbsp;<\/strong>Blackhead removal videos<\/li><li><strong>Reading:<\/strong>&nbsp;Honestly, I haven’t read a book in 8 years but I’ve been hearing really good things about Crying in H Mart by Michelle Zauner. I remember <a href=\"https:\/\/www.newyorker.com\/culture\/culture-desk\/crying-in-h-mart\" target=\"_blank\" rel=\"noreferrer noopener\">enjoying a related article<\/a> a couple of years ago and have been procrastinating picking up a copy.<\/li><li><strong>Listening to:&nbsp;<\/strong><a href=\"https:\/\/open.spotify.com\/album\/5INnUqfQphgiGDskkTJFaF?si=mK9QFNd_Sz2a6jArAwTDtw\" target=\"_blank\" rel=\"noreferrer noopener\">Citizen &#8211; Youth<\/a>, <a href=\"https:\/\/open.spotify.com\/album\/731aQEGKlJ8RveY3ncSekU?si=GunqhxLrQOCbuZHvFh4W4Q\" target=\"_blank\" rel=\"noreferrer noopener\">Intervals &#8211; The Way Forward<\/a><\/li><li><strong>Inspired by:<\/strong>&nbsp;<a href=\"https:\/\/www.youtube.com\/c\/KelLauren\/videos\" target=\"_blank\" rel=\"noreferrer noopener\">Kel Lauren<\/a>, <a href=\"https:\/\/www.youtube.com\/c\/YamamotoHikaru\/videos\" target=\"_blank\" rel=\"noreferrer noopener\">Hikaru Yamamoto<\/a><\/li><\/ul>\n\n\n\n<p><strong>How has your heritage shaped the person you are today?&nbsp;<\/strong><\/p>\n\n\n\n<p>&#8220;I grew up in a very Caucasian area, so my heritage and ethnicity are both things that have always been very hyper-visible about me. In a way, being around people who don’t look like me has reaffirmed that a large part of my identity stems from being Hong Kong-Canadian. When I was in high school, it used to be difficult discussing anything race-related considering that a majority of my school was very white and I could count on less than 2 hands the number of Asians (and, to an extent, people of color) who were in my grade. That experience had really shaped why I am very vocal about topics that affect racialized communities now.&#8221;<\/p>\n\n\n\n<p><strong>In light of the current events surrounding anti-Asian-related attacks, what is something you&#8217;d like others to be aware of?<\/strong><\/p>\n\n\n\n<p>&#8220;Marginalized communities face different and varied struggles, but we have a lot more in common with each other than we realize; for me in particular, I’ve been reading up on the history of cross-racial solidarity in North America. During the Civil Rights Movement, Asian Americans were hugely influenced by Black leaders and communities in engaging with AsAm community education and self-reflection. Reading more about this made me realize our struggles are intersectional and fighting for liberation for one marginalized community also means fighting for liberation for all.&#8221;<\/p>\n\n\n\n<p><strong>We want our AAPI employees to feel safe and supported – how would you like allies to get involved?<\/strong><\/p>\n\n\n\n<p>&#8220;A really simple way is just checking in on your AAPI friends and coworkers and seeing how they’re doing – it’s been a tough while for us and everyone will deal with that differently. Ask if there’s anything you can do to directly support them in the moment &#8211; like a distraction to take their mind off things or offer to buy them a meal. And as always, I encourage allies to seek resources and educate themselves on their own time; with activism and allyship, the work isn’t ever &#8216;truly finished.&#8217; They’re both based on a lifetime of accountability and learning and unlearning new information presented to you.&#8221;<\/p>\n<\/div>\n<\/div>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:100%\">\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:100%\">\n<div class=\"wp-block-image is-style-default inline-img__margin-right\"><figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice.jpg\" alt=\"Alice Ly Headshot\" class=\"wp-image-10106\" width=\"200\" height=\"200\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice.jpg 500w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice-300x300.jpg 300w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice-150x150.jpg 150w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice-100x100.jpg 100w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Alice-200x200.jpg 200w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/figure><\/div>\n\n\n\n<h2>Alice Ly<\/h2>\n\n\n\n<p class=\"subheading\">Sr. Manager, Branded Content, Fluent<\/p>\n\n\n\n<p><strong>What led you to your current role at Fluent\/AdParlor?<\/strong><\/p>\n\n\n\n<p>&#8220;I was referred by Caleb K. (we worked together right before Fluent) and thanks to him I get to work with the most awesome team I’ve ever worked with (hey, <a href=\"https:\/\/thesmartwallet.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">The Smart Wallet<\/a> team!) and a wonderful company. This is also my first FT remote job (prior to COVID) and I love being able to work from home as well as occasionally visiting the amazing New York headquarters.<\/p>\n\n\n\n<p>My previous roles mixed marketing, community management, and content creation and design together, which I get to utilize to this day. It is definitely never boring!&#8221;<\/p>\n\n\n\n<p><strong>Who is your biggest role model\/mentor\/career influence and why?<\/strong><\/p>\n\n\n\n<p>&#8220;Besides my parents instilling a strong work ethic in me by example (they worked in the restaurant industry) and teaching me to be financially independent, my first manager, Jeannie H., influenced my career. It was inspiring to see her balance work, family, and the communication finesse she had between the different teams in the organization. &nbsp;At the same time, she gave me valuable opportunities that I deeply appreciated.&#8221;<\/p>\n\n\n\n<p><strong>Name your current favorites:<\/strong><\/p>\n\n\n\n<ul><li><strong>Watching:&nbsp;<\/strong>Invincible (on Amazon Prime) = If you’ve watched The Boys, this is even more intense<\/li><li><strong>Reading:<\/strong>&nbsp;How Stella Learned to Talk by Christina Hunger = A speech-language pathologist’s journey to teaching her dog to talk using speech buttons<\/li><li><strong>Listening to:<\/strong> Video Game Study Lounge playlist as work music = Music with lyrics distract me, so all I listen to while working are instrumental or in a foreign language!<\/li><li><strong>Inspired by:<\/strong>&nbsp;<a href=\"https:\/\/www.instagram.com\/the.korean.vegan\/\" target=\"_blank\" rel=\"noreferrer noopener\">@the.korean.vegan<\/a> on IG = I&#8217;m not vegan but she marries storytelling with food so well it&#8217;s fascinating to watch and learn from!<\/li><\/ul>\n\n\n\n<p><strong>How has your heritage shaped the person you are today?<\/strong><\/p>\n\n\n\n<p>&#8220;My Chinese heritage has gifted me with being thrifty and a lover of all things food-related. Both traits are common in general Asian cultures, and I embrace them wholeheartedly.<\/p>\n\n\n\n<p>My parents worked long hours to provide for the family, and their way of stretching the dollar by not being wasteful, or reusing\/upcycling items, and keeping an eagle eye out for sales has definitely passed on to me. Yes, I do have extra napkins in my glove compartment and a drawer full of plastic takeout containers that I&#8217;ll reuse 😉 Asians (parents and relatives) show their love by cooking and offering food (not hugs and kisses) so I&#8217;ve been well-fed my entire life. I will also gladly give you a list of restaurants, mom-and-pop places, and cafes if you don&#8217;t know where to eat!<\/p>\n\n\n\n<p><strong>In light of the current events surrounding anti-Asian-related attacks, what is something you&#8217;d like others to be aware of?<\/strong><\/p>\n\n\n\n<p>&#8220;I believe it&#8217;s hard for some to understand that anti-Asian racism has always been present. There are also those that still think &#8220;it can&#8217;t be <em>that<\/em> bad.&#8221; Only due to <em>some<\/em> media covering the attacks, it&#8217;s getting more attention. It’s an unfamiliar spotlight for us but a necessary one. My parents told me they were screamed at while walking back home from the park, and my mom recently accompanied me to Downtown Los Angeles, later telling me she felt scared to be there. This is the reality that our parents and seniors are facing. They may not admit it, but internally they’re shaken.<\/p>\n\n\n\n<p>For those interested in learning more, I suggest following <a href=\"https:\/\/nextshark.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">NextShark<\/a> (their <a href=\"https:\/\/www.instagram.com\/nextshark\/\" target=\"_blank\" rel=\"noreferrer noopener\">IG page<\/a> is great too) to stay updated on Asian and Asian American news to see the bigger picture. If you can stomach a more raw look into the hate incidents, I would suggest following <a href=\"https:\/\/www.instagram.com\/dionlimtv\/\" target=\"_blank\" rel=\"noreferrer noopener\">@DionLimTV<\/a> on IG, an ABC7 San Francisco reporter that posts unfiltered news and imagery to show how severe the attacks are, particularly to the elder community.&#8221;<\/p>\n\n\n\n<p><strong>We want our AAPI employees to feel safe and supported – how would you like allies to get involved?<\/strong><\/p>\n\n\n\n<p>&#8220;Local Asian businesses are hurting from the combined forces of 2 viruses &#8211; one from COVID and the other from hate. If you can help support your local Asian business, even online, it would mean the world to them. This can also include donating to families affected by AAPI hate, organizations that work on rebuilding and supporting Asian businesses and communities, as well as many others that could be found <a href=\"https:\/\/nymag.com\/strategist\/article\/where-to-donate-to-help-asian-communities-2021.html\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>. And thank you, Fluent, for matching employee donations as well!<\/p>\n\n\n\n<p>Another way to help &#8211; If you do witness a hate incident, try and assist the victim if you can. I learned about the 5 Ds of bystander intervention (distract, delegate, document, delay, and direct) from <a href=\"https:\/\/www.ihollaback.org\/bystander-resources\/\" target=\"_blank\" rel=\"noreferrer noopener\">Hollaback!<\/a>, a non-profit that raises awareness and provides resources to combat harassment. <\/p>\n\n\n\n<h2>Perspectives From an AAPI Ally<\/h2>\n\n\n\n<div style=\"height:29px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\" style=\"flex-basis:100%\">\n<div class=\"wp-block-image is-style-default inline-img__margin-right\"><figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Steve-Gelber.png\" alt=\"Steve Gelber Headshot\" class=\"wp-image-10108\" width=\"200\" height=\"200\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Steve-Gelber.png 175w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Steve-Gelber-150x150.png 150w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/05\/Steve-Gelber-100x100.png 100w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/figure><\/div>\n\n\n\n<h2>Steve Gelber<\/h2>\n\n\n\n<p class=\"subheading\">Sr. Director, Biddable Media, Fluent<\/p>\n\n\n\n<p><strong>As an ally, how do you advocate for positive social change in support of the Asian community?<\/strong><\/p>\n\n\n\n<p>&#8220;In my opinion, being an ally and supporting positive social change for our Asian community starts with education and empathy. My fiancé, who is of Chinese descent, experienced an act of hate at the beginning of the pandemic. My initial reaction was pure anger &#8211; which I think is normal when someone you love experiences any act of hate or is threatened. However &#8211; after the hate subdued, I asked my fiancé what I could do to help. She simply wanted me to listen to how she was feeling and understand this disgusting behavior against our Asian community is not new and has been going on for decades.&nbsp;<\/p>\n\n\n\n<p>For me personally, the upsurge in violence and increased coverage of hate against our Asian community have created a long list of emotions. Initially, I wanted to take action and do anything and everything in my power to help, but it took time and acknowledgment to realize that before I could make positive social change &#8211; I needed to be educated and purely listen first.&#8221;<\/p>\n\n\n\n<p><strong>If you liked this post and want to learn more from our team, check out the full Fluent Voices blog series <a href=\"https:\/\/www.fluentco.com\/tag\/fluent-voices\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>. <\/strong><\/p>\n\n\n\n<p><\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Fluent Voices is a blog series designed to give employees across all levels and departments within our organization the opportunity to share their unique stories and passions. In honor of Asian American and Pacific Islander Heritage Month, we&#8217;re shining a &hellip; <a href=\"https:\/\/www.fluentco.com\/blog\/fluent-voices-aapi-heritage-month-2021\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":10052,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[211],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/10103"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=10103"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/10103\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10052"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10103"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10103"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10103"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=10103"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}