{"id":10288,"date":"2021-09-02T15:46:00","date_gmt":"2021-09-02T19:46:00","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=10288"},"modified":"2021-09-02T15:53:49","modified_gmt":"2021-09-02T19:53:49","slug":"fluent-voices-career-advice","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/fluent-voices-career-advice\/","title":{"rendered":"Fluent Voices: Career Advice to Our Younger Selves"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p>Fluent Voices is a blog series designed to give employees across all levels and departments within our organization the opportunity to share their unique stories and passions. Our latest edition focuses on professional growth and mentorship &#8211; something we value and encourage both within Fluent and outside our walls. Below, learn how 3 key team members got to where they are today, and what pieces of career advice they wish they could give to their younger selves. <\/p>\n\n\n\n<h2>Champions of Personal Growth Share Career Advice<\/h2>\n\n\n\n<div style=\"height:30px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-image inline-img__margin-right\"><figure class=\"alignleft size-full is-resized\"><img src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/09\/Fluent-Voices-Don.png\" alt=\"Career Advice - Don Patrick\" class=\"wp-image-10289\" width=\"250\"\/><\/figure><\/div>\n\n\n\n<h2><strong>Don Patrick<\/strong><\/h2>\n\n\n\n<p>Interim CEO, Fluent&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>Think back to the beginning of your career. Did you expect to be where you are today? Where did you start, and how did you get to where you are now?<\/strong>&nbsp;<\/p>\n\n\n\n<p>“When I started my first job in investment banking, I never expected to have a 25+ year career in marketing! I believe most successful careers come down to finding and pursuing your business passions. If you are passionate about something, your career will not be about a job or a role but about what you love doing. For me, I found my passion was about building and growing businesses. I got lucky to get into digital marketing at the right time and what a great industry to grow in!”&nbsp; &nbsp; &nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>Name a book or resource that has helped you grow in your professional life. What was the main lesson or takeaway?<\/strong>&nbsp;<\/p>\n\n\n\n<p>“I am sure most of Fluent and AdParlor are tired of me saying my favorite book is “<a href=\"https:\/\/www.jimcollins.com\/article_topics\/articles\/good-to-great.html#articletop\" target=\"_blank\" rel=\"noreferrer noopener\">Good to Great<\/a>” by Jim Collins. The book is based on a lot of quantitative research and analytics around companies that have succeeded long-term compared to others that have not. One of the main findings is that every successful company has a “Hedgehog.” The Hedgehog concept is that you can build a great company and sustain it over time if you do three things well: chose something (1) you can be the best in the world at, (2) you are passionate about, and (3) that drives your economic engine (meaning you can make money). Simple and clear growth framework that can serve as a benchmark for a company, business unit, and department.” <\/p>\n\n\n\n<p><strong>What is one piece of career advice you’d like to give to your younger self? <\/strong> <\/p>\n\n\n\n<p>“The critical importance of focusing on relationships and how it is the foundation for long-term and consistent financial success.&nbsp;Too often, we are taught early in our careers&nbsp;to drive the financial numbers at all costs.&nbsp;And you can do that in the&nbsp;short term.&nbsp;But long-term, behind the financial numbers,&nbsp;are the people relationships – the ability to be direct, debate,&nbsp;and align on the right priorities. And support and encourage people on your team to develop and take risks.&nbsp;Strong relationships allow you to build high-performing teams that can put up extraordinary results.”&nbsp;<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-image inline-img__margin-right\"><figure class=\"alignleft size-full is-resized\"><img src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/09\/Fluent-Voices-Roxanna.png\" alt=\"Career Advice - Roxanna Flores\" class=\"wp-image-10291\" width=\"250\"\/><\/figure><\/div>\n\n\n\n<h2><strong>Roxanna Flores<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Senior Accountant, Fluent&nbsp;<\/p>\n\n\n\n<p><strong>Name a book or resource that has helped you grow in your professional life. What was the main lesson or takeaway?<\/strong>&nbsp;<\/p>\n\n\n\n<p>“<a href=\"https:\/\/go.darrenhardy.com\/the-compound-effect-resources\/\" target=\"_blank\" rel=\"noreferrer noopener\">The Compound Effect<\/a>” by Darren Hardy &#8211; after reading the book I realized how small changes can amount to big movements in the long-term, both personally and professionally. People always say Rome wasn’t built in a day and that resonates with every aspect of my life; it is the brick-by-brick building that has helped me become the person\/professional that I am today.” <\/p>\n\n\n\n<p><strong>What skills\/qualities are necessary to be successful in your area of work?&nbsp;&nbsp;<\/strong>&nbsp;<\/p>\n\n\n\n<p>&#8220;Consistency:&nbsp;Being consistent helps build momentum and develops trust. The more&nbsp;consistent&nbsp;you are,&nbsp;the more&nbsp;people know what to expect from you both personally and professionally.&nbsp;<\/p>\n\n\n\n<p>Accountability: Owning up to your errors or mistakes is important for any field. Everyone is&nbsp;human,&nbsp;and everyone makes&nbsp;mistakes,&nbsp;but if you&nbsp;do not&nbsp;own up to them, you&nbsp;don’t grow.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Showing up: If you say&nbsp;you are&nbsp;doing something, do it! You want to be&nbsp;reliable;&nbsp;you want to be that person that&nbsp;others can&nbsp;count on,&nbsp;even for small tasks.&#8221;<\/p>\n\n\n\n<p><strong>Who is your biggest mentor? How did you develop this relationship and what impact has it had on your career?<\/strong>&nbsp;<\/p>\n\n\n\n<p>“Professionally one of my most impactful mentors is&nbsp;a former boss. When I first graduated&nbsp;college,&nbsp;I did not have a sense of where I was going yet and&nbsp;did not have the skills that I do now. In my first job,&nbsp;my&nbsp;boss became&nbsp;my mentor&nbsp;–&nbsp;he really took the time to help me grow my skills, pushed me to be a thinker, and taught me to be accountable. Personally,&nbsp;I also think&nbsp;my Fluent mentor is&nbsp;the bomb.com.&nbsp;He truly is such a likable individual&nbsp;and always super happy&nbsp;—&nbsp;every time&nbsp;I bring up his name&nbsp;people have nothing but great things to say about him and one day (when I grow up) I would love to be like him.”&nbsp;<\/p>\n\n\n\n<p><strong>What is one piece of career advice you’d like to give to your younger self?<\/strong> <\/p>\n\n\n\n<p>“I would tell myself not to be afraid of failure. Gowing up&nbsp;you are&nbsp;always&nbsp;told “no&nbsp;you can’t” or “you failed” but&nbsp;it is within those scenarios that you learn the most. The person you become is&nbsp;determined&nbsp;by&nbsp;perseverance, grit, and&nbsp;how you handle&nbsp;failures&nbsp;and step&nbsp;up to the challenges.”&nbsp;<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div class=\"wp-block-image inline-img__margin-right\"><figure class=\"alignleft size-full\"><img loading=\"lazy\" width=\"260\" height=\"250\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2021\/09\/Fluent-Voices-Tamim.png\" alt=\"Career Advice - Tamim Sangrar\" class=\"wp-image-10292\"\/><\/figure><\/div>\n\n\n\n<h2><strong>Tamim&nbsp;Sangrar&nbsp;<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Product Manager, Mobile Apps, Fluent&nbsp;<\/p>\n\n\n\n<p><strong>Think back to the beginning of your career. Did you expect to be where you are today? Where did you start, and how did you get to where you are now? <\/strong> <br><\/p>\n\n\n\n<p>“Absolutely not! It has been a dream journey so far—a result of hard work, support, and blessings from the almighty. I started as a User Interface Developer only 3 years ago at Deloitte, took the plunge to pursue my master’s degree in Management Information Systems, and dreamed of pursuing a career in technical product management. There were a lot of people that helped shape my journey both personally and professionally, most importantly my brother, mother, and sister provided constant support, along with my girlfriend and friends. All of them helped pick me up when I was down, motivated me, inspired me, and eventually led me to where I am right now.”<\/p>\n\n\n\n<p><strong>Who is your biggest mentor? How did you develop this relationship and what impact has it had on your career?<\/strong> <br><\/p>\n\n\n\n<p>“My biggest mentor has to be my brother, he and I have a huge age difference so that helps. Ever since I can remember, he has been either my mentor or my inspiration, he has shaped me to become the person I am today both professionally and personally. Every major career decision that I have made has been either directly or indirectly influenced by him. He always helped create an environment for learning and growth and pushed me to be ambitious and brave—with a lot of tough love!” <\/p>\n\n\n\n<p><strong>A spirit of innovation is important at Fluent and AdParlor. What steps do you take to consistently learn and grow professionally?<\/strong> <\/p>\n\n\n\n<p>“I believe the key to success is constant growth, and that growth can be achieved by consistently learning and bettering yourself. I actively engage in certifications, learnings, and watch videos by leaders in my domain, to be able to learn from them and use new tips and skills in my day-to-day.” <\/p>\n\n\n\n<p><strong>What is one piece of career advice you’d like to give to your younger self? <\/strong> <br><\/p>\n\n\n\n<p>“Learn, learn, and learn! Invest a lot of time in learning the things around you and become great at it! Also, invest in Bitcoin 😛” <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>If you liked this post and want to hear from our team, check out the full Fluent Voices blog series <a href=\"https:\/\/www.fluentco.com\/tag\/fluent-voices\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fluent Voices is a blog series designed to give employees across all levels and departments within our organization the opportunity to share their unique stories and passions. Our latest edition focuses on professional growth and mentorship &#8211; something we value and encourage &hellip; <a href=\"https:\/\/www.fluentco.com\/blog\/fluent-voices-career-advice\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":10296,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[211],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/10288"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=10288"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/10288\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10296"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10288"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10288"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10288"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=10288"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}