{"id":178,"date":"2017-08-31T01:49:58","date_gmt":"2017-08-31T01:49:58","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=178"},"modified":"2020-12-29T02:19:11","modified_gmt":"2020-12-29T02:19:11","slug":"marketing-generation-z-strategies","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/marketing-generation-z-strategies\/","title":{"rendered":"5 Data-Backed Strategies for Marketing to Generation Z"},"content":{"rendered":"<p>As millennial-buzz swirls around businesses and marketing departments, smart advertisers are already shifting gears to prepare their programs for the next big thing: Generation Z.<\/p>\n<p>Just as millennials lurched away from the accepted norms, “killing” off different industries with their crazy interests and demands, Gen Zers are veering away from their older counterparts as well. An even larger generation, <a href=\"http:\/\/www.huffingtonpost.com\/george-beall\/8-key-differences-between_b_12814200.html\">25.9% of the US<\/a>, born with an iPhone in their cradles and damaged from the Great Recession, these young adults have some unique quirks; and yes, those quirks affect their purchasing decisions.<\/p>\n<p>The truest digital natives with an ability to multitask with any number of devices, this cohort absorbs information at a startling pace. Unsurprisingly, they are brand-aware and shopping-savvy.<\/p>\n<p>We ran a nationwide survey focusing on adult Generation Z consumers, which includes 18-24-year-olds. As this generation graduates from school and enters the workforce, they are an increasingly influential force in dictating the new wave of products and services. Last year, it was recorded that Gen Zers contributed <a href=\"http:\/\/mashable.com\/2014\/08\/20\/generation-z-marketing\/#TWbAFeLCo8qx\">$44 billion to the American economy<\/a>. Don’t miss out on marketing to Generation Z.<\/p>\n<h2>Marketing to Generation Z: Align Your Brand Values<\/h2>\n<p>To appeal to this vast group, you should start working from the ground up; first move: identify your brand values. 25% of adult Gen Zers (18-21 years old) report that brands sharing their core values is extremely important to them and the specific values they identified do not necessarily match up with other generations’.<\/p>\n<p><a href=\"http:\/\/fluentinc.wpengine.com\/insight\/marketing-gen-z\">No time to read this post? Download all the info you need in our free report.<\/a><\/p>\n<p>Perhaps due to recent political pushes to have products “Made in the USA,” Generation Z is significantly more patriotic than their older counterparts. When deciding where to shop, they also care more about brand contributions to the local community and shared core values.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-6604 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/09\/marketing_generation_z_values.png\" alt=\"Generation Z Values\" width=\"521\" height=\"239\" \/><\/p>\n<p>This generation has been referred to as “<a href=\"http:\/\/mashable.com\/2014\/08\/20\/generation-z-marketing\/#TWbAFeLCo8qx\">do-gooders<\/a>,” as 60% want their jobs to impact the world, 26% volunteer, and 76% are concerned about humanity’s impact on the planet. Presenting this audience with products that are sustainable and responsibly made will go a long way.<\/p>\n<h3>Aspiring Entrepreneurs<\/h3>\n<p><a href=\"http:\/\/www.huffingtonpost.com\/crystal-kadakia\/72-of-hs-students-are-ent_b_7922384.html\">72% of high school and college students aspire to start their own business one day<\/a>. Of that, 61% expect they will start a business right after graduating college. This is a huge swing away from office cubicles – maybe due to coming of age during the Great Recession and in the aftermath of the real estate bubble popping. Corporate America, you’re officially the backup plan.<\/p>\n<p>How can you use this to market to Generation Z? Showcase your own uniqueness. Identify with their desire to start a business with showing how you did it yourself! Get back to your beginnings by hiding your corporate side and using grassroots marketing.<\/p>\n<h2>Marketing to Generation Z: Play Easy-To-Get<\/h2>\n<p>The argument could be made that adult Generation Zers are even lazier than Millennials, having adjusted to getting all household items delivered, ride-sharing services appearing at their doorsteps, and the convenience of Amazon Prime. These young adults are much more likely to be students or just starting out in their careers and make less money on average – but they will still pay more for convenience. Making products and services easy and convenient will win over this audience.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-6601 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/09\/marketing_generation_z_convenience.png\" alt=\"Marketing to Generation Z\" width=\"807\" height=\"365\" \/><\/p>\n<h3>Marketing to Generation Z on Social Media<\/h3>\n<p>While Gen Z consumers are just as active on social media as Millennials are, they gravitate to different platforms. Specifically, Snapchat and Instagram are more popular with this younger cohort. On the other hand, Millennials are more likely to use Facebook.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-6603 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/09\/marketing_generation_z_social.png\" alt=\"Generation Z Social Media\" width=\"775\" height=\"587\" \/><\/p>\n<p>Generation Z consumers are more likely to use Snapchat and other social platforms for direct messaging, checking what is trending and read others’ opinions.<\/p>\n<p><a href=\"http:\/\/fluentinc.wpengine.com\/insight\/marketing-gen-z\">Want more details into exactly why Generation Zers use certain social platforms? Download our full report here.<\/a><\/p>\n<p>Facebook advertisers, watch out. In 2014 alone, 25% of Gen Zers abandoned the platform. This makes advertising on alternate social platforms even more important – hello, Instagram. When you are forming your online marketing strategy to target Generation Z, be sure to diversify platforms and approaches until you find your sweet spot.<\/p>\n<h3>Marketing to Generation Z on Mobile<\/h3>\n<p>On a more obvious note, adult Gen Zers want brands that have an online presence. In fact, a full <a href=\"http:\/\/www.huffingtonpost.com\/george-beall\/8-key-differences-between_b_12814200.html\">40% of Gen Z<\/a> are self-identified digital device addicts.<\/p>\n<p>While Millennials grew up with instant messaging and iPods, Generation Z consumers’ first device was an iPhone. It is unsurprising then that our <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/apple-iphone-8-price\/\">recent study<\/a> found that consumers who own an iPhone are extremely likely to remain within the Apple ecosystem and the brand has found a who generation of loyal consumers in Gen Z.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-6602 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/09\/marketing_generation_z_smartphones.png\" alt=\"Marketing to Generation Z\" width=\"515\" height=\"585\" \/><\/p>\n<p>To put it simply: marketing to Generation Z needs to involve an easily navigable website that is optimized for mobile.<\/p>\n<h2>Cutting Through the Marketing Noise<\/h2>\n<p>Generation Z is plugged in through mobile and social media, and more conscious of brand values than Millennials. When considering how to market to this small, young group, be wary of making any kind of offensive statements, advertising over-seas production or unfair market practices, and stay on top of your online presence. While baby boomers, Generation Xers, or even Millennials may not notice advertisements on their Facebook or Instagram feed, you can trust that Generation Zers will and they will be critical and discerning.<\/p>\n<p>The impact of this generation will continue to grow as the younger Gen Zers come of age, enter the workforce, and transform our sales and marketing strategies just as Millennials have as of late.<\/p>\n<p>Want to get the full story, to-go? <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/marketing-gen-z\">Download our Marketing to Gen Z report here<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As millennial-buzz swirls around businesses and marketing departments, smart advertisers are already shifting gears to prepare their programs for the next big thing: Generation Z. Just as millennials lurched away from the accepted norms, “killing” off different industries with their &hellip; <a href=\"https:\/\/www.fluentco.com\/blog\/marketing-generation-z-strategies\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":179,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[137,143],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/178"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=178"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/178\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/179"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=178"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=178"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=178"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=178"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}