{"id":183,"date":"2017-12-06T01:56:30","date_gmt":"2017-12-06T01:56:30","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=183"},"modified":"2021-01-15T19:40:20","modified_gmt":"2021-01-15T19:40:20","slug":"marketing-men-data","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/marketing-men-data\/","title":{"rendered":"3 Best Tips and Tricks on Marketing to Men [DATA]"},"content":{"rendered":"\n<p>While we have investigated marketing to millennials, marketing to Gen Z, the heartland, and even women, it’s time to turn our attention to the beard-growing, not-as-fair sex: how to market to men. Though this means looking at a huge swath of people, this demographic shows distinct characteristics when considering advertisements or committing to purchases.<\/p>\n\n\n\n<p>No time to read this post?&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/new-fluent-research-men-engage-with-newer-digital-channels-more-often-than-women\/\">Download it for free here<\/a>.<\/p>\n\n\n\n<h2>Take the Mountain to Moses: Marketing to Men Where They Are<\/h2>\n\n\n\n<p>First, men engage with social media, email newsletters, and mobile notifications more frequently than women. For all the ladies trying to grab attention through Snapchat, Instagram, or Facebook—don’t worry. He sees you. Notably, Millennial men use these channels the most.<\/p>\n\n\n\n<p>58% of American men report having seen ads or promotions on social media in the past six months, and 36% say they purchased a product because of said ads.<\/p>\n\n\n\n<p>About half of all men have made a purchase through a smartphone in the past six months, and 56% have made a purchase online—via a computer or mobile device. Men are most likely to be Android users, though 38% report owning an iPhone.<\/p>\n\n\n\n<p>Millennial men (ages 18-29), are most likely to follow brands or products on social media, sign up for email marketing newsletters, and sign up for mobile notifications. Furthermore, millennial men are even more likely to engage in these digital activities than millennial women.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/12\/marketing-to-men-1.png\" alt=\"Marketing to Men\" class=\"wp-image-6773\"\/><\/figure><\/div>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/12\/marketing-to-men-2.png\" alt=\"Marketing to Men\" class=\"wp-image-6774\"\/><\/figure><\/div>\n\n\n\n<h2>Manipulative Marketing: Advertising Susceptibility<\/h2>\n\n\n\n<p>Men are more malleable than they let on. We found that marketing has a greater impact on male purchase behavior than on female purchase behavior, across every marketing channel we measured. Digital channels are more influential than traditional channels, i.e. advertising on social, AdWords, and digital media. These channels generally find you through algorithms and cookies to display items you are most likely to purchase, playing into the male affinity for convenience.<\/p>\n\n\n\n<p>Want these stats for later?&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/new-fluent-research-men-engage-with-newer-digital-channels-more-often-than-women\/\">Download it here for free<\/a>.<\/p>\n\n\n\n<p>When it comes to influencing a purchase decision, the largest cross-gender differences appear in the traditionally less effective channels. Men are much more likely to say they are influenced by billboards and radio ads. Online video ads, rising to the spotlight recently through high engagement on social media, are also highly influential.<\/p>\n\n\n\n<p>42% of men start their holiday shopping in November – which most likely means that most men do most of their shopping for the year during this time. If you are not already, focus your marketing campaigns specifically toward men during this time to capitalize on their attention.<\/p>\n\n\n\n<h2>Marketing to Men through Mobile Applications<\/h2>\n\n\n\n<p>Returning to the common theme: convenience. More than twice as many men than women say they download mobile apps “most times” or “every time” for stores they regularly visit (38% for men vs. 17% for women). Among those who download apps, 68% use them primarily for purchases.<\/p>\n\n\n\n<p>Prioritize men for mobile app download campaigns. Men are more apt to download these apps than women and once they have downloaded them, they are more likely to use them to make purchases directly from the app.<\/p>\n\n\n\n<p>Take this post to-go.&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/new-fluent-research-men-engage-with-newer-digital-channels-more-often-than-women\/\">Download it here<\/a>.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/12\/marketing-to-men-3.png\" alt=\"Marketing to Men\" class=\"wp-image-6775\"\/><\/figure><\/div>\n\n\n\n<h3>Don’t Market to Men on Facebook?!<\/h3>\n\n\n\n<p>Just kidding! Facebook is most men’s preferred social media network for following brands and products (69%). However, women have an even higher preference for this social media giant. Pinterest, Instagram, and Twitter all crack 10% with men as the preferred network for following products. As Instagram expands their reach exponentially through Facebook and Pinterest introduces new advertising, we expect these channels to continue to grow among men.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2017\/12\/marketing-to-men-4.png\" alt=\"Marketing to Men\" class=\"wp-image-6776\"\/><\/figure><\/div>\n\n\n\n<h2>Use Gender-Neutral Messaging When Marketing to Men<\/h2>\n\n\n\n<p>As Dollar Shave Club, Bonobos, and Axe direct their advertising efforts toward manly men, out in the world attracting women and staying well groomed, this specific messaging is not the most effective route. Men receive gender-specific messages in similar frequency as women, who seem gender-specific messages from beauty brands as well. However, men and women overwhelmingly prefer gender-neutral marketing messages.<\/p>\n\n\n\n<h5>SURVEY METHODOLOGY<\/h5>\n\n\n\n<p><em>This survey was conducted online within the United States by Fluent, LLC on April 21, 2016, among 2,291 American smartphone and tablet owners including 868 men and 1,443 women. Respondents were randomly selected, and the margin of error of the findings for smartphone or tablet owners at the 95% confidence level is +\/- 3.3% for men and +\/-2.6% for women. Fluent’s proprietary ad serving technology includes a real-time survey module that was used to facilitate the data collection for this study.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>While we have investigated marketing to millennials, marketing to Gen Z, the heartland, and even women, it’s time to turn our attention to the beard-growing, not-as-fair sex: how to market to men. <a href=\"https:\/\/www.fluentco.com\/blog\/marketing-men-data\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":184,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[137],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/183"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=183"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/183\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/184"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=183"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}