{"id":356,"date":"2018-06-07T04:56:00","date_gmt":"2018-06-07T04:56:00","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=356"},"modified":"2020-12-29T02:19:11","modified_gmt":"2020-12-29T02:19:11","slug":"sms-marketing-guide","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/sms-marketing-guide\/","title":{"rendered":"Text Message and SMS Marketing: How It Works, Best Practices, and How to Use It"},"content":{"rendered":"<p>As text message – also known as SMS marketing – becomes more relevant and integral to growing businesses, marketing teams ponder how to implement yet another step in the marketing funnel. Mobile shopping continues to grow, mobile search has officially overtaken search on desktop, and mobile app use is growing exponentially each year. If you want to reach your consumers where they are, you should be leveraging SMS marketing.<\/p>\n<h2>What is SMS Marketing?<\/h2>\n<p>Text message marketing – or SMS (short message service) marketing – is a technique using permission-based mobile messaging to distribute promotional or informational messages to consumers. A text message, simply put, is a piece of data with a size limit of 160 characters. Marketing services teams or <a href=\"https:\/\/gleantap.com\/beginners-guide-business-texting-sms-marketing\/\">businesses use SMS<\/a> to contact prospects, inform subscribers, and re-engage lapsed users.<\/p>\n<h2>How Does SMS Marketing Work?<\/h2>\n<p>The first element of an SMS marketing campaign: the short code. This is the five or a six-digit number representing the “phone number” of the outgoing texter. Anyone who has received an automated text—confirming your Uber login, letting you know your credit card balance, asking you to attend an upcoming event—will recognize the short “phone number” associated with the SMS machine vs. the normal 10 digits associated with a person.<\/p>\n<p>However, before you start texting, the phone numbers you are contacting (and the people connected with them) must have been provided to you through compliance with the Telephone Consumer Protection Act. Basically, you must have explicit consent! A phone number, especially a personal cell phone number, is private and precious and you do not want to overstep that boundary. Aside from that, it is against the law.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-7088 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2018\/06\/SMS-Marketing-Consent.png\" alt=\"SMS Marketing Consent\" width=\"600\" height=\"152\" \/><\/p>\n<p>How does explicit consent to use SMS work? It’s simple. When your prospect is filling out a form with their phone number, they should also check a box that says, “I am open to being contacted via text message.”<\/p>\n<h2>SMS Marketing Best Practices<\/h2>\n<p>Before we dive into best <a href=\"https:\/\/www.slicktext.com\/howitworks.php\">text message marketing practices<\/a>, make sure you have a defined goal. Do you want people to attend an event or place an order? Are you interested in driving consumers onto a website or having them place a phone call? Do you simply want them to respond, confirming or rejecting an appointment? Once this has been decided, the rest of your SMS marketing plan will naturally follow.<\/p>\n<h3>Introduce Yourself!<\/h3>\n<p>Who are you and why are you texting me? That will be the first two questions on a consumer’s mind when a six-digit number pops up on their screen. Before diving into why you are texting them, let them know your name. Remember, text message marketing is almost like knocking on someone’s front door. Be polite.<\/p>\n<h3>Have a Clear Call to Action<\/h3>\n<p>After you clearly introduce yourself, jump into what you want the user to do, the action that you have pre-defined. Here, we recommend testing different—but simple—verbiage in your call to action to see which is the most effective at getting the consumer to convert.<\/p>\n<h3>Don’t Go Over the 160 Character Limit<\/h3>\n<p>Nothing is more annoying than a text message that gets cut off in the middle of a word. Receiving an SMS that ends, “Confirm by dial…” and nothing else is brutal. How can they confirm now?!<\/p>\n<h3>Include an Unsubscribe Option<\/h3>\n<p>This is essential. While most consumers likely know they can unsubscribe from SMS marketing campaigns by simply texting “STOP,” you need to spell it out for them. Just like including an opt-out link in your marketing emails, this needs to be included in all text message marketing campaigns.<\/p>\n<h3>Test, Test, Test All Aspects of Your Text Marketing Messages<\/h3>\n<p>As with all marketing initiatives, you won’t know what works until you try. Testing time of day, time of week, length of text, frequency, CTA, and so on, will result in the best knowledge base for your marketing team. Look at open rates, click rates, and eventual conversions to accurately calculate ROI and optimize your campaigns effectively.<\/p>\n<p>As <a href=\"https:\/\/www.textrequest.com\/blog\/complete-overview-business-texting\/\">Text Request illustrates below<\/a>, there are small windows of time when your customers can engage with you. Find those windows and capitalize on them through SMS marketing.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-7090 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2018\/06\/SMS-marketing-time-of-day.png\" alt=\"SMS-marketing-time-of-day\" width=\"600\" height=\"371\" \/><\/p>\n<h3>Double Confirm Further Actions<\/h3>\n<p>We are all familiar with fat finger syndrome when it comes to smartphones. You’re just trying to open a link in your browser and suddenly, you’ve been redirected to an obscure app that you forgot was even on your phone. When a consumer is driven to a website from SMS or places an inbound call, make sure that this action is intended. This is two-pronged: if you are paying (or collecting payment) based on that action, you want to minimize bounces. The second prong is the ability to provide a better user experience.<\/p>\n<h3>Integrate SMS Marketing with Other Campaigns<\/h3>\n<p>This is the most important. You wouldn’t have your social media campaigns, or AdWords, or email marketing, running in silos. Similarly, appropriately fit SMS marketing campaigns into your marketing funnel. You probably would not create <a href=\"https:\/\/buildfire.com\/sms-marketing\/\">your loyalty marketing program built on SMS marketing<\/a> alone, but don’t forget to fit it into the overall plan.<\/p>\n<h2>Should I Use SMS Marketing?<\/h2>\n<p>Every minute of the day, <a href=\"https:\/\/www.domo.com\/learn\/data-never-sleeps-5\">15,220,700 text messages are sent worldwide<\/a>.  If that’s not enough to convince you of volume, <a href=\"http:\/\/news.gallup.com\/poll\/179288\/new-era-communication-americans.aspx\">texting is the most commonly used form of communication<\/a> among Americans under 50 years old. Finally, a <a href=\"https:\/\/www.textrequest.com\/blog\/crucial-new-study-brings-light-to-franchise-texting\/\">series of studies conducted by FranchiseHelp<\/a> determined that 90% of prospects would rather be texted than called.<\/p>\n<p>Pizza shops, clothing boutiques, banks, debt collectors, universities, insurance companies, political campaigns, real estate firms, and more already use SMS marketing. Any business who is looking to improve communication with prospects can capitalize on text message marketing.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-7089 aligncenter\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2018\/06\/sms-marketing-fluent.png\" alt=\"sms-marketing-fluent\" width=\"600\" height=\"277\" \/><\/p>\n<p>If you are unable to collect phone numbers from your prospects, it makes SMS marketing pretty much impossible. Luckily, there are plenty of marketing services firms that offer text message marketing – and Fluent is one of them! With one of the <a href=\"https:\/\/www.tatango.com\/resources\/tcpa-videos\/\">largest collections of TPCA-consented phone numbers<\/a>, our savvy team of marketers leverages drip SMS marketing campaigns to acquire and engage your best prospects. We love having conversations with our expansive audience and serving better advertising experiences for them. This ultimately means advertisers acquire happier customers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Mobile shopping continues to grow, mobile search has officially overtaken search on desktop, If you want to reach your consumers where they are, you should be leveraging SMS marketing. <a href=\"https:\/\/www.fluentco.com\/blog\/sms-marketing-guide\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":357,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[182],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/356"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=356"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/356\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/357"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=356"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=356"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=356"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=356"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}