{"id":358,"date":"2018-06-11T04:57:57","date_gmt":"2018-06-11T04:57:57","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=358"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"millennials-and-politics","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/millennials-and-politics\/","title":{"rendered":"Millennials and Politics: How to Boost Engagement and Mobilize Support"},"content":{"rendered":"<p>What is the relationship between Millennials and politics? Millennials tend to get a bad rap, from relying too heavily on technology to dodging their civic responsibility. Yet it’s not so much that politics bore or disinterest Millennials. Rather, it takes rallying cries that appeal to their core values to prompt meaningful action.<\/p>\n<p>While young people have been involved in movements such&nbsp;<a href=\"https:\/\/www.cnn.com\/2018\/03\/25\/us\/march-for-our-lives-slacktivism-trnd\/index.html\">as Occupy Wall Street and Black Lives Matter<\/a>&nbsp;over the past decade, the recent March for Our Lives protest signaled a major shift. Calling for gun policy reform, Millennials and their younger counterparts are beginning to demand real change at the polls. In fact, by 2020,&nbsp;<a href=\"https:\/\/www.sfchronicle.com\/opinion\/article\/Millennials-could-change-our-political-landscape-12667886.php\">Millennials are projected to supplant Baby Boomers<\/a>&nbsp;as the dominant generational voting group in the U.S.<\/p>\n<p>32% of Millennials report following politics and 26% admit to caring a lot about who controls Congress. But only 12% contacted their representative in the past year. Millennials are disappointed in today’s government, and yet still leaving opportunities to call for change on the table.&nbsp;How can we boost these numbers to ensure greater political engagement from Millennial voters and volunteers?<\/p>\n<p>It all starts with identifying the social issues that are most relevant to&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/disrupting-music-consumption\/\">Millennials<\/a>, and understanding the actions they take for these causes. Here are some helpful tips to keep in mind when mobilizing Millennials in support of your social movement or campaign:<\/p>\n<h2>Understand which Political Issues Millennials Care About<\/h2>\n<p>If you’re trying to reach Millennials, make sure that the cause you’re promoting resonates with this target audience. Achieve’s&nbsp;<a href=\"http:\/\/www.themillennialimpact.com\/\">Millennial Impact Report<\/a>&nbsp;examined Millennials’ political and cause-related behaviors in the past year. According to this study, civil rights\/racial discrimination (29%), employment\/job creation (26%), and healthcare reform (26%) are the hot-button issues Millennials care about most today. External factors ranging from seasonality to current events influence the issues that rise to top of mind for Millennials. To stay relevant, advocacy groups should adjust their messaging to reflect an ever-changing news cycle and shifting national priorities. All while staying true to their organization’s core mission and goals, of course.<\/p>\n<figure id=\"attachment_7080\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.themillennialimpact.com\/\"><img loading=\"lazy\" class=\"wp-image-7080\" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2018\/05\/politics-1.png\" alt=\"Millennials and Politics\" width=\"755\" height=\"426\"><\/a><figcaption class=\"wp-caption-text\">Source:&nbsp;<a href=\"http:\/\/www.themillennialimpact.com\/\">Millennial Impact Report<\/a><\/figcaption><\/figure>\n<p><a href=\"http:\/\/fluentinc.wpengine.com\/insight\/disrupting-music-consumption\/\">Millennials<\/a>&nbsp;devote most of their attention to local causes and organizations, either independent of, or alongside, political participation on a national level. They will support causes that align with their core values, often overlooking party affiliation or institutional loyalty in favor of an opportunity to improve the lives of others.&nbsp;<a href=\"http:\/\/www.themillennialimpact.com\/\">Nearly half (44%) of Millennials take social issue-related action because they are part of a group being treated unfairly<\/a>while a third act on behalf of a group they&nbsp;<em>observe<\/em>&nbsp;being mistreated. Not only are Millennials fighting for causes that affect their lives directly. They also practice empathy and compassion in working toward a greater good.<\/p>\n<h2>Offer Millennials Opportunities for Meaningful Political Involvement<\/h2>\n<p>Gone are the days of&nbsp;<a href=\"https:\/\/www.cnn.com\/2018\/03\/25\/us\/march-for-our-lives-slacktivism-trnd\/index.html\">slacktivism<\/a>, or passively supporting a cause on social media, without any real personal involvement or commitment. Instead, <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/millennial-food-habits\/\">Millennials<\/a>&nbsp;are combining social sharing with traditional forms of activism to further amplify their voices in the political arena.<\/p>\n<p>Millennials may not necessarily agree with the direction the country is headed (only 35% believe Trump is a successful president and&nbsp;<a href=\"http:\/\/www.themillennialimpact.com\/\">51% think we’re off track a year out from the 2016 election<\/a>). However, this doesn’t mean they don’t believe in the government’s ability to turn things around—for the better. In fact, Millennials’ concern with social issues most often translates into civic participation and further extends to grassroots efforts such as marches and rallies.<\/p>\n<p>Voting for political representatives with similar views, signing petitions, and posting\/sharing about causes on social media top the list of actions most frequently taken by&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/millennial-food-habits\/\">Millennials<\/a>. However, when considering which behaviors are most likely to make a measurable difference, the lineup shifts. Voting moves out of the top spot with&nbsp;<a href=\"http:\/\/www.themillennialimpact.com\/\">signing a petition (21%), attending a protest (16%), and attending a rally\/march (10%)<\/a>&nbsp;slated as behaviors with the greatest perceived capacity to incite change.<\/p>\n<h2>Tips for Connecting Millennials and Politics<\/h2>\n<p><strong><em>Empower Millennials with short-and long-term calls to action<\/em><\/strong><\/p>\n<p>Be mindful of how much your audience is willing and able to engage. Offer options for those who want to make a small contribution and those seeking a longer-term commitment. Are you looking for&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/millennial-food-habits\/\">Millennials<\/a>&nbsp;to vote for a political representative? Sign an online petition? Donate to your organization or simply share your message on social media? Clearly define your campaign KPIs, and make sure to collect and share stories that illustrate the real-world impact of your supporters’ efforts.<\/p>\n<p><strong><em>U<\/em><em>se SMS to reach Millennials where they’re most active<\/em><\/strong><\/p>\n<p><a href=\"http:\/\/fluentinc.wpengine.com\/insight\/devices-demographics-2017\/\">55% of Americans spend more time using a smartphone<\/a>&nbsp;than any other device, and mobile messaging surpasses both phone calls and emails as the top use case. Not only are Millennials texting their friends and family,&nbsp;<a href=\"http:\/\/www.businessinsider.com\/heres-how-millennials-are-impacting-the-future-of-communication-2017-1\">chat apps are also replacing email<\/a>&nbsp;as a more convenient and reliable way to communicate with brands and service providers.&nbsp;<a href=\"https:\/\/www.business.com\/articles\/6-reasons-brands-should-start-using-sms-marketing\/\">51% of millennials are willing to share their mobile number<\/a>&nbsp;for a good reason, and in this case, the opportunity to help others can serve as a carrot with far-reaching benefits. Take advantage of the high open rates (<a href=\"https:\/\/www.business.com\/articles\/6-reasons-brands-should-start-using-sms-marketing\/\">nearly 90%!<\/a>) and instant deliverability of this channel to initiate a survey, ask for a donation, or provide the opportunity to opt-in to alerts and information about your cause.<\/p>\n<figure id=\"attachment_7082\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"wp-image-7082 \" src=\"http:\/\/fluentcorp.wpengine.com\/wp-content\/uploads\/2018\/06\/political-sms.jpg\" alt=\"Millennials and Politics\" width=\"253\" height=\"495\"><figcaption class=\"wp-caption-text\">Source:&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insights\/\">Fluent<\/a><\/figcaption><\/figure>\n<p><strong><em>Leverage social media to humanize your cause and boost engagement<\/em><\/strong><\/p>\n<p>Use live video on Facebook and Instagram to connect people to your cause in real-time. For example, report live from a protest in Washington, D.C. and encourage viewers to comment and share online. Social initiatives can create a sense of community and inclusion that translates from the digital realm to IRL engagement. National and local media outlets are also drawing from Millennials’ social media contributions to supplement their own sources. In turn,&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/disrupting-music-consumption\/\">Millennials<\/a>&nbsp;have new opportunities to participate in the political conversation on a wider stage.<\/p>\n<p>18% of Millennials are likely to vote in the 2018 midterm elections. 26% are certain they will cast a ballot for the next president in 2020.&nbsp; Poised to make big changes in politics, the Millennial generation needs the right motivation to get started. Millennials do not always view politics as black and white, red and blue. Rather, they adopt a more nuanced approach to social issues and policy change. Give this tech-savvy generation the resources they need to become change-makers and advocates.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Millennials do not always view politics as black and white, red and blue. Rather, they adopt a more nuanced approach to social issues and policy change. Give this tech-savvy generation the resources they need to become change-makers and advocates. <a href=\"https:\/\/www.fluentco.com\/blog\/millennials-and-politics\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":359,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[138,178,183],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/358"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=358"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/358\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/359"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=358"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=358"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=358"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=358"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}