{"id":360,"date":"2018-06-21T04:59:52","date_gmt":"2018-06-21T04:59:52","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=360"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"inbound-call-marketing-guide","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/inbound-call-marketing-guide\/","title":{"rendered":"A Guide to Inbound Call Marketing: What’s the 411?"},"content":{"rendered":"<p>Cold calling used to be one of the greatest weapons in a salesperson’s arsenal, but then caller ID and texting came on the scene. Today, consumers will rarely answer a call from an unknown number (guilty!), let alone spend time on the phone with a salesperson pitching an unfamiliar product. Cue inbound call marketing.<\/p>\n<p>Marketers often defer to digital channels to drive engagement, but let’s not forget the untapped potential of the phone call. While the telephone has been around for the past 140 years, the inception of the smartphone has repositioned the inbound call as valuable tool for marketers. 90% of all customer conversations take place via phone, and calls drive 10 times more purchases than clicks.<\/p>\n<p>The assumption that the modern consumer would rather hide behind a screen than place a call is a common misconception. As compared to their older counterparts, 36% of Millennials have clicked on a call button in an online or mobile ad in the past 6 months and a quarter of those have purchased a product or service via call button during that same period. Bottom line: people (even Millennials!!) like to talk, and brands should listen up.<\/p>\n<figure id=\"attachment_7098\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.fluentco.com\/insight\/marketing-to-millennials\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"wp-image-7098 \" src=\"http:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/pay-per-call-stats.jpg\" sizes=\"(max-width: 544px) 100vw, 544px\" srcset=\"https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/pay-per-call-stats.jpg 531w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/pay-per-call-stats-300x189.jpg 300w\" alt=\"Click to call ads\" width=\"544\" height=\"342\" \/><\/a><figcaption class=\"wp-caption-text\"><a href=\"https:\/\/www.fluentco.com\/insight\/marketing-to-millennials\/\">Source: Fluent<\/a><\/figcaption><\/figure>\n<h1>What is Inbound Call Marketing?<\/h1>\n<p>Often referred to as “call commerce,” inbound call marketing involves driving, tracking, and optimizing inbound phone calls as a form of lead generation. Inbound callers are warm leads; they have already made contact with your brand through online marketing efforts. After identifying a need for your product or service they want to determine if your offering is the right fit. They are now reaching out, typically to a sales line, for more information.<\/p>\n<p>Inbound call marketing campaigns are usually measured on a performance basis. They allow marketers to engage in meaningful conversations with leads on their path to becoming customers. As drivers of inbound calls, publishers and performance marketing agencies get paid based on KPIs such as call duration, call outcome, or simply driving a qualified call to an advertiser.<\/p>\n<h1>Why Use Inbound Call Marketing?<\/h1>\n<p>A cold call to a prospect can often be a shot in the dark, but inbound callers are declaring their interest in your product or service the moment they dial the phone. Outbound call marketing (or cold calling) falls at the top of the consumer funnel. Inbound calls are a downstream marketing tactic: callers have already downloaded your content, subscribed to your newsletter, or even asked to receive text updates from your business. Now it’s up to you, the advertiser, to drive your value proposition home.<\/p>\n<p>All inbound calls are 100% user initiated, making inbound call marketing a highly effective acquisition channel. For marketers, this means higher engagement, higher quality leads, and most importantly, more conversions. In fact, inbound calls have proven to be more effective than web-based leads; research shows that <a href=\"https:\/\/blog.hubspot.com\/marketing\/inbound-call-strategy-infographic\">69% of people are more likely to hit a call button on a mobile phone<\/a> than going to a website.<\/p>\n<h1>How Does Inbound Call Marketing Work?<\/h1>\n<figure id=\"attachment_7099\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.invoca.com\/pay-per-call\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"wp-image-7099 size-full\" src=\"http:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/ppc-how-it-works.png\" sizes=\"(max-width: 660px) 100vw, 660px\" srcset=\"https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/ppc-how-it-works.png 660w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/ppc-how-it-works-150x150.png 150w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/ppc-how-it-works-300x300.png 300w\" alt=\"Inbound Call Marketing Infographic\" width=\"660\" height=\"660\" \/><\/a><figcaption class=\"wp-caption-text\"><a href=\"https:\/\/www.invoca.com\/pay-per-call\/\">Source: Invoca<\/a><\/figcaption><\/figure>\n<p>While consumers can certainly drop a line to your business after entering a query on a desktop, let’s focus on the mobile journey. BIA\/Kelsey estimates that <a href=\"http:\/\/www.biakelsey.com\/research-data\/current-research\/call-commerce-1-trillion-economic-engine\/#bia-purchase\">mobile calls represent 60 percent of inbound calls to businesses<\/a>. This equals <a href=\"http:\/\/www.biakelsey.com\/research-data\/current-research\/call-commerce-1-trillion-economic-engine\/#bia-purchase\">85 billion global mobile calls annually<\/a>, a figure that will grow to 169 billion by 2020.<\/p>\n<p>But where do these calls come from? Mobile calls to businesses are launched from a variety of different channels including:<\/p>\n<ul>\n<li>Paid and organic search<\/li>\n<li>Traditional display<\/li>\n<li>Paid social<\/li>\n<li>Landing pages (apps, emails, etc.)<\/li>\n<li>SMS and messaging apps<\/li>\n<\/ul>\n<p>Search drives the highest direct call volume, while paid social and messaging are emerging channels for generating high-intent leads. Verticals that offer big-ticket items with longer consideration cycles tend to see the most inbound call volume (<a href=\"http:\/\/www.biakelsey.com\/research-data\/current-research\/call-commerce-1-trillion-economic-engine\/#bia-purchase\">54% of consumers call a business because they need more information<\/a> than the website can provide before making a purchase decision). The <a href=\"http:\/\/www.biakelsey.com\/research-data\/current-research\/call-commerce-1-trillion-economic-engine\/#bia-purchase\">most opportune call-commerce verticals<\/a> are auto (i.e. new car), financial services (i.e. life insurance policy), and cable\/telecom (i.e. cellular contract).<\/p>\n<h1>Inbound Call Marketing: Best Practices<\/h1>\n<p><strong><em>Don’t play hard to get. Make your contact info easily accessible.<\/em><\/strong><\/p>\n<p>Sometimes, when we have a question, we want to speak with a real person for an answer in real time. Make it easy for a prospect to get in touch with your sales team, on their own terms. Plaster your phone number on your website, lead forms, emails, and landings pages. And don’t forget to test the placement, size, and color of your phone numbers to optimize for inbound calls.<\/p>\n<p><strong><em>Add click-to-call buttons to your mobile campaigns.<\/em><\/strong><\/p>\n<p>Inbound call marketing was practically made for mobile (or at least suits it best). While form fills and live chats lend themselves to desktop interactions, the click-to-call button reigns supreme on mobile. Make your call to action as clear as possible so prospects understand why they should dial and who will pick up.<\/p>\n<p><strong><em>Use real-time call tracking to ensure proper attribution and increase your inbound call volume.<\/em><\/strong><\/p>\n<p>According to a <a href=\"http:\/\/go.invoca.com\/wc-calls-are-the-new-clicks-ebook-lp?utm_source=hubspot&amp;utm_medium=referral&amp;utm_campaign=b2b-ebook\">recent Invoca survey<\/a> of marketers, 60% of respondents don’t know which of their marketing campaigns drive inbound calls and 68% are unable to track inbound calls in their marketing automation and CRM. Call tracking provides visibility into your pay-per-call campaign, allowing you to capture the keyword, ad, and landing page that a prospect viewed before making a phone call. At a more basic level, call frequency and duration can also serve as proxies for “call quality.”<\/p>\n<p><em> <\/em><strong><em>Integrate call tracking with your marketing automation and CRM system.<\/em><\/strong><\/p>\n<p>Syncing call tracking with your marketing automation system can give you a 360 view into your buyers’ path to purchase. Use “call intelligence” based on consumers’ previous online activity to route callers or craft highly relevant messaging. For example, if a prospect has already connected with a sales rep, follow up with content that speaks to their use case and pain points. If a prospect is just learning about your product, send them collateral that will help nudge them down the funnel.<\/p>\n<p><strong><em>Leverage SMS to drive high-value inbound calls.<\/em><\/strong><\/p>\n<p>Beyond phone calls, Millennials and the 35+ crowd alike <a href=\"https:\/\/www.fluentco.com\/insight\/marketing-to-millennials\/\">use their smartphones most often for messaging<\/a>. Since consumers are already having conversations via SMS, why not activate on this channel and use a text message to prompt inbound calls? <a href=\"https:\/\/www.fluentco.com\/insight\/sms-marketing-guide\/\">Text message marketing<\/a> – or SMS (short message service) marketing – is a technique using permission-based mobile messaging to distribute promotional or informational messages to a consumer. Warm up a prospect with a conversational text message and include a click to call CTA for more information. And if you want to learn more about SMS marketing, <a href=\"https:\/\/www.fluentco.com\/insight\/sms-marketing-guide\/\">Fluent can help<\/a>!<\/p>\n<h1>Inbound Call Marketing: Pay Per Call Pays Off<\/h1>\n<p>Why cold call prospects when you can have hot leads reach out to you directly? No one likes sitting up by the phone waiting for their beau to call. But when that phone finally does start to ring, you know the person on the other line is <strong><em>interested.<\/em><\/strong>  It’s no different for marketers. Integrate inbound call marketing with your multi-channel marketing strategy to generate high-intent leads and better tailor your messaging.<\/p>\n","protected":false},"excerpt":{"rendered":"<p> Integrate inbound call marketing with your multi-channel marketing strategy to generate high-intent leads and better tailor your messaging. <a href=\"https:\/\/www.fluentco.com\/blog\/inbound-call-marketing-guide\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":361,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[184],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/360"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=360"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/360\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/361"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=360"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=360"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=360"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=360"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}