{"id":365,"date":"2018-06-27T05:01:19","date_gmt":"2018-06-27T05:01:19","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?p=365"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"first-party-data-guide","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/first-party-data-guide\/","title":{"rendered":"What is First-Party Data and Why Should I Care?"},"content":{"rendered":"<p>If you have been in any marketing meeting over the past decade, you have probably heard lots and lots about data-driven campaigns, letting “the data do the talking”, or vague references about  “big data”. With programmatic marketing on the rise, increasing to <a href=\"https:\/\/www.emarketer.com\/Article\/eMarketer-Releases-New-Programmatic-Advertising-Estimates\/1015682?ecid=NL1001\">84% of marketing dollars by 2019<\/a>, advertisers are focusing more on how they are acquiring that data and where it is coming from. As the source of where the data comes from becomes increasingly more important, the topic of first-party data vs. third-party also gets addressed. To help clarify the buzz for you, we have put together the following guide.<\/p>\n<h2>Data Sources<\/h2>\n<p>When marketers run digital prospecting campaigns, we are using all types of data to reach the most ideal target audience. Just as it is important to take advantage of all effective marketing channels, it is just as imperative to utilize different types of data to make sure you are reaching the “right” audience. With all of the data now available at a marketer’s fingertips, understanding the source of the data and the value it provides is key to an overall data-driven strategy. However, it is important to note that not all data is created equal and that you should be mindful of the type of data that you are using to achieve certain campaign objectives.<\/p>\n<p>Let’s talk about where several types of data come from, from the most valuable to the least valuable.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-7107\" src=\"http:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data1.png\" sizes=\"(max-width: 808px) 100vw, 808px\" srcset=\"https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data1.png 903w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data1-300x149.png 300w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data1-768x380.png 768w\" alt=\"First-Party Data\" width=\"808\" height=\"400\" \/><\/p>\n<h3>First-Party Data: The Treasure Chest<\/h3>\n<p>Let’s start with the best and brightest. First-party data is generated and owned by your organization. It could be gathered from interactions you have with consumers on your website, scraped from your CRM, or compiled from marketing campaign engagement. Typically, brands use this type of data for retargeting purposes – which is why those campaigns have the highest ROI.<\/p>\n<p>The downside to first-party data: while it is the most accurate, most companies are unable to scale this type of dataset. It can be difficult to have the diverse reach and budget necessary to gathering substantial amounts of first-party data; this is also why your retargeting campaigns see such a high saturation rate.<\/p>\n<h4>Best Uses for First-Party Data<\/h4>\n<ul>\n<li>Content Personalization and Audience Insights<\/li>\n<\/ul>\n<p>First-party data analysis is the best way to learn more about your loyal customers, i.e. who is visiting your website and converting. It also creates an opportunity for you to personalize content and advertisements specifically for these prospects.<\/p>\n<h3>Second-Party Data: Phone a Friend<\/h3>\n<p>Second-party data is that which is shared directly with a partner and not combined with outside parties. A brand could gather their own first-party data and enter into an agreement where that same data is shared with another party to help with marketing and acquisition.<\/p>\n<p>Second-party data usually faces the same issues with scale as first-party data. However, because of the exchange of resources, the pool is slightly larger.<\/p>\n<h4>Best Uses for Second-Party Data<\/h4>\n<ul>\n<li>Increase Audience Scale and Build Partnerships<\/li>\n<\/ul>\n<p>Not only is this an opportunity to expand your reach in a reliable way – acquiring data from a trusted partner – this is also an avenue to build business or industry relationships. A relationship that allows businesses to mutually support and grow is a recipe for success.<\/p>\n<h3>Third-Party Data: Whisper-Down-The-Lane<\/h3>\n<p>Most data used in programmatic now is third-party data. If you are not familiar with buying programmatically, imagine your lookalike audiences used on Facebook. Unfortunately, this source is the least reliable because it has been aggregated from multiple sources and modelled out to expand the reach. Yes, this data source has the most expansive reach but there is the risk that it will be outdated, inferred, or inaccurate.<\/p>\n<h4>Best Uses for Third-Party Data<\/h4>\n<ul>\n<li>Enhance, Expand, Discover New Audiences<\/li>\n<\/ul>\n<p>Though this is the largest and least valuable source of data, it is the most widely used for good reason. Buying third-party data allows you to enhance what you already have through first-party data, expand your reach even further than second-party data could, and discover new segments that are perfect for your offering.<\/p>\n<h2>Data Types<\/h2>\n<p>Now that we can identify the sources of data, time to look at the type. These are not necessarily confined to each source, so pay attention!<\/p>\n<h3>Declared<\/h3>\n<p>Declared data is simply information that is volunteered by the user. This typically comes from registrations (i.e. form fills), promotional offers, or surveys. Often, users need to opt-in since the data could be tied to their profile. This is the best type of data, as it is the most reliable.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-7108 size-full\" src=\"http:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data-2.png\" sizes=\"(max-width: 332px) 100vw, 332px\" srcset=\"https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data-2.png 332w, https:\/\/n690p309p162lono41z3ayt1-wpengine.netdna-ssl.com\/wp-content\/uploads\/2018\/06\/data-2-254x300.png 254w\" alt=\"First-Party Data\" width=\"332\" height=\"392\" \/><\/p>\n<h3>Inferred<\/h3>\n<p>Inferred data is assigned to a user based on their internet activity; i.e. you browsed a trendy mattress website and suddenly, you are being served ads for all types of mattresses. Maybe the mattress was for a significant other or maybe you just wanted to check out how they fit an entire mattress into a tiny box. But now, programmatic buyers dabbling in third-party data sources will be serving you ads for mattresses for the foreseeable future.<\/p>\n<h3>Modeled<\/h3>\n<p>Modeled data, the last type, is a happy medium between inferred and declared data. This is where you get your lookalike audiences, which is a small audience – usually first-party data – analyzed for certain patterns, and expanded with third-party data based on those observations. Modeled data can be effectively used for targeting CPG product prospects.<\/p>\n<p>Propensity modeling is another sub-type, leveraging past behaviors to determine future behaviors and other potential customers. This is most useful when trying to reach a certain demographic or economic profile.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With programmatic marketing on the rise, increasing to 84% of marketing dollars by 2019, advertisers are focusing more on how they are acquiring that data and where it is coming from.  <a href=\"https:\/\/www.fluentco.com\/blog\/first-party-data-guide\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":366,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[172],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/365"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=365"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/365\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/366"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=365"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=365"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=365"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=365"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}