{"id":576,"date":"2018-04-23T11:56:09","date_gmt":"2018-04-23T11:56:09","guid":{"rendered":"http:\/\/fluentcorp.wpengine.com\/?post_type=fluent_practices&#038;p=576"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"list-management","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/list-management\/","title":{"rendered":"Avoiding CAN-SPAM: Why Lean and Mean is Best in List Management"},"content":{"rendered":"<p>Email has been with us for over 40 years now, with no signs that it will wane anytime soon. In fact, worldwide email usage is <a href=\"https:\/\/www.radicati.com\/wp\/wp-content\/uploads\/2016\/01\/Email_Statistics_Report_2016-2020_Executive_Summary.pdf\">forecasted to top 3 billion users by 2020; <\/a>great news for marketers who use email to reach prospects and current customers. However, the persistent question remains: who do I mail to and how can I manage my lists?<\/p>\n<p>As arguably the oldest digital marketing channel, email evolved from its early ‘wild west’ period, where marketers had did not have to focus on list management and had an unfettered ability to send email messages.  Over time, concerns from consumers, advocacy groups, legislators, and marketers led governments around the world to create regulations around <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/inbox-report-consumer-perceptions-email\/\">email marketin<\/a><a href=\"http:\/\/fluentinc.wpengine.com\/insight\/inbox-report-consumer-perceptions-email\/\">g<\/a> and list management as a whole. Here in the U.S., the Controlling the Assault of Non-Solicited Pornography and Marketing Act – better known by its less-sensational acronym CAN-SPAM – was passed in 2003.<\/p>\n<h2>What is CAN-SPAM?<\/h2>\n<p>There is a common misconception among non-digital marketers that CAN-SPAM was passed to prohibit companies from sending unsolicited or so-called SPAM emails. However, CAN-SPAM does the opposite. It sets up rules by which marketers are legally allowed to send unsolicited emails to recipients in the U.S. Ironically, the act sets up the rules by which marketers ‘can SPAM’ recipients.<\/p>\n<p>CAN-SPAM requires every commercial email give recipients their own ways to manage their list membership: an opt-out method (i.e. a way to unsubscribe). Once someone opts-out, the law also states that, “you cannot help another entity send email to that address or have another entity send email on your behalf to that address.”<\/p>\n<p>The Act also prohibits:<\/p>\n<ul>\n<li>False or misleading header information. A commercial email’s “From,” “To,” and routing information – including the originating domain name and email address – must be accurate and identify the entity that initiated the email.<\/li>\n<li>Deceptive subject lines. The subject line cannot mislead the recipient about the contents or subject matter of the message.<\/li>\n<\/ul>\n<p>The Act requires that a commercial email provide a return email address or another Internet-based response mechanism that allows a recipient to ask that they not be sent future email messages at that email address, and the sender must honor the requests. Any opt-out mechanism must be able to process opt-out requests for at least 30 days after a commercial email is sent.<\/p>\n<p>When an opt-out request is received, businesses have 10 business days to stop sending email to the requestor’s email address. After that period, no emails can be sent from the sender or from any third-party on the sender’s behalf. (This is an important stipulation for the affiliate marketing space.)<\/p>\n<p>While CAN-SPAM makes it illegal to sell or transfer the email addresses of users who opt-out of receiving their email messages, transfers are allowed if it is to help another business comply with the law. For example, an advertiser providing an opt-out list to a third-party mailer to ensure they suppress those addresses from their mailings.<\/p>\n<p>The Act also requires commercial email to contain clear and conspicuous notice that the message is an advertisement or solicitation and that the recipient can opt out of receiving more commercial email from the sender. Emails must also include a valid physical postal address for the entity. This is what you typically see in the footer of an email: the sender’s address and an unsubscribe link.<\/p>\n<h3>CAN-SPAM Penalties<\/h3>\n<p>Of course, one major reason a law is effective is the penalties imposed on those that break the rules. CAN-SPAM is no exception. Each separate email in violation of the law is subject to penalties of up to $41,484, and more than one entity may be held responsible for violations. For example, both the company whose product is promoted in the message and the company that originated the message may be held legally responsible. Therefore, advertisers that leverage affiliates or other third-parties for email marketing need the rules to be followed by their mailers. Additional fines, as well as criminal penalties, can be imposed for particularly egregious violations.<\/p>\n<h2>Best Practices for Managing Your Lists and Staying CAN-SPAM Compliant<\/h2>\n<p>Obviously, following the rules of CAN-SPAM is key to <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/inbox-report-consumer-perceptions-email\/\">operating a successful email marketing program<\/a>. Fortunately, most of the rules are straightforward. While determining what is or is not a deceptive subject line can certainly be ‘subjective’ (no pun intended), including an opt-out mechanism and honoring opt-out requests within a set timeframe are very cut and dried.<\/p>\n<p>Regarding managing your email list and opt-out requests, the best practice is for email marketers to make it very straightforward and easy for recipients to opt-out of future mailings. Including a recognizable link to a user-friendly opt-out page can help ensure strict compliance with CAN-SPAM. Additionally, making absolutely certain that every unsubscribe request is collected and acted upon within the 10-business day period (and honored thereafter) is vital. Lastly, using an up-to-date opt-out file for suppression purposes on all mailings (either in-house or by third-parties) is a must.<\/p>\n<h3>Additional Benefits of Removing Opt-outs from your Lists<\/h3>\n<p>After all of that, it’s probably clear that managing your lists through the opt-out process and honoring those requests is important for companies that want to steer clear of CAN-SPAM compliance issues. However, compliance isn’t the only reason that email marketers should be more than willing to remove opt-outs from their lists.<\/p>\n<p>Because email is a cost-effective channel with limited incremental cost in mailing an additional address, marketers often employ a ‘spray and pray’ approach to email list management. The idea that the more emails sent lead to more responses and sales was once commonplace. However, as the marketing channel matured, marketers saw the downsides of the old more-is-more approach and shifted to more of a ‘lean and mean’ philosophy when it comes to email list management.<\/p>\n<h2>Better List Management Can Lead to Higher Delivery Rates<\/h2>\n<p>The first challenge every email marketer faces once they hit ‘send’ on a campaign is getting their messages into a recipient’s inbox, avoiding the SPAM folder. As email providers evolve, they become more sophisticated in how they flag certain messages as SPAM.  If an email arrives at the recipient’s email provider and is identified as coming from a source that has perceived lower quality (as identified by IP address, email marketing platform, etc.), it is more likely to be routed to the recipient’s SPAM folder. This reputation comes from a variety of factors, but the history of emails from the same source comes into play – for example, if recipients consistently flag emails from a source as SPAM, future emails from that source may be more likely to be preemptively flagged by the recipient’s email provider. Managing lists to keep them as clean as possible, removing opt-outs, as well as bounces and other ‘bad’ email addresses, may increase the percentage of emails that are delivered to recipient inboxes.<\/p>\n<h3>List Management Tip: Mailing to Unengaged Recipients is Counterproductive<\/h3>\n<p>Even beyond the impacts on deliverability, mailing to a clean email list can also reduce the likelihood of negative<a href=\"http:\/\/fluentinc.wpengine.com\/insight\/check-out-fluents-spring-2016-sign-me-up-look-book\/\">brand impact from being thought of as a ‘spammer’ by consumers<\/a>. No advertiser wants to be perceived negatively by consumers. But, this is exactly what can happen when a consumer keeps receiving promotional email from a brand that they have either opted out from, consistently marked as SPAM, or always delete without opening over a long period of time. For a company that may have multiple brands under its umbrella, that negative perception can easily transfer from one brand to others. By removing non-responders, bounces, and those who flag messages as SPAM can help reduce negative brand impression and boost overall response.<\/p>\n<p>There are numerous advantages to maintaining a lean and mean email list. Compliance with CAN-SPAM is a vital <a href=\"http:\/\/fluentinc.wpengine.com\/insight\/inbox-report-consumer-perceptions-email\/\">foundation of your email marketing program<\/a>, but there is any number of real benefits to be gained by going above and beyond simply adhering to the rules.<\/p>\n<p>***This article should NOT be taken as legal advice.  I would encourage you to visit the <a href=\"https:\/\/www.ftc.gov\/tips-advice\/business-center\/guidance\/can-spam-act-compliance-guide-business\">FTC website <\/a>for more information on CAN-SPAM or to obtain professional legal advisement as to how to comply with the law.<\/p>\n<h5>Tom Wozniak, Executive Director of Marketing at OPTIZMO Technologies<\/h5>\n<p>Tom is a marketing and ad tech industry veteran, with over 20 years of experience in the digital arena. Prior to joining OPTIZMO, Tom was VP of Marketing at SpotX, an ad tech company in the digital video industry. He has also headed up marketing for Media Breakaway\/<a href=\"http:\/\/affiliate.com\/\">affiliate.com<\/a> and held leadership roles with multiple digital technology startups. Tom has written for a number of blogs and has also had articles included in various industry publications like FeedFront and Adotas. Tom lives in Denver, where he is active in the local startup community.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Email has been with us for over 40 years now, with no signs that it will wane anytime soon. In fact, worldwide email usage is forecasted to top 3 billion users by 2020; great news for marketers who use email to reach &hellip; <a href=\"https:\/\/www.fluentco.com\/blog\/list-management\/\">Read More<\/a><\/p>\n","protected":false},"author":4,"featured_media":577,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[139],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/576"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=576"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/576\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/577"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=576"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=576"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=576"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=576"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}