{"id":7268,"date":"2018-08-30T19:21:37","date_gmt":"2018-08-30T19:21:37","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7268"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"how-marketers-can-drive-mobile-user-acquisition-through-diversification","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/how-marketers-can-drive-mobile-user-acquisition-through-diversification\/","title":{"rendered":"How Marketers Can Drive Mobile User Acquisition Through Diversification"},"content":{"rendered":"<p><em>Reposted from <a href=\"https:\/\/www.mobilemarketer.com\/news\/how-marketers-can-drive-mobile-user-acquisition-through-diversification\/531249\/\" target=\"_blank\" rel=\"noopener noreferrer\">Mobile Marketer<\/a><\/em><\/p>\n<p>As discomfort over Facebook data privacy and accuracy continue to plague the mobile acquisition space, user acquisition managers should be looking to diversify their marketing strategies. Facebook has long been the god of driving high volume installs, and Google is a burgeoning threat with universal app campaigns, but marketers should be worried about &#8220;what ifs.&#8221;<\/p>\n<p>These giants could be knocked out by something mysterious and unexpected like a data breach or an illegal transaction. Campaign costs could skyrocket due to an influx of competition, rendering this method of acquisition unreasonably expensive.<\/p>\n<p>Facebook and Google should be part of your marketing and advertising strategy. Looking to other channels to bolster scale and deepen insights is a strategic and necessary move.<\/p>\n<h4><strong>Know the user<\/strong><\/h4>\n<p>Coaxing prospects down the funnel typically means gathering and leveraging data points, from where your users live and work to the times of day they check their email or play games on a mobile device. Marketers are digital spies, using these insights to target consumers as precisely as possible. If you have checked your Facebook profile recently to examine how the advertising giant pigeonholed you, the profile probably featured unfamiliar attributes inferred from your social media behavior.<\/p>\n<p>This flavor of advertising is a one-way street. While acquisition specialists may not have the capability to &#8220;talk back&#8221; to users until they are in-app, there are ways to get creative. Instead of treating your prospects as a research project, develop a relationship through interactive marketing and advertising.<\/p>\n<h4><strong>Rewarded and playable video ads<\/strong><\/h4>\n<p>As social advertising gurus preach, find users where they are and engage them with the type of content they already enjoy. At first, that meant disguising Facebook and Instagram ads as posts, and the small &#8220;sponsored&#8221; denotation on search ads became progressively harder to spot. Now, it means taking an extra step to get familiar with a prospect.<\/p>\n<p>Rewarded video and playable ads ranked as the most acceptable ad formats by mobile users and eMarketer estimates over three-fourths of mobile ad spending in the US will flow to native apps this year. These ads offer users the opportunity to seamlessly play through a game and be rewarded for engaging with the video without exiting the original experience.<\/p>\n<p>As seen with free trials for subscription-based apps, users are far more likely to stay engaged if they have already given it a test run. Though both formats for ad serving are still being perfected, it feels native, non-invasive and is effective. Video ads also provide a happy medium for brands and marketers, balancing a desire for creativity with a healthy ROI.<\/p>\n<h4><strong>Content marketing<\/strong><\/h4>\n<p>Content marketing is not just for B2B. Your most valuable users are already out there looking for you. Give them a place to find you through a sponsored post on a content site, producing your own blog or sponsoring an existing app user to demonstrate the app&#8217;s value proposition on social media. Content sites have been gaining traction through social advertising and organic traffic, allowing for previously unattainable scale and quality.<\/p>\n<p><em>The above is a guest post for <a href=\"https:\/\/www.mobilemarketer.com\/\">Mobile Marketer<\/a> from George Eames, Director of Mobile Operations at <a href=\"https:\/\/www.fluentco.com\/\">Fluent Inc.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>While Facebook and Google should be part of your marketing  strategy, looking to other channels to bolster scale and deepen insights is a strategic and necessary move. <a href=\"https:\/\/www.fluentco.com\/blog\/how-marketers-can-drive-mobile-user-acquisition-through-diversification\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":7864,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[162,186],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7268"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7268"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7268\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7864"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7268"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7268"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7268"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7268"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}