{"id":7273,"date":"2018-09-07T20:49:49","date_gmt":"2018-09-07T20:49:49","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7273"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"mobilizing-millennials-beyond-likes-and-shares","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/mobilizing-millennials-beyond-likes-and-shares\/","title":{"rendered":"Politics With Purpose: Mobilizing Millennials Beyond Likes And Shares"},"content":{"rendered":"<p><em>Resposted from <a href=\"https:\/\/www.mediapost.com\/publications\/article\/324809\/politics-with-purpose-mobilizing-millennials-beyo.html\" target=\"_blank\" rel=\"noopener noreferrer\">MediaPost<\/a><\/em><\/p>\n<p>While young people have been involved in movements like Occupy Wall Street and Black Lives Matter over the past decade, the recent March for Our Lives protest signaled a major shift. As advocates of gun policy reform, millennials are demanding real change at the polls.<\/p>\n<p>To sustain this momentum and encourage engagement, political campaigns, nonprofit organizations, and advocacy groups need to identify the most relevant social issues and understand the actions millennials are willing to take in support of these causes.<\/p>\n<p>Gone are the days of slacktivism (the “pejorative term that describes social media activism carried out with little personal effort,” according to a CNN.com op-ed). Millennials are flexing their civic muscles and participating in political action beyond a simple like or share. Their concern with social issues most often translates to voting behavior and extends to grassroot efforts like marches and rallies.<\/p>\n<p>Not only are millennials fighting for causes that affect their lives directly, they also practice empathy and compassion in working toward a greater good. <a href=\"http:\/\/www.themillennialimpact.com\/\">One-third act on behalf of a group they observe being mistreated<\/a> while nearly half of millennials take social issue-related action because they are part of a group being treated unfairly.<\/p>\n<h4><strong>Use SMS to Reach Millennials<\/strong><\/h4>\n<p>Faced with cluttered email inboxes and a <a href=\"https:\/\/www.fluentco.com\/resources\/can-cable-survive-the-threat-of-streaming-services\/\">shrinking cable audience<\/a>, candidates and organizations are shifting their ad dollars to a more engaging channel: SMS. Millennials are already highly active and primed for engagement on their mobile devices. Less invasive than phone calls and more likely to be read than emails, text messages are a fast and efficient way to engage voters, volunteers, and advocates in real-time conversations.<\/p>\n<p>Leveraging the text message as a political tool, Democrats have led the charge as the earliest adopters and champions of SMS, according to this <em>New York Times <\/em><a href=\"https:\/\/www.nytimes.com\/2018\/08\/01\/technology\/campaign-text-messages.html\">article<\/a>. Bernie Sanders used a peer-to-peer texting platform to organize volunteers during the 2016 Democratic primary elections. Alexandria Ocasio-Cortez, winner of the Democratic primary for the Fourteenth Congressional District of New York in June 2018, turned to the texting app Relay to help drive interest and voters to the polls.<\/p>\n<p>Seeking resources beyond their in-house email lists to expand their reach and drive actions in real-time, campaigns and causes are also turning to outside vendors for access to TCPA-consented phone numbers.<\/p>\n<p>Mobile offers the perfect channel to deploy targeted text message campaigns with clear calls to action. <a href=\"https:\/\/www.martechadvisor.com\/articles\/interactive-marketing\/sms-marketing-and-tts-evolution-over-time\/\">SMS has a 98% open rate,<\/a> and 83% of these messages are read within three minutes of delivery. And 51% of millennials are willing to share their mobile number for a good reason and the opportunity to help others, according to a Simmons National Consumer Study.<\/p>\n<p>Organizers should take advantage of the instant deliverability of this channel to initiate a survey, solicit a donation, recruit volunteers, or provide the opportunity to opt in to alerts and information about their cause.<\/p>\n<p>By 2020, <a href=\"https:\/\/www.sfchronicle.com\/opinion\/article\/Millennials-could-change-our-political-landscape-12667886.php\">millennials are projected to supplant baby boomers<\/a> as the dominant generational voting group in the U.S. Poised to make big changes in politics, millennials need the right motivation to get started. For this tech-savvy generation, it will take innovation-driven campaigns and rallying cries that appeal to their core values to prompt meaningful action.<\/p>\n<p><em>The above is a guest post for <a href=\"https:\/\/www.mediapost.com\/\">MediaPost<\/a> by Jeff Pavelcsyk, Director of Enterprise Accounts at <a href=\"https:\/\/www.fluentco.com\/\">Fluent, Inc.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Faced with cluttered email inboxes and a shrinking cable audience, candidates and organizations are shifting their ad dollars to a more engaging channel: SMS. <a href=\"https:\/\/www.fluentco.com\/blog\/mobilizing-millennials-beyond-likes-and-shares\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":7865,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[178,183,187],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7273"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7273"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7273\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7865"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7273"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7273"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7273"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7273"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}