{"id":7408,"date":"2018-11-26T19:37:08","date_gmt":"2018-11-26T19:37:08","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7408"},"modified":"2020-12-29T02:19:12","modified_gmt":"2020-12-29T02:19:12","slug":"user-acquisition-beyond-duopoly","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/user-acquisition-beyond-duopoly\/","title":{"rendered":"Driving Quality Mobile User Acquisition Beyond the Duopoly"},"content":{"rendered":"<p>With the investigation into Facebook’s data privacy policy still in the rearview mirror, marketing strategists muddle over the safest way to grow their businesses. Where is the data coming from? How is it obtained? What is the recency, level of engagement, potential monetization?<\/p>\n<p>Facebook has long been the god of driving high volume installs. Google is a burgeoning threat with universal app campaigns, but marketers should be worried about, “What ifs.”<\/p>\n<p>Marketing managers should be looking to diversify their <a href=\"https:\/\/www.fluentco.com\/resources\/mobile-app-marketing\/\">user acquisition strategies<\/a>. But first, let’s talk about Facebook App Install campaigns and Google’s UAC.<\/p>\n<h2>What are the benefits of Facebook App Install ads?<\/h2>\n<p>The social media giant boasts the ability to access, contact, and engage potential users through app install ads. The biggest selling point is the ability to gather useful data on how your app is used through the install campaign. By adding the <a href=\"https:\/\/www.facebook.com\/business\/learn\/facebook-create-ad-app-install-engagement\">Facebook SDK, marketing specialists can measure installs<\/a>, app events, add deep links into ads, optimize targeting and re-engagement, and measure in-app monetization.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-7409 size-full\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/facebook-user-acquisition.png\" alt=\"Facebook App Install Ads\" width=\"246\" height=\"442\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/facebook-user-acquisition.png 246w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/facebook-user-acquisition-167x300.png 167w\" sizes=\"(max-width: 246px) 100vw, 246px\" \/><\/p>\n<p>Like other Facebook ad campaigns, the biggest advantage marketers gain is through the audience insights. With an extensive, scalable audience that can be pared down into interest-based or demographic segments and layered with retargeting and\/or lookalikes, Facebook is the number-one driver of app installs for good reason.<\/p>\n<h2>What are the benefits of Google Universal App campaigns?<\/h2>\n<p>These campaigns streamline the process of promoting your app across all Google properties, from Search and Display to Google Play, AdMob, and YouTube. Like Google Ads, marketers choose bids and can <a href=\"https:\/\/www.apptamin.com\/blog\/universal-app-campaigns-assets\/\">optimize based on a selected objective, i.e. install or in-app action<\/a>.<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"alignnone wp-image-7410 size-full\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/google-user-acquisition-e1543260924776.png\" alt=\"Google UAC\" width=\"800\" height=\"554\" \/><\/p>\n<p><a href=\"https:\/\/support.google.com\/google-ads\/answer\/6247380?hl=en\">Universal App ads can be generated from the app’s listing in the app store<\/a>, including images and video, as well as from original text ideas. The major benefit here comes from the search engine’s extensive audience. Google is a verb, an action that users take every day. Though you may be paying a premium, advertising on this platform is a way to show up in the right place, at least some of the time.<\/p>\n<h2>Why Do I Need to Diversify My User Acquisition?<\/h2>\n<p>While Facebook and Google are the most popular choices, there is always a risk associated with putting all your eggs in one (or two) baskets. The data you leverage through these platforms (ahem, Facebook) is not always accurate. Consider what Facebook knows about you based on old groups you joined, events you have been invited to, or &#8220;interests&#8221; that are implied through your social activity. Those are the same categories that are used to target new users. Moreover, costs could skyrocket due to an influx of competition and your user acquisition campaign prices could become unreasonably expensive.<\/p>\n<p>Facebook and Google should absolutely be a part of your <a href=\"https:\/\/www.fluentco.com\/resources\/mobile-app-marketing\/\">marketing and advertising strategy<\/a>. However, looking to other channels to bolster scale and deepen insights is a strategic and necessary move.<\/p>\n<h2>Better User Acquisition Begins with Knowing Your Ideal App User<\/h2>\n<p>Coaxing prospects down the funnel typically means gathering and leveraging data points, from where your users live and work to the times of day they check their email or play games on a mobile device. Marketers are digital spies, using these insights to target consumers as precisely as possible. If you have checked your <a href=\"http:\/\/www.alphr.com\/facebook\/1003521\/see-everything-facebook-knows-about-you-here-s-how\">Facebook profile recently to examine how the advertising giant pigeonholed you<\/a>, the profile probably featured unfamiliar attributes inferred from your social media behavior.<\/p>\n<p>This flavor of advertising is a one-way street. While acquisition specialists may not have the capability to “talk back” to users until they are in-app, there are ways to get creative.  Instead of treating your prospects as a research project, develop a relationship through interactive marketing and advertising.<\/p>\n<p>As social advertising gurus preach, find users where they are and engage them with the type of content they already enjoy. At first, that meant disguising Facebook and Instagram ads as posts, and the small “sponsored” denotation on search ads became progressively harder to spot. Now, it means taking an extra step to get familiar with a prospect.<\/p>\n<h3>Rewarded Video<\/h3>\n<p><a href=\"https:\/\/www.facebook.com\/business\/help\/1808815812765433\">Rewarded video<\/a> and playable ads <a href=\"https:\/\/www.emarketer.com\/Article\/Mobile-App-Users-Warm-Rewarded-Video-Playable-Ads\/1016646\">ranked as the most acceptable ad formats<\/a> by mobile users and eMarketer estimates <a href=\"https:\/\/forecasts-na1.emarketer.com\/584b26021403070290f93a57\/5851918a0626310a2c186a4e\">over three-fourths of mobile ad spending in the US will flow to native apps this year<\/a>. As seen with <a href=\"https:\/\/www.mediapost.com\/publications\/article\/319602\/why-app-installs-have-become-meaningless-driving.html\">free trials for subscription-based apps<\/a>, users are far more likely to stay engaged if they have already given it a test run. Though both formats for ad serving are still being perfected, it feels native, non-invasive, and is effective.<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"alignnone wp-image-7412 size-full\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/rewarded-video-chart-e1543260949903.png\" alt=\"Rewarded Video for User Acquisition\" width=\"1000\" height=\"617\" \/><\/p>\n<h4>How Rewarded Video Works<\/h4>\n<p>These ads offer users the opportunity to seamlessly play through a game and be rewarded for engaging with the video without exiting the original experience. While the proportion of mobile users converting in-app<\/p>\n<h3>Playable Video Ads<\/h3>\n<p>Playable video ads are exactly what they sound like: advertisements that you can play through. These ads offer users snippets of gameplay, known as micro-games, feature a call to action, and are usually under a minute. The offering provides a happy medium for brands and marketers, balancing a desire for creativity with a healthy ROI.<\/p>\n<p>Yes, both Facebook and Google offer playable ads, but they are not the only ones.<\/p>\n<h4>How Playable Video Works<\/h4>\n<p>A playable ad is a high-quality video – in portrait mode – that is responsive to varying screen sizes. The game should be coded in HTML5, in a single file, and compressed. The video itself should guide players using visual cues while drawing interactions throughout the experience.<\/p>\n<p><a href=\"https:\/\/www.smartly.io\/blog\/try-before-you-buy-playable-ads-for-gaming-and-app-advertisers\">A positive experience significantly increases the chances of an install<\/a>, which typically means seeking the sweet spot. Your mini-game shouldn’t be too simple or difficult but needs to intrigue the user into wanting to play more. Make sure that the user can convert at any time! Which means featuring a visible CTA on the screen throughout the advertisement.<\/p>\n<h3>Content Marketing<\/h3>\n<p><a href=\"https:\/\/thesmartwallet.com\/\">Content marketing is not just for B2B<\/a>. Your most valuable users are already out there looking for you. Give them a place to find you through a sponsored post on a content site, producing your own blog, or sponsoring an existing app user to demonstrate the app’s value proposition on social media. Content sites have been gaining traction through social advertising and organic traffic, allowing for previously unattainable scale and quality.<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"alignnone wp-image-7411 size-full\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2018\/11\/content-marketing-ua-e1543260333659.png\" alt=\"Content Marketing for User Acquisition\" width=\"500\" height=\"387\" \/><\/p>\n<h4>How User Acquisition Driven Content Marketing Works<\/h4>\n<p>Not only does content marketing lend credibility to your app, but the results can also be measured like any other marketing channel. Provided the links to your app have tracking appended correctly, you can easily attribute last clicks to individual articles. By adding tracking into any advertising leading to the article, you can view the importance of an article – where it generally falls in the install path. Finally, with all this attribution, you can measure the lifetime value of the users that download through this medium.<\/p>\n<p>If you’re not interested in running your own user acquisition-focused content marketing, there are <a href=\"https:\/\/thesmartwallet.com\/\">plenty of places to outsource<\/a>.<\/p>\n<h3>Influencer Marketing<\/h3>\n<p>Influencer marketing is already used by <a href=\"http:\/\/www.ana.net\/content\/show\/id\/48437\">75 percent of national advertisers<\/a>, and half of those are preparing to increase spend in this channel over the next twelve months. This easily eliminates a significant burden of creating user-generated content and running brand awareness campaigns in-house. Brand-created digital video ads viewed on desktop earn a CTR of .6%, <a href=\"https:\/\/www.biznessapps.com\/blog\/3-apps-use-influencers-drive-installs\/\">when influencer videos have a rate of 2.0% industry-wide<\/a>. Where app-install campaigns on search and social are unable to engage users in a meaningful way, adding an extra step to the process, through a vlog, blog, or Snap Story, produces greater brand trust, likely resulting in higher lifetime value.<\/p>\n<h4>How User Acquisition Driven Influencer Marketing Works<\/h4>\n<p>Snap’s self-serve ad platform and Instagram story ads continue to increase in popularity while capitalizing on the <a href=\"https:\/\/www.searchenginejournal.com\/ephemeral-content\/238589\/\">efficiency of ephemeral content<\/a>. Users watch an ad for a few seconds, and if it is effective they swipe through to additional content to learn more. <a href=\"https:\/\/www.adweek.com\/digital\/snapchat-story-ads-work-heres-how-to-see-success-in-seconds\/\">The best performing ads served on these platforms also feature user generated content<\/a>, mostly likely bolstered by an influencer.<\/p>\n<h2>Don’t Forget! Measuring Success of Your User Acquisition Campaigns<\/h2>\n<p>Diversifying marketing plans by adding fresh players to the game should replace the scale lost by moving away from the Facebook and Google duopoly. Marketers can also expect an increase in the quality of users as their strategy moves away from fuzzy, inferred data.<\/p>\n<p>Being equipped with the right tracking platform to understand incrementality and the impact of each new acquisition strategy is key. The mobile space can only evolve if publishers and advertisers understand what is working – and how to escape what is not.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the investigation into Facebook’s data privacy policy still in the rear-view mirror, marketing strategists muddle over the safest way to grow their businesses.  <a href=\"https:\/\/www.fluentco.com\/blog\/user-acquisition-beyond-duopoly\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":7419,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[162],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7408"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7408"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7408\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7419"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7408"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7408"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7408"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}