{"id":7429,"date":"2018-12-10T17:31:41","date_gmt":"2018-12-10T17:31:41","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7429"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"what-is-performance-marketing","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/what-is-performance-marketing\/","title":{"rendered":"What is Performance Marketing?"},"content":{"rendered":"<p><a href=\"https:\/\/www.fluentco.com\/performance-marketing-solutions\/\">Performance marketing<\/a> is the method by which digital advertisers pay based on an event or action as opposed to a set price. For example, marketers would pay by click, download, landing page view, install, or engagement metric.<\/p>\n<h3>How Performance Marketing Became Popular<\/h3>\n<p>Though <a href=\"https:\/\/www.fluentco.com\/performance-marketing-solutions\/\">performance marketing<\/a> has existed in various forms for a few years, there has been a recent movement to hold marketers and advertisers to a higher standard, particularly when it comes to lead generation. It is not enough to generate impressions on a billboard or display advertisements; businesses want transparency and results: the ability to tie marketing dollars directly to converted customers. To put it bluntly, marketers wanted to increase ROI while decreasing wasted spend.<\/p>\n<h2>How Performance Marketing Works<\/h2>\n<p>With the expansion of digital advertising platforms such as Facebook and Google AdWords, or native platforms like Taboola and <a href=\"https:\/\/www.outbrain.com\/blog\/performance-marketing\/\">Outbrain<\/a>, advertisers practicing performance marketing would be charged when their advertisements were shown or clicked on by a member of the defined audience. This model is generally referred to as cost per click, cost per impression, or cost per lead.<\/p>\n<h3>Benefits of Performance Marketing<\/h3>\n<p>This model of marketing came about because of the direct benefits to the buyer. When advertisers run <a href=\"https:\/\/www.fluentco.com\/performance-marketing-solutions\/\">performance marketing campaigns<\/a>, they assume the risk that was previously on the business – instead of paying a flat fee, business will only sign a check after receiving tangible results.<\/p>\n<p>This results in a higher focus on the ROI of marketing campaigns, as well as an easier way to track the performance of campaigns.<\/p>\n<h3>Measurement for Performance Marketing<\/h3>\n<p><a href=\"https:\/\/www.fluentco.com\/performance-marketing-solutions\/\">Performance marketing is completely measurable<\/a>. Instead of estimating impressions of an advertisement in a magazine based on subscription numbers back-tracking the results based on an uptick in certain sales, performance marketing allows businesses to know the exact cost of each action taken. Some of the popular ways to measure are by:<\/p>\n<ul>\n<li>Lead (CPL)<\/li>\n<li>Click (CPC)<\/li>\n<li>Pageview<\/li>\n<li>Install (CPI)<\/li>\n<li>Submit<\/li>\n<li>Engagement (CPE)<\/li>\n<li>Impression (CPM)<\/li>\n<li>Conversion\/Acquisition (CPA)<\/li>\n<li>Video View<\/li>\n<li>Download<\/li>\n<\/ul>\n<h3>Types of Performance-based Marketing<\/h3>\n<p>Performance marketing offerings vary depending on goals set by the marketer. As with all marketing campaigns, it is best to reach consumers in the way they want to be reached – if that is through email, SMS, mobile ads, calls, etc. Types of performance marketing include the following:<\/p>\n<h3>Display Advertising<\/h3>\n<p>Display ads on major platforms (i.e. Google) generally still charge per impression, since these ads are like putting up a billboard on a highway. High traffic sites featuring display ads generate a lot of impressions, scrolls, and potentially clicks. However, newer versions of <a href=\"https:\/\/www.fluentco.com\/lead-generation\/\">performance-based display advertising<\/a> allow marketers to conserve their budget and capitalize on the down-funnel action, like a click or engagement in a playable ad.<\/p>\n<h3>Mobile User Acquisition<\/h3>\n<p>Growing mobile apps can be tricky, especially when quality users are hard to come by. With the pervasiveness of fraud in the industry, <a href=\"https:\/\/www.fluentco.com\/mobile-user-acquisition\/\">mobile marketers have turned to performance marketing to help<\/a> grow their user base. From paying for an install to paying for completing a level in a game, performance marketing has proved to be invaluable to mobile apps.<\/p>\n<h3>Outbound and Inbound Call Marketing<\/h3>\n<p>Pay-per-call marketing is not dead, though regulations around it are getting stronger and fewer people now use a home phone or landline. For businesses that run <a href=\"https:\/\/www.fluentco.com\/inbound-call-marketing\/\">pay-per-call campaigns, moving to a performance marketing basis<\/a> makes sense; most campaigns will charge for a certain amount of time on the phone.<\/p>\n<p><a href=\"https:\/\/www.fluentco.com\/inbound-call-marketing\/\">For inbound calling, prospects themselves will be pre-qualified<\/a> when they dial in to receive more information on an offer. This is also on a timed-basis, allowing brands to choose the length of time that they consider being of marketing value.<\/p>\n<h3>Content Marketing<\/h3>\n<p>Content is king and as more businesses add content marketing to their strategies, they are outsourcing the writing to avoid onboarding a full-time employee. However, holding your content marketers to the same standards as other digital acquisition specialists just make sense. Enter <a href=\"https:\/\/www.fluentco.com\/lead-generation\/\">performance-based content marketing<\/a>. Businesses can choose to pay based on predetermined goals from the written piece, i.e. referral traffic, lead form fill, ranking on the SERP, etc.<\/p>\n<h3>Re-engagement through Push Notifications and SMS<\/h3>\n<p>Messaging channels like push and SMS naturally lend themselves to a performance model. Businesses are happy to pay for an action taken when the SMS generates an inbound call, a text back, or some other measurable result. Similarly, push notifications can be deployed to encourage a click through to an article, a feature in-app, or to update your preferences on a website; all which can be measured and charged accordingly.<\/p>\n<h3>Lead Generation<\/h3>\n<p><a href=\"https:\/\/www.fluentco.com\/lead-generation\/\">Performance-based lead generation<\/a> has recently become the norm with the popularity of programmatic social advertising, like Facebook, Twitter, and LinkedIn. By choosing the success metric, marketers can control and optimize for cost-per-lead. Performance marketing for lead generation is typically driving a form fill, download, install, or any type of action that would gather the personal information of a consumer.<\/p>\n<h3>Search Engine Marketing and Social Engagement<\/h3>\n<p>Whether you are executing SEM in-house or through an agency, this type of marketing is absolutely performance-based.<\/p>\n<p>Like SEM, social media marketing lets you, “choose your own adventure” when setting up advertising campaigns. Businesses can set the goal they are interested in paying for, from a click to a lead form-fill.<\/p>\n<h3>Innovation in Performance Marketing<\/h3>\n<p>In recent years, <a href=\"http:\/\/www.marketing-schools.org\/types-of-marketing\/performance-marketing.html\">performance marketing<\/a> has evolved to move advertising efforts from traditional (print, television) to digital. Digital performance marketing is focused on reaching the right people at the right time to drive a specific result. Marketers are taking it a step further and moving from desktops to tablets and mobile devices.<\/p>\n<h2>Who Can Use Performance Marketing<\/h2>\n<p>All marketers can use performance marketing to reach their goals. With the evolution of performance marketing, and generally, digital marketing, search engine marketers, social media marketers, and content marketers need to develop new, innovative ways to reach their target audiences. This requires knowing more about each consumer and their intent. Armed with the right tools and partners, all businesses can see success with <a href=\"https:\/\/www.smartinsights.com\/digital-marketing-strategy\/digital-strategy-development\/performance-based-marketing-need-know\/\">performance marketing<\/a>.<\/p>\n<h2>How Fluent Can Achieve Your Goals<\/h2>\n<p>Fluent provides scalable, performance marketing services to sustainably grow your business. We are eager to help you define your goals, your target audience, and your offering to deliver tangible results. We leverage all advertising mediums and proprietary consumer insights to drive customer acquisition, loyalty, and reactivation.<\/p>\n<p>Increase your return on marketing dollars by switching to performance marketing. When you succeed, we succeed.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Performance marketing is the method by which digital advertisers pay based on an event or action as opposed to a set price. For example, marketers would pay by click, download, landing page view, install, or engagement metric. How Performance Marketing &hellip; <a href=\"https:\/\/www.fluentco.com\/blog\/what-is-performance-marketing\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":7430,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[182],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7429"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7429"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7429\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7430"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7429"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7429"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7429"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7429"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}