{"id":7553,"date":"2019-03-08T16:38:45","date_gmt":"2019-03-08T16:38:45","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7553"},"modified":"2020-12-30T17:10:38","modified_gmt":"2020-12-30T17:10:38","slug":"rampup-recap-five-key-themes","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/rampup-recap-five-key-themes\/","title":{"rendered":"RampUp Recap: 5 Key Themes Steering the Data Conversation"},"content":{"rendered":"<p>It’s no surprise that data was a primary focus among speakers and attendees at RampUp2019, LiveRamp’s premier&nbsp;conference for leaders in martech. Last week, industry experts converged on the historic Fairmont Hotel in San Francisco to discuss ways to access, activate, and analyze data in smarter and more cost-effective ways.<\/p>\n<p>Brian Hogan, President of Fluent’s Programmatic Division, joined industry leaders from Oracle Data Cloud, Moxie, LiveRamp, and Neustar to chat about creating industry-wide standards around data transparency. Check out our roundup of the themes that emerged during this panel and across the conference at large.<\/p>\n<h4>1. Education is key to more sophisticated data strategies.<\/h4>\n<p>At the top of the panel, Brian Hogan reminded the audience that <a href=\"https:\/\/www.mediapost.com\/publications\/article\/325164\/us-marketers-to-spend-15-billion-on-data-in-201.html\">$15 billion will be spent on data in 2019<\/a>. Yet brands and agencies often have very little insight into where their data comes from and what consumers it can help them reach. To better understand data quality, brands must first understand what questions they should be asking of data providers. For example, how often is this audience refreshed? Or where were the original data components sourced? Once these questions are clearly defined, step two will be to ensure that marketers have access to the appropriate answers.<\/p>\n<h4>2. Uncovering data quality will require collaboration.<\/h4>\n<p>Marketers, agencies, data providers, and publishers must come together to establish a shared language and set of expectations around the way we work with data. To inform campaign optimization and more intelligent targeting, marketers must first gain greater visibility into segment construction and composition. Rather than blindly selecting segments, the strategic marketer will allocate budget to qualified audiences that make the most sense for their advertising dollars.<\/p>\n<h4>3. Transparency benefits buyers AND consumers.<\/h4>\n<p>Quality data lends itself to better advertising experiences for consumers and measurable results for brands. The more precise the data used, the more likely brands will be to reach the right consumers with the most relevant products and offers. DTC companies are doing an excellent job of providing value to consumers – whether that be offering personalized product suggestions or tailored content – in exchange for their data. Taking a customer-first approach implies not only collecting consumer data, but also using these insights in responsible and mutually beneficial ways. Advertisers that can deliver curated experiences while still demonstrating respect for consumer privacy will be most likely to gain customers’ loyalty and trust.<\/p>\n<h4>4. Performance is about more than just reach.<\/h4>\n<p>Ideally, a more sophisticated handle on data would also give way to more sophisticated means of measuring performance. Today, data purchases are largely informed by KPIs like reach and brand lift. Yet as marketers gain greater visibility into data quality and performance, they are becoming more deliberate in their media planning and buying. Once armed with more reliable data, advertisers will be empowered to think beyond reach, diversifying campaign objectives to drive measurable actions (i.e. website visits, purchases, registrations, app downloads, etc.)<\/p>\n<h4>5. First-, second-, and third-party insights work better together.<\/h4>\n<p>When selecting data segments, advertisers must consider not only source and addressability&nbsp;but also type. First-, second-, and third-, party data each have their own pros and cons, and it can be challenging to select a dataset from the hundreds of segments available in any given DSP. Yet as speakers on this panel reassured the audience, marketers don’t need to choose just one.<\/p>\n<p>First-party data is the crown jewel for most advertisers, but it is often limited in scope. To help achieve scale and improve campaign targeting, advertisers are seeking reliable data sources to supplement first-party insights. Valued for its breadth and depth, third-party data is still a viable and cost-effective option for marketers. But in light of GDPR and accompanying privacy and quality concerns, second-party data partnerships are becoming more popular to enrich advertisers’ view of the customer. When used in conjunction with first- and third-party insights, second-party data enables advertisers to identify and target qualified audiences with a higher likelihood to convert.<\/p>\n<h4>Looking ahead<\/h4>\n<p>As champions of transparency, brands and agencies have the power to put more effective data practices in place. It will be interesting to see how the conversation around data evolves by RampUp 2020. For now, data transparency and customer-centricity will remain top of mind for marketers as we strive to become an industry that consumers can trust.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week, industry experts converged on the historic Fairmont Hotel in San Francisco to discuss ways to access, activate, and analyze data in smarter and more cost-effective ways. <a href=\"https:\/\/www.fluentco.com\/blog\/rampup-recap-five-key-themes\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7556,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[167],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7553"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7553"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7553\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7556"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7553"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7553"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7553"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}