{"id":7574,"date":"2019-03-15T20:53:25","date_gmt":"2019-03-15T20:53:25","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7574"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"4-lessons-lisa-sherman-taught-me","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/4-lessons-lisa-sherman-taught-me\/","title":{"rendered":"C-Suite Meet: 4 Lessons Lisa Sherman Taught Me"},"content":{"rendered":"<p>Fluent had the honor of sponsoring She Runs It’s C-Suite Meet with Lisa Sherman this month. The C-Suite Meet Series highlights the stories of C-level executives in conversation with other female leaders in the industry. Thursday morning, members of the She Runs It community gathered at the Ad Council office in Midtown East, where Sherman currently sits as CEO and President of the organization.<\/p>\n<p>Sherman has had an illustrious career in marketing, advertising, and television, breaking barriers and always striving to combine purpose with passion in all her personal and professional endeavors. Get to know Lisa Sherman and learn from some of the lessons she shared with the audience at this inspiring event.<\/p>\n<h4><strong>Leading by Example <\/strong><\/h4>\n<p><em>“It takes too much energy to hide – learn what it means to be comfortable in your own skin.”<\/em><\/p>\n<p>In her early career, Sherman didn’t feel comfortable bringing her “full self” to the office. After working at Verizon for 18 years, she “came out of the corporate closet” to her CEO before leaving the organization. Following her departure, senior leaders began to recognize the need for change and only six months later, Verizon began offering domestic partnership benefits to their employees. Once discovering the impact of her own legacy at Verizon, Sherman learned the “importance and power of expanding the imaginations of people”<\/p>\n<p>During her tenure at Viacom, Sherman went on to launch Logo TV, a television channel designed for LGBTQ viewers. Recognizing the underrepresentation of LGBTQ audiences on network television, Sherman set out to tell real stories, about real people, without perpetuating stereotypes. She grew the network to 15 million viewers and oversaw the launch of Emmy Award-Winning series, RuPaul’s Drag Race. As storytellers, Sherman explained that women in media have the power to change people’s perceptions and win hearts and minds with the power of the pen.<\/p>\n<h4><strong>Making Time <\/strong><\/h4>\n<p><em>“Set priorities and work toward creating a work-life integration.”<\/em><\/p>\n<p>While Sherman was still working at Verizon in Arlington, VA, she also attended Human Rights Campaign meetings in Washington, D.C. Though she admits that attending a post-workday meeting was the last thing she wanted to do at 6pm on a weeknight, once there, she felt truly energized by the people and the cause. Sherman reminded the audience while it may be hard to juggle work responsibilities and a social life, it is important to “make sure you’re getting enough of the stuff that makes you happy.”<\/p>\n<h4><strong>Taking Risks <\/strong><\/h4>\n<p><em>&#8220;Get comfortable being uncomfortable – a boat that doesn’t rock doesn’t move.”<\/em><\/p>\n<p>Growing up in a family of entrepreneurs, Sherman wanted to create a new work opportunity beyond a corporate environment. She took a leap of faith with a trusted business partner, received funding from friends and family that believed in her idea, and launched the Women’s Sports Network to connect female athletes. While Sherman ultimately terminated the business (another big learning experience!), she did not experience “a minute of regret” for dedicating time and resources to an organization with a “bigger purpose.”<\/p>\n<h4><strong>Finding Passions<\/strong><\/h4>\n<p><em>“If you marry your passion with the work you like to do, anything is possible.”<\/em><\/p>\n<p>Today, as CEO and President of the Ad Council, Sherman is dedicated to purpose-driven marketing. She helps to bring brands and agencies together to drive change on the nation’s most pressing issues.  As the leading producer of public service advertisements in the United States, Sherman’s organization has spearheaded notable campaigns such as “Love Has No Labels” and “STEM for Girls.” At the end of her talk, Sherman encouraged competitors in the advertising industry to reach across the aisle and work together to raise awareness and inspire engagement around public issues.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fluent had the honor of sponsoring She Runs It’s C-Suite Meet with Lisa Sherman this month. The C-Suite Meet Series highlights the stories of C-level executives in conversation with other female leaders in the industry.  <a href=\"https:\/\/www.fluentco.com\/blog\/4-lessons-lisa-sherman-taught-me\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7575,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[190,191],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7574"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7574"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7574\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7575"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7574"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7574"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7574"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7574"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}