{"id":7625,"date":"2019-04-18T20:13:57","date_gmt":"2019-04-18T20:13:57","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7625"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"introducing-fluent-dream-grants","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/introducing-fluent-dream-grants\/","title":{"rendered":"Introducing Fluent Dream Grants"},"content":{"rendered":"\n<p><em>Fluent introduces a new initiative designed to give every employee the opportunity to pursue their personal dreams and passions. <\/em><\/p>\n\n\n\n<h4>Our Culture<\/h4>\n\n\n\n<p>Fluent was started by leaders who followed their dreams and pursued their passions. These dreams led to a high-performing team that continues to dream big and follow our passion and commitment to growth – for our clients, consumer audiences, and all our stakeholders.&nbsp; <\/p>\n\n\n\n<p>Fast forward to eight years later. A dream that started with two college friends has grown into a public company with 180 employees and counting. Established upon these dreams and passions, Fluent’s vibrant culture defines us as a company and separates us from our competition. It allows us to create breakthrough results and build an environment for delivering success. <\/p>\n\n\n\n<h4>Our Values<\/h4>\n\n\n\n<p>Our culture is either strengthened or weakened by our\npeople. It is our people’s full engagement and consistent actions that reinforce\nand visibly demonstrate our culture. When we look to strengthen our culture, we\nfocus upon our core values – connect, learn, innovate, succeed – to set the\nfoundation. We orientate our people, philosophy, and execution of company-wide\ninitiatives around these values. <\/p>\n\n\n\n<p>These core values establish a context for what it means to be part of Fluent. To deliver on the promise of perpetual growth, we are always creating new opportunities to connect our employees and enable them to learn in ways that foster innovation and ongoing success, both in their personal and professional lives. <\/p>\n\n\n\n<h4>Fluent Dream Grants<\/h4>\n\n\n\n<p>At the start of 2019, we launched Fluent Dream Grants – an initiative designed to give every Fluent employee the chance to pursue their personal dreams and passions. Fluent Dream Grants are intended to be as diverse as our employee base. Whether volunteering at an orphanage, climbing a mountain, or studying Renaissance art – we offer our people the opportunity to let their imaginations and dreams run wild.&nbsp; <\/p>\n\n\n\n<p>We have created two types of grants: Individual Dream Grants and Team Dream Grants. Team Dream Grants encourage cross-team collaboration and present a unique opportunity to connect with fellow employees outside a work environment. Individual Dream Grants are awarded to employees seeking to explore their individual passions and achieve personal growth. Fluent’s executive team reviews all applications and winners are expected to share their experiences with the company at large &#8211; including special features on our blog!<\/p>\n\n\n\n<p>In its inaugural year, we do not know exactly what will come\nfrom this program. However, we are certain that it will give our people the\nchance to chase their dreams, connect to their passions, learn, and grow – all\nthe things we love here at Fluent. We are incredibly excited to hear about our\nemployees’ journeys and observe their transformations in the coming months. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fluent introduces a new initiative designed to give every employee the opportunity to pursue their personal dreams and passions. ﻿ <a href=\"https:\/\/www.fluentco.com\/blog\/introducing-fluent-dream-grants\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7630,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[192,193],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7625"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7625"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7625\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7630"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7625"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7625"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7625"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7625"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}