{"id":7641,"date":"2019-04-23T19:17:20","date_gmt":"2019-04-23T19:17:20","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7641"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"fluent-dream-grant-dogs-sleds-snow","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/fluent-dream-grant-dogs-sleds-snow\/","title":{"rendered":"Fluent Dream Grant: Dogs, Sleds, &#038; Snow"},"content":{"rendered":"\n<p><em>This year, we rolled out Fluent Dream Grants, an initiative designed to give every Fluent employee the opportunity to pursue their personal dreams and passions. Learn more about the program <a href=\"https:\/\/www.fluentco.com\/resources\/introducing-fluent-dream-grants\/\">here<\/a>. <\/em><\/p>\n\n\n\n<h3 style=\"text-align:left\">Dream Grant Destination: Fairbanks, Alaska<\/h3>\n\n\n\n<p>Last month, Kerry Sorenson, Fluent’s Director of Data Operations, embarked on her Dream Grant journey to Fairbanks, Alaska. Kerry has been with Fluent for over four years and loves to travel, run, cook, and engage in almost any activity that doesn’t involve sitting still.  <\/p>\n\n\n\n<p>For her Dream Grant, Kerry spent five days camping in arctic tents and learning the art of mushing. Check out Kerry’s Dream Grant story for an inside look at what it&#8217;s like to travel 106 miles with 14 dogs, or <a href=\"#kerry\">watch her journey below!<\/a><\/p>\n\n\n\n<h4><strong>What was your inspiration for this trip?<\/strong><\/h4>\n\n\n\n<p>Learning to mush sits at the intersection of two things I love: dogs and running. In middle school, I initially chose to run track because I liked the concept of an individual sport (team sports scared me). But over time, I learned to love having my teammates rely on me during relay races. Individually, I was a “good” runner, but when placed on a relay team with three other “good’ runners, we had an even better chance of winning. <\/p>\n\n\n\n<p>Like runners participating in a relay, sled dogs are the most effective when part of a team. Before my research, I admittedly had my doubts about dog sledding. Are the dogs treated right? Is it too cold for them? However, the more I researched, the better I understood that these dogs genuinely <em>live <\/em>to run. I wanted to experience mushing firsthand to better understand what it entailed (physically and mentally) for both the dogs and the musher. I chose this Dream Grant because it would give me the unique opportunity to explore and step outside of my comfort zone.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><strong>&#8220;Just <\/strong><em><strong>having <\/strong><\/em><strong>a team isn’t enough &#8211; each team member needs to fully trust all other members to achieve maximum productivity. &#8220;<\/strong><cite><br> &#8211; Kerry Sorenson, Director of Data Operations <\/cite><\/blockquote>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4><strong>What was the day-to-day of your Dream Grant journey? <\/strong><\/h4>\n\n\n\n<p>My best friend Emily and I spent four days and nights near Fairbanks, Alaska. The first day was spent in our guide Simon’s guest cabin where we met his dogs, learned the basics of mushing, and went for a brief sled ride with the dogs. The next three days were spent traveling by dog sled and camping in the Alaskan wilderness. Simon, Emily, and I each had our own team of four dogs and were able to cover more than 100 miles! After a tiring morning, a major highlight was relaxing in the naturally heated pools at Tolovana Hot Springs. When we weren’t mushing, we were tending to the dogs, gathering firewood, cooking meals, and exploring the land.<\/p>\n\n\n\n<h4><strong>What was your favorite part of the trip?<\/strong><\/h4>\n\n\n\n<p>I loved spending time with the dogs. There were 19 dogs in total\n(only 14 joined us for the actual trip) and each had its own unique\npersonality. Simon named all the dogs himself, usually after a physical quality\nor personality trait (Brownie, Peeboy, Lassie, etc.) My favorites were Buddha,\nTinton, and Blob.<\/p>\n\n\n\n<h4><strong>What did you learn from your experience?<\/strong><\/h4>\n\n\n\n<p>Watching the dogs work together as a team was truly inspiring. They rely on one another, not only to pull his or her equal share of the weight, but also to maintain a sense of trust. For example, the wheel dogs (the two dogs in the back) trust the lead dogs to pick the best path. Likewise, at Fluent, each employee relies on collaboration from their team, as well as outside teams, to achieve objectives. However, just <em>having <\/em>a team isn’t enough &#8211; each team member needs to fully trust all other members to achieve maximum productivity.<\/p>\n\n\n\n<h4><p id=\"kerry\" class=\"has-text-color has-very-dark-gray-color\"><strong>At Fluent, we strive to learn, connect, innovate, and succeed – which of our core values applies to your experience? <\/strong><\/p><\/h4>\n\n\n\n<p>Throughout this adventure, I embraced learning and connecting. Being brand new to both mushing and camping, there was a lot I needed to learn in a short amount of time. Learning new skills and executing them correctly was crucial for my safety, as well as the dogs’ safety. Additionally, spending four days with Emily and Simon gave me the opportunity to connect with each of my travel companions on a personal level. I gained a broader understanding and appreciation of a rural, minimalist lifestyle that’s very different than my own. <\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<center><figure class=\"wp-block-embed-youtube aligncenter wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/uSh1e-A__ik?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><figcaption>Get a firsthand look at Kerry&#8217;s Dream Grant adventure<\/figcaption><\/figure><\/center>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Last month, Kerry Sorenson, Fluent’s Director of Data Operations, embarked on her Dream Grant journey to Fairbanks, Alaska. Check out her story here. <a href=\"https:\/\/www.fluentco.com\/blog\/fluent-dream-grant-dogs-sleds-snow\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7645,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[192,193],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7641"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7641"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7641\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7645"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7641"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7641"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7641"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7641"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}