{"id":7680,"date":"2019-05-09T09:00:52","date_gmt":"2019-05-09T09:00:52","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7680"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"programmatic-i-o-recap-3-advantages-of-a-second-party-data-strategy","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/programmatic-i-o-recap-3-advantages-of-a-second-party-data-strategy\/","title":{"rendered":"Programmatic I\/O Recap: 3 Advantages of a Second-Party Data Strategy"},"content":{"rendered":"\n<p>Another Programmatic I\/O is in the books! On day one of the conference, Brian Hogan, President of Fluent Programmatic, joined Brad Rosenhouse, GVP of Programmatic at Publicis Health Media, for a fireside chat on the benefits of second-party data. Check out some insights from their workshop to learn why data quality and transparency are essential to improving audience targeting and driving real-world outcomes.<\/p>\n\n\n\n<h4><strong>The State of Programmatic\nToday<\/strong><\/h4>\n\n\n\n<p>It is predicted that the US will spend <a href=\"https:\/\/www.mediapost.com\/publications\/article\/325164\/us-marketers-to-spend-15-billion-on-data-in-201.html\">$15\nbillion on data<\/a> in 2019. Drill that down to programmatic alone and US\nadvertisers are projected to spend <a href=\"https:\/\/content-na1.emarketer.com\/us-programmatic-ad-spending-forecast-2019\">$70\nbillion on digital display ads<\/a> by 2020 (with programmatic ad spend expected\nto account for 86% of the total digital display pie).<\/p>\n\n\n\n<p>Marketers are constantly seeking new ways to create more meaningful connections with consumers, leveraging data to offer highly personalized advertising experiences and build brand loyalty. Brian said it plainly: “Data-driven marketing used to be considered cutting-edge but now is a fundamental part of any strategic marketing plan.” <a href=\"https:\/\/www.highlandmath.com\/\">Highland Math<\/a>, a data intelligence platform that indexes data spend, reports that audience data spending is up 66% YOY and the number of advertisers spending on audience data has increased by 58%. <\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“Data-driven marketing used to be considered cutting-edge but now is a fundamental part of any strategic marketing plan.”  <\/p><cite>&#8211; Brian Hogan, President of Fluent Programmatic <\/cite><\/blockquote>\n\n\n\n<div style=\"height:15px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4><strong>Challenges for\nMarketers<\/strong><\/h4>\n\n\n\n<p>With the proliferation of data in today’s world, marketers have access to a surplus of information – but very little insight into quality. When a trader or media buyer logs into their DSP or DMP, they are presented with hundreds of data suppliers and segments but have no way to tell whether the data is modeled, inferred, or observed. <\/p>\n\n\n\n<p>Yet while spending continues to increase, <a href=\"https:\/\/www.highlandmath.com\/\">Highland Math<\/a> also found that the number of segments in market is down by 6.7%. What does this mean for the data landscape at large? Marketers are demanding less noise and more quality from audience segments for programmatic targeting. <\/p>\n\n\n\n<h4><strong>Benefits of\nSecond-Party Data<\/strong><\/h4>\n\n\n\n<p>Coupled with growing concerns\naround consumer privacy, the lack of confidence in audience data is prompting\nmarketers to demand greater transparency. As they seek to regain consumer trust\nand maximize ROI, marketers are moving away from third-party data in favor of <a href=\"https:\/\/digiday.com\/media\/gdpr-second-party-data-deals\/\">second-party\ntargeting<\/a> solutions. See below for some key advantages of second-party\ndata. <\/p>\n\n\n\n<h5><strong>Transparency <\/strong><\/h5>\n\n\n\n<p>Second-party data sources offer the opportunity for more strategic partnerships based on open lines of communication and transparency. With second-party data, marketers have full visibility into segment source, composition, recency, and cleansing specifics. They can work with a second-party data partner to build custom segments or make optimizations based on real-time campaign performance. Second-party data empowers marketers to make more educated targeting decisions (rather than selecting blindly from a list of third-party data segments). <\/p>\n\n\n\n<h5><strong>Quality <\/strong><\/h5>\n\n\n\n<p>What it lacks in scale, second-party\ndata makes up for in quality. Working with clients in the healthcare\nspace, Brad’s team is often tasked with targeting extremely niche audiences\n(sometimes a pool as small as 1% of the total US population). According to\nBrad, “Time invested in curating custom niche data sets with second-party data\nproviders has proven to be a worthwhile endeavor from a campaign KPI\nstandpoint.” While niche data sets offer incremental scale, their true value\nlies in their ability to identify and target audiences with precision.<\/p>\n\n\n\n<h5><strong>Outcomes<\/strong><\/h5>\n\n\n\n<p>While\nsuccess in data-driven marketing has long been defined by the ability to scale,\nsecond-party data is prompting marketers to reimagine their campaign KPIs. Performance\nis <a href=\"https:\/\/www.fluentco.com\/resources\/rampup-recap-five-key-themes\/\">no\nlonger just about reach<\/a> –rather than measuring results on a CPM-basis,\nmarketers are seeking real-world outcomes predicated on consumer trust and\nloyalty. <\/p>\n\n\n\n<p>Outcome-based marketing is about identifying and building precise audiences with a self-declared interest in a specific brand, product, or service. To drive meaningful engagement and avoid wasted ad spend, brands must start at the source: <a href=\"https:\/\/martechseries.com\/mts-insights\/guest-authors\/better-advertising-experiences-start-data-transparency\/\">the data<\/a>. Armed with second-party data, marketers can be confident in their ability to deploy more precise targeting and better advertising experiences. <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn why data quality &#038; transparency are essential to improving audience targeting &#038; driving real-world outcomes. <a href=\"https:\/\/www.fluentco.com\/blog\/programmatic-i-o-recap-3-advantages-of-a-second-party-data-strategy\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7684,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[167],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7680"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7680"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7680\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7684"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7680"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7680"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7680"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7680"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}