{"id":7811,"date":"2019-05-16T13:49:26","date_gmt":"2019-05-16T13:49:26","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7811"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"3-reasons-why-legacy-cpg-brands-should-go-d2c","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/3-reasons-why-legacy-cpg-brands-should-go-d2c\/","title":{"rendered":"Three Reasons Why Legacy CPG Brands Should Go D2C"},"content":{"rendered":"\n<p> <br><em>Reposted from <a href=\"https:\/\/www.mediapost.com\/publications\/article\/335936\/3-reasons-why-legacy-cpg-brands-should-go-d2c.html\">MediaPost<\/a><\/em><\/p>\n\n\n\n<p>Digitally native brands have led the D2C revolution, leveraging data to meet consumers’ demands for highly personalized shopping experiences.&nbsp;<\/p>\n\n\n\n<p>As challenger brands like Harry’s and NatureBox make strides in the CPG space, legacy packaged good companies are also investing in a customer-centric, D2C approach. Unilever purchased Dollar Shave Club for $1 billion in 2016,&nbsp; and Proctor and Gamble acquired Walker &amp; Company, a D2C brand that produces personal care products for people of color, at the end of last year. &nbsp;<\/p>\n\n\n\n<p>While many D2C startups are now expanding beyond e-commerce, solidifying their presence in physical spaces via pop-ups shops and standalone kiosks, legacy CPGs already have the advantage of a physical brick-and-mortar presence on their side. For these incumbent CPG brands, the D2C model presents an opportunity to connect with online shoppers and drive sales and engagement via digital channels.<\/p>\n\n\n\n<p>So why&nbsp;<em>should<\/em>&nbsp;CPGs adopt a D2C approach?&nbsp;<\/p>\n\n\n\n<h4>Access to first-party shopper data.&nbsp;<\/h4>\n\n\n\n<p>Digitally native D2Cs like Glossier and BarkBox launched their products online, harnessing first-party consumer data to inform strategy and improve the customer experience.<\/p>\n\n\n\n<p>Selling through a third-party retailer gives CPG brands very little access to actionable consumer data. When a customer purchases a product across a variety of retailers, outlets, and channels, it becomes nearly impossible for a CPG brand to get a holistic view of both the consumer decision journey and consumer preferences. Taking ownership of the point of purchase can give GPG brands valuable insights into what consumers are buying, when they are reordering, and what other products may be of interest. &nbsp;<\/p>\n\n\n\n<h4><strong>Personalized engagement.<\/strong><\/h4>\n\n\n\n<p>By creating one-to-one touchpoints beyond a physical retail environment, CPG companies can drive more meaningful connections with their most valuable customers.&nbsp;<\/p>\n\n\n\n<p>Dollar Shave Club extends its membership questionnaire beyond the onboarding process to ensure customers are matched with the most relevant product offerings throughout the lifetime of their subscription. Once they’ve started engaging consumers in an ongoing dialogue, CPGs can leverage insights from member profiles to deliver personalized product recommendations and build long-term brand loyalty.&nbsp;<\/p>\n\n\n\n<h4><strong>Opportunities to test and learn.<\/strong><\/h4>\n\n\n\n<p>With more and more consumers purchasing basic staples via Amazon, legacy brands are taking a closer look at how and when consumers prefer to buy packaged goods. P&amp;G launched Gillette Shave Club in 2015, later rolling out an online Tide Pods subscription service in an effort to provide more flexible and convenient options for product replenishment. To break into the D2C space and differentiate themselves from Amazon’s private-label products, legacy CPGs must find new ways to provide clear value to the consumer. <\/p>\n\n\n\n<h4><strong>What’s next?<\/strong><\/h4>\n\n\n\n<p>The D2C model is here to stay, with 40% of U.S. internet users expecting D2C brands to account for at least 40% of their purchases within the next five years, according to eMarketer. While acquisition is certainly a viable option for legacy CPG brands looking to break into the D2C space, CPGs should also consider reinvigorating existing product lines to reach previously untapped audiences.<\/p>\n\n\n\n<p><em>The above is a guest post for&nbsp;<a href=\"https:\/\/www.mediapost.com\/\">MediaPost<\/a> by <a href=\"https:\/\/www.fluentco.com\/resources\/qa-with-andrea-haldeman\/\">Andrea Haldeman<\/a>, SVP of Sales<\/em> <em>at <a href=\"https:\/\/www.fluentco.com\/\">Fluent, Inc.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For incumbent CPG brands, the D2C model presents an opportunity to connect with online shoppers and drive sales and engagement via digital channels. <a href=\"https:\/\/www.fluentco.com\/blog\/3-reasons-why-legacy-cpg-brands-should-go-d2c\/\">Read More<\/a><\/p>\n","protected":false},"author":17,"featured_media":7865,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[173,187,194],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7811"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7811"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7811\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7865"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7811"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}