{"id":7852,"date":"2019-02-28T14:12:29","date_gmt":"2019-02-28T14:12:29","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7852"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"better-advertising-experiences-start-with-data-transparency","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/better-advertising-experiences-start-with-data-transparency\/","title":{"rendered":"Better Advertising Experiences Start with Data Transparency"},"content":{"rendered":"\n<p><em>Reposted from <\/em><a href=\"https:\/\/martechseries.com\/mts-insights\/guest-authors\/better-advertising-experiences-start-data-transparency\/\"><em>MarTech Series<\/em><\/a><\/p>\n\n\n\n<p>In 2019, brands are demanding more accountability from their agency partners, with&nbsp;<a href=\"https:\/\/www.iab.com\/wp-content\/uploads\/2018\/05\/IAB_Programmatic-In-Housing-Whitepaper_v7a.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">45% of marketers<\/a>&nbsp;already taking some or all their media-buying plans in house as of last year. As&nbsp;<a href=\"https:\/\/martechseries.com\/?s=programmatic\" target=\"_blank\" rel=\"noreferrer noopener\">programmatic<\/a>&nbsp;becomes further ingrained as the predominant ad placement solution,&nbsp;<a href=\"https:\/\/martechseries.com\/?s=advertisers\" target=\"_blank\" rel=\"noreferrer noopener\">advertisers<\/a>&nbsp;are in-housing this technology to gain greater control and management of data, targeting, performance, and ad spend – to name a few benefits.<\/p>\n\n\n\n<p>Programmatic currently accounts for more than&nbsp;<a href=\"https:\/\/www.iab.com\/wp-content\/uploads\/2018\/05\/IAB_Programmatic-In-Housing-Whitepaper_v7a.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">80% of digital ad spend<\/a>, but to drive meaningful engagement and increase ROI, brands must connect with the right audiences. The programmatic infrastructure for reaching qualified consumers is already in place. To provide consumers with more relevant messaging and better advertising experiences, brands and agencies need to start at the source: the data.<\/p>\n\n\n\n<h4><strong>Demand for Transparency Moves Beyond Media<\/strong><\/h4>\n\n\n\n<p>Following YouTube’s brand safety scandal of 2017, and subsequent slip-ups from other social platforms, advertisers have made great strides toward safeguarding their brands against threatening ad placements. Starting as a movement to lift the veil on media buying practices, buyer demand for transparency is now shifting beyond the supply side to include data controls as well.<\/p>\n\n\n\n<p>As advertisers seek to reach their target customers with greater precision and accuracy, lack of visibility into ad placements also implies limited access to audience insights. Tasked with delivering aggressive volume, agency partners may optimize for greater scale at the cost of quality, serving irrelevant ads to a disinterested audience. In-housing programmatic buying enables brands to check for relevance and site quality before launching a campaign, though performance is ultimately dependent on the integrity of the data segments leveraged for targeting.<\/p>\n\n\n\n<h4><strong>Second-Party Data is the New Third-Party Data<\/strong><\/h4>\n\n\n\n<p>As an ad buying solution, programmatic offers low visibility into audience data and where it comes from. US advertisers are projected to spend&nbsp;<a href=\"https:\/\/www.mediapost.com\/publications\/article\/325164\/us-marketers-to-spend-15-billion-on-data-in-201.html\" target=\"_blank\" rel=\"noreferrer noopener\">15 billion dollars on data in 2019<\/a>, yet measures of data quality remain unknown due to a disproportionate reliance on modeled-out and inferred segments.<\/p>\n\n\n\n<p>With the integrity of third-party data still in question, second-party data, and the companies who can provide it, are at a unique advantage. While publishers and marketers are traditionally wary of sharing first-party data for fear of losing their competitive advantage, both the supply and demand sides have much to gain from second-party data partnerships.<\/p>\n\n\n\n<p>In offering access to second-party data, publishers and data providers enable brands and agencies to scale programmatic buys beyond Google and Facebook. As the most logical supplement to a brand’s proprietary insights, second-party data provides advertisers with access to their blind spot – i.e. the customers they want, but don’t yet have. Mitigating the risk of wasted ad spend, second-party data enables brands to match their own behavioral data with syndicated segments, targeting similar audiences with a higher likelihood to purchase.<\/p>\n\n\n\n<p>While third-party data is often inferred, second-party data—especially when self-declared—enables more accurate targeting based on real consumer insights. If a brand can connect with their target audience at the top of the funnel, then long-term retention becomes a more easily attainable goal.<\/p>\n\n\n\n<p>Thanks to GDPR, it is no surprise that publishers with a presence in the UK are leading the charge on developing second-party data partnerships<a href=\"https:\/\/digiday.com\/media\/business-insider-unifies-programmatic-ad-buying-across-international-editions\/\" target=\"_blank\" rel=\"noreferrer noopener\">. Business Insider is scaling second-party data opportunities<\/a>&nbsp;across all eight of its European properties, pooling inventory in a private marketplace where brands can create their ideal targeting segments. To unlock new revenue streams, brands are also working together to assess audience overlap and activate second-party data for programmatic targeting.<\/p>\n\n\n\n<h4><strong>Industry Leaders Develop Data Transparency Standards<\/strong><\/h4>\n\n\n\n<p>Leading marketing and media trade groups are addressing demands for privacy-safe data with the introduction of a new industry standard&nbsp;<a rel=\"noreferrer noopener\" href=\"http:\/\/www.datalabel.org\/\" target=\"_blank\">Data Transparency Label<\/a>. Members of IAB’s Tech Lab, ARF, CIMM, and the ANA’s Council for Data Integrity are working to create a label akin to the FDA’s Nutrition Facts, outlining source, collection method, segmentation criteria, recency, and cleansing specifics.<\/p>\n\n\n\n<p>Allowing brands to better understand data quality, the Data Transparency Label will empower advertisers to select syndicated audience segments with greater confidence. Yet, for this initiative to be successful, the means to differentiate the “good” data from the “bad” is not enough. There is also an onus on data providers to offer more accurate and reliable audience segmentation data for programmatic targeting.<\/p>\n\n\n\n<p>Quality data is the key to better advertising experience for consumers and measurable results for brands. To promote industry-wide transparency, publishers and advertisers alike must make a commitment to using consumer data in more responsible and mutually beneficial ways. Only then will consumers understand that the use of data in targeted advertising represents a value exchange rather than an invasion of privacy.<\/p>\n\n\n\n<p><em>The above is a guest post for <a href=\"https:\/\/martechseries.com\/\">MarTech Series<\/a> by Brian Hogan, President of Fluent Programmatic.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>To provide consumers with more relevant messaging and better advertising experiences, brands and agencies need to start at the source: the data. <a href=\"https:\/\/www.fluentco.com\/blog\/better-advertising-experiences-start-with-data-transparency\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7857,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[167,196],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7852"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7852"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7852\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7857"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7852"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7852"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7852"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7852"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}