{"id":7875,"date":"2018-11-06T20:04:55","date_gmt":"2018-11-06T20:04:55","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7875"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"how-to-acquire-and-engage-mobile-app-users-through-feedback","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/how-to-acquire-and-engage-mobile-app-users-through-feedback\/","title":{"rendered":"How to acquire and engage mobile app users through feedback"},"content":{"rendered":"\n<p><em>Reposted from <\/em><a href=\"https:\/\/www.clickz.com\/how-to-acquire-engage-mobile-app-users-feedback\"><em>ClickZ<\/em><\/a><\/p>\n\n\n\n<p>Uninstall rates are a big pain point for mobile app marketers. To acquire and engage app users, make sure you look at the right type of user feedback. <\/p>\n\n\n\n<p>This year marks the ten-year anniversary of the Apple App Store and Android Market (now Google Play Store), and the number of apps available to download continues to grow exponentially. The ever-looming “year of&nbsp;<a href=\"https:\/\/www.clickz.com\/types-content-experience-platforms\/230242\/\">mobile<\/a>” may have come and gone, but mobile marketers still race to keep up with the ambitious standards of consumers wielding smartphones and credit cards.<\/p>\n\n\n\n<h4>Uninstallment rates remain a significant pain point for mobile app marketers<\/h4>\n\n\n\n<p>Over&nbsp;<a href=\"http:\/\/info.localytics.com\/blog\/mobile-app-user-retention-continues-to-soar-in-2018\" target=\"_blank\" rel=\"noreferrer noopener\">90% of smartphone owners use apps, and 72% of app users churn within the first three months<\/a>&nbsp;of installing a new app. As marketers reevaluate acquisition programs, shifting payment down the funnel from installs to engagement, the approach should be centered around the consumer experience.<\/p>\n\n\n\n<p>Focusing on minute optimizations of marketing and UX alone largely neglects users and user experience, from high-level acquisition through down-funnel engagement in-app. Marketers and developers alike have forgotten that a smartphone is likely treated as more of an appendage than an accessory. Phones are highly personal devices, filled with carefully organized and curated applications intended to make life easier (e.g. maps, banking, email) or fun (e.g. games, social media, shopping).<\/p>\n\n\n\n<p>While the industry is notorious for disrupting the status quo, mobile marketers should go back to basics when tackling engagement: focus on the user. Smartphone owners are spending&nbsp;<a href=\"https:\/\/www.clickz.com\/smartphone-supremacy-infographic\/22075\/\" target=\"_blank\" rel=\"noreferrer noopener\">more time than ever in-app<\/a>, embracing a more comfortable and seamless experience.<\/p>\n\n\n\n<p>Apps that blend in with user habits and needs are less likely to cause frustration and ultimately be deleted. A holistic view of UX is forcing its way to the forefront of acquisition and app engagement, which begins with understanding what users want.<\/p>\n\n\n\n<h4>Consumer-led UA<\/h4>\n\n\n\n<p>With&nbsp;<a href=\"https:\/\/www.clickz.com\/in-a-post-gdpr-world-first-party-data-is-more-important-than-ever\/216348\/\" target=\"_blank\" rel=\"noreferrer noopener\">data breaches and privacy concerns<\/a>&nbsp;increasing, people are far more likely to trust people, not brands. Alexa and&nbsp;<a href=\"https:\/\/www.clickz.com\/whats-ahead-for-iot-many-things-2019\/226144-2\/226144\/\">Siri<\/a>&nbsp;may be eavesdropping on conversations, leading to ad-serving that comes across as downright creepy. In an ideal world, marketers would serve carefully targeted ads to consumers at the right time, on the right channel. Advertising has become overbearing, over-served, and aggressive.<\/p>\n\n\n\n<p>While good advertising focuses on individuals, it can be easy to forget that&nbsp;<a href=\"https:\/\/www.clickz.com\/as-consumer-expectations-rise-brands-find-new-data-to-personalize-experience\/216842\/\" target=\"_blank\" rel=\"noreferrer noopener\">personalization<\/a>&nbsp;does not begin and end with inserting a first name into an email or ad creative.<\/p>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/www.accenture.com\/t20170801T100119Z__w__\/us-en\/_acnmedia\/PDF-57\/Accenture-Personalization-Retail.pdf\" target=\"_blank\">Accenture estimates<\/a>&nbsp;that a lack of trust and proper personalization cost businesses $756 billion in 2017, and that 43% of consumers are more likely to make a purchase after personalized shopping experience. Listen to your users to find that sweet spot. One person may want to receive a constant stream of push notifications about news updates, while another prefers opening email newsletters once per week.<\/p>\n\n\n\n<p>Let your customers tell you what they want and how you can seamlessly blend into their daily routines. Higher quality marketing campaigns hinge on engaging in deeper conversations to collect and leverage declared insights and recognizing interests and affinities.<\/p>\n\n\n\n<h4>Finding the right insights<\/h4>\n\n\n\n<p>Across occupations in the U.S.,&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.mckinsey.com\/business-functions\/digital-mckinsey\/our-insights\/where-machines-could-replace-humans-and-where-they-cant-yet\" target=\"_blank\">one-third of the time spent in the workplace involves collecting and processing data<\/a>. Mobile marketers very well could be wasting time looking at the wrong type of data. While it may be helpful to understand the&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.thinkwithgoogle.com\/marketing-resources\/app-growth-mobile-playbook\/\" target=\"_blank\">behaviors and demographics of app users<\/a>&nbsp;– 52% are women, the average age is 34, men are far more likely to use news apps – too many of those data points lack actionable insights.<\/p>\n\n\n\n<p>In efforts to continually optimize UX, app developers could interpret users spending an excessive amount of time in a certain area of their app as a problem area and adjust the features. Instead, users actually could be thoroughly enjoying the feature, causing changes to negatively impact app engagement.<\/p>\n\n\n\n<h4>Make your brand more human-like: find out what your users want by asking them<\/h4>\n\n\n\n<p>Asking users for data could be as simple as prompting them to check a box or tap a button. The&nbsp;<a href=\"https:\/\/help.pandora.com\/s\/article\/Thumbs-1519949305945?language=en_US\" target=\"_blank\" rel=\"noreferrer noopener\">easiest example of this is Pandora<\/a>: when users enjoy a song on their playlist, they have the option to select a thumbs-up button. If they do not like the song, they can press the thumbs-down. The playlist adjusts accordingly.<\/p>\n\n\n\n<p>Fluent ran an acquisition campaign for a mobile gaming app, initially targeting users that had displayed a propensity for mobile app installs or “look-a-likes” who displayed the same behaviors as those that downloaded new apps regularly, particularly games.<\/p>\n\n\n\n<p>While the click-to-install rate was almost 30%, users were dropping off post-install. To identify people with higher lifetime value, the team incorporated a simple survey question to create an audience segment of self-declared gamers. These users had a higher affinity for making in-app purchases and the campaign resulted in a 47% lift in engagement rate, which was measured by reaching a certain level in the RPG game.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/www.clickz.com\/wp-content\/uploads\/sites\/2\/2018\/11\/Fluent-image.jpg\" alt=\"\" class=\"wp-image-220253\"\/><\/figure><\/div>\n\n\n\n<p>There are a multitude of ways to collect and utilize declared data, through focus groups, panels, on-site or in-app surveys, and pulse or primary research tools. Joining these insights with your behavioral data is dream-state, empowering marketers to offer more customized experiences. While businesses obsess over big datasets, they are overlooking the importance of small but scalable datasets based on feedback from individuals on what they want, when they want it, and how to get it to them.<\/p>\n\n\n\n<p>As mobile marketers have observed with rewarded video and playable ads, users engage with&nbsp;<a href=\"https:\/\/www.clickz.com\/types-content-experience-platforms\/230242\/\">content<\/a>&nbsp;that keeps them within a native experience and offers a prize for that participation. In a pinch, targeted, rewarded surveys can provide significant insight into the user experience and provide a baseline for updates and planning into the fourth quarter and beyond.<\/p>\n\n\n\n<p><em>The above is a guest post for <a href=\"https:\/\/www.clickz.com\/\">ClickZ<\/a> by George Eames,  Director of Mobile Ad Operations at <a href=\"https:\/\/www.fluentco.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Fluent, Inc. (opens in a new tab)\">Fluent, Inc.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A holistic view of UX is forcing its way to the forefront of acquisition and app engagement, which begins with understanding what users want. <a href=\"https:\/\/www.fluentco.com\/blog\/how-to-acquire-and-engage-mobile-app-users-through-feedback\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":7878,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[162,197],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7875"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=7875"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/7875\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7878"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7875"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7875"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7875"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=7875"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}