{"id":8000,"date":"2019-07-25T18:20:36","date_gmt":"2019-07-25T18:20:36","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8000"},"modified":"2020-12-29T02:19:13","modified_gmt":"2020-12-29T02:19:13","slug":"views-from-vesey-an-inside-look-at-our-new-corporate-headquarters","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/views-from-vesey-an-inside-look-at-our-new-corporate-headquarters\/","title":{"rendered":"Views from Vesey: An Inside Look at Our New Corporate Headquarters"},"content":{"rendered":"\n<p>With sweeping views of the Hudson River and Lady Liberty in the distance, Fluent’s new NYC office is a prime location for industry innovation. Whether you need a coffee from our on-site barista, want to take a breather in our game zone, or need a change of scenery to get work done, you’ll love visiting the new space! Now that the dust has finally settled, we decided to chat with Office Manager, Evyn Chaffin, to get a better picture of the company’s new headquarters and look back at the first few months at 300 Vesey Street. <\/p>\n\n\n\n<p>Be sure to check out the <a href=\"#video\">video<\/a> below with more views from Vesey.<\/p>\n\n\n\n<p><strong>What is your primary goal as Senior Manager of Office &amp;\nCulture at Fluent? &nbsp;<\/strong><\/p>\n\n\n\n<p>I am\nresponsible for the happy and healthy functioning of all Fluent’s offices. We\nare headquartered in NYC, but also have remote offices in Chicago, Boca Raton,\nSt. Petersburg, and Seattle. While facilities management is critical to an\noffice and does fall under my jurisdiction, my overarching strategy for\nFluent’s success is maintaining our company culture. We are very protective of\nour inclusive, transparent, welcoming culture and work hard to preserve\nFluent’s core values – learn, innovate, succeed, and connect. <\/p>\n\n\n\n<p><strong>What factors were most important when designing the new\nFluent HQ? <\/strong><\/p>\n\n\n\n<p>Accessible Location:\nAs we continue to source talent from NYC and beyond, we wanted to choose\na location that would be easily accessible to employees from all over the\ntri-state area. &nbsp;The nearby Oculus is a\nmajor transportation hub, offering access to the Brookfield Ferry Terminal,\nPATH train, and Fulton Street subway station with 13+ lines. <\/p>\n\n\n\n<p>Collaborative Work Spaces: From the early planning stages, we knew we wanted to create a space that would encourage employees to connect and learn. The office features a bright and open floorplan, upgraded conference rooms, wellness areas, and writeable walls to inspire creativity and innovation.&nbsp; All desks and offices are located on one floor and hoteling options help to promote flexibility and accommodate remote employees when they are in town. <\/p>\n\n\n\n<p><strong>How does the physical office space help employees to stay motivated at work?<\/strong><\/p>\n\n\n\n<p>People need a change of scenery within an office environment to keep the space from feeling stale. While people relish the privacy and seclusion of a personal workspace, we also recognize that employees need places to meet and collaborate. We provide many types of communal meeting areas, including phone booths for 2-4 people, a café for casual meetings of up to 12-15 people, and a large kitchen seating 50 people (employees sit and eat lunch here every day!). In a similar vein, we also designed the game zone as a space for people to break for 10 minutes and blow off some steam – whether that means competing in a round of ping pong or playing pinball. We work very hard at Fluent, and it’s important that we provide opportunities for people to take a mental break. <\/p>\n\n\n\n<p><strong>How do you keep remote employees feeling connected to the larger team? <\/strong><\/p>\n\n\n\n<p>We work very\nhard to provide comparable experiences for our remote employees. When we have\nevents in the NYC office, we find similar activities for our remote offices as\nwell. In addition, technology plays a massive role in staying connected to our\nremote teams. We’ve turned all our conference rooms and offices into Zoom Rooms\nand have provided the same technology to our remote teams. Seeing our team\nmembers while on calls and in meetings is critical to staying connected and\ncommunicating well across departments (and across the country!). <\/p>\n\n\n\n<p><strong>How has the new space impacted employees in the first few months?\n<\/strong><\/p>\n\n\n\n<p><p id=\"video\">The new space reflects Fluent’s culture of innovation and is\ndesigned to embrace and empower our employees as our most valuable assets. Team\nmembers connect regularly in designated meeting areas and cross paths in the Connection\nPoint Café, an open space that offers access to all levels of staff – we love\nthat an intern can have a casual conversation with our CEO when waiting in line\nfor a cup of coffee! We look forward to welcoming new team members that embody our\nvalues as we continue to invest in growth and diversify our product and service\nofferings here at Fluent. &nbsp;&nbsp;<\/p><\/p>\n\n\n\n<center><figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/NXJP-wfuCBI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><figcaption> <br>Take an inside look at our new office space!<\/figcaption><\/figure><\/center>\n","protected":false},"excerpt":{"rendered":"<p>With sweeping views of the Hudson River, Fluent’s new NYC office is a prime location for industry innovation. Learn more about our new headquarters. <a href=\"https:\/\/www.fluentco.com\/blog\/views-from-vesey-an-inside-look-at-our-new-corporate-headquarters\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8003,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[190,198],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8000"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8000"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8000\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8003"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8000"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8000"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8000"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8000"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}