{"id":8020,"date":"2019-08-28T18:59:11","date_gmt":"2019-08-28T18:59:11","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8020"},"modified":"2020-12-29T02:19:14","modified_gmt":"2020-12-29T02:19:14","slug":"fundraising-democratic-debates","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/fundraising-democratic-debates\/","title":{"rendered":"Candidates Diversify Fundraising Efforts to Qualify for Upcoming Democratic Debates"},"content":{"rendered":"\n<p>The race to 130K unique donors is well underway among the remaining democratic candidates vying for a shot at the presidency in the 2020 election. With the first two rounds of democratic debates behind them, <a href=\"https:\/\/www.nytimes.com\/2019\/08\/14\/us\/politics\/next-democratic-debate-candidates.html\">candidates have been hard-pressed<\/a> to meet polling and grassroots funding thresholds in time for the third and fourth debates this fall. <\/p>\n\n\n\n<h4>DNC Introduces New Qualification Criteria<\/h4>\n\n\n\n<p>In\nMay, the Democratic National Committee announced new criteria for participation\nin the debates this election season. Candidates are required to collect\ndonations from 130,000 individuals – that’s a minimum of 400 unique donors per\nstate in at least 20 states – and register at least 2% in four public opinion\npolls by August 28 to qualify for the democratic debates in September and\nOctober.&nbsp; <\/p>\n\n\n\n<p>The new qualification criteria have spurred a shift away from a big-donor fundraising approach in favor of small-dollar digital efforts. A new political advertising forecast estimates that digital media will account for <a href=\"https:\/\/www.mediapost.com\/publications\/article\/337226\/2020-political-ad-spend-could-hit-10-billion-dig.html\">30% of the $10 billion<\/a> to be spent in the U.S. for the upcoming 2020 election season – double its take for the 2016 presidential election year. <\/p>\n\n\n\n<h4>Democrats Face Fundraising Hurdles <\/h4>\n\n\n\n<p>Of the $9.8 million Democratic candidates spent between March 30 and June 15 on Facebook advertisements, <a href=\"https:\/\/2020campaigntracker.com\/\">$2.5 million went toward ads<\/a> that mentioned the democratic debates.&nbsp; While social ads may help Democrats grow their email lists and attract new donors, running an acquisition campaign can be costly – some candidates are paying up to $40 per donation this election cycle. <\/p>\n\n\n\n<p>Aside from the hefty price tag associated with acquiring new\ndonors (it often costs much more than $1 to raise $1), Democrats are facing\nadditional challenges in the fundraising arena. Blue candidates share voter\ndata via the DNC and use the same nonprofit fundraising platform – ActBlue – to\npull in small-dollar donations. Relying on a single pool of aged voter files,\nthey end up cannibalizing fundraising efforts. <\/p>\n\n\n\n<h4>Candidates Diversify Donor Acquisition Efforts<\/h4>\n\n\n\n<p>What must Democrats do to secure their spot in the make-or-break fall debates? Diversifying acquisition efforts beyond traditional channels is a good first step. Campaigns that have had success in finding new donors on social, but are now hitting a wall thanks to saturation and rising costs, have much to gain from pursuing new channels with proven conversion rates. <\/p>\n\n\n\n<p>To make the most of their advertising dollars, campaigns need access to <a href=\"https:\/\/www.fluentco.com\/resources\/driving-political-participation-how-to-engage-supporters-at-scale\/\">self-declared voter insights<\/a>. While stale voter registration files are unlikely to align with individuals’ current party affiliation or candidate of choice, real-time data from Fluent can help campaigns identify and target the audiences with the highest propensity to donate. <\/p>\n\n\n\n<p>In the upcoming democratic debates, actions – not impressions – will determine which candidates earn the opportunity to defend their platform on a national stage. As a go-to growth partner for candidates and causes, Fluent can deliver pre-qualified audiences on a pay for performance model, allowing candidates to drive donations without draining their campaign budget. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the democratic debates this fall, actions – not impressions – will determine which candidates defend their platform on a national stage. <a href=\"https:\/\/www.fluentco.com\/blog\/fundraising-democratic-debates\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8021,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[139,178],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8020"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8020"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8020\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8021"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8020"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8020"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8020"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8020"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}