{"id":8022,"date":"2019-08-15T19:31:13","date_gmt":"2019-08-15T19:31:13","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8022"},"modified":"2020-12-29T02:19:14","modified_gmt":"2020-12-29T02:19:14","slug":"summer-marketing-internship-2019","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/summer-marketing-internship-2019\/","title":{"rendered":"Exploring New Horizons: My Content Marketing Internship at Fluent"},"content":{"rendered":"\n<h4><strong>About Me<\/strong><\/h4>\n\n\n\n<p>My name is Katie Kennedy and I spent this summer as a Content Marketing Intern at Fluent. My road map to get here was not a traditional one. I graduated from Florida State with a degree in Early Childhood Education and earned my master’s in Reading Education from the University of South Florida. I’ve been an elementary classroom teacher for the past six years in Florida and New York. So, how did I end up at Fluent? Well, working on my own style\/travel <a href=\"http:\/\/www.orangetoappleblog.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"blog (opens in a new tab)\">blog<\/a> made me extremely interested in a career in content marketing, and Fluent offered me an amazing opportunity to learn. <\/p>\n\n\n\n<h4>The Search<\/h4>\n\n\n\n<p>Most teachers like to spend their summer vacations in one of two ways: either working a summer program offered at our school or taking the summer to relax and recharge. I&#8217;d taken both routes throughout my career, but this summer would be different. Since I was stepping out into a new field, I wanted to make sure that my time would be well-spent and full of learning opportunities. Reading the previous internship blog posts from <a rel=\"noreferrer noopener\" aria-label=\"Devon (opens in a new tab)\" href=\"https:\/\/www.fluentco.com\/resources\/diary-fluent-marketing-design-intern\/\" target=\"_blank\">Devon<\/a> and <a href=\"https:\/\/www.fluentco.com\/resources\/fluent-internship\/\">James<\/a> gave me some great insight. Since I had met many co-workers beforehand, I already knew that personalities would be a great match. Fluent, for me, was the only way to go. <\/p>\n\n\n\n<h4>Interview Process<\/h4>\n\n\n\n<p>As soon as the interview process began, I\ninstantly felt like a member of the Fluent team. More like an open conversation\nbetween co-workers, each of my two phone interviews were positive, sincere, and\ninformative. I quickly got a sense that people at Fluent genuinely enjoy coming\ninto work every day. That sentiment is infectious and made me want to start my\ninternship right away. Due to my school calendar, they were very accommodating of\na later start date. The team also expressed their excitement to gain perspective\nfrom someone in the educational field. <\/p>\n\n\n\n<h4>My Role<\/h4>\n\n\n\n<p>I was the 2019 Content Marketing Intern from June to August. In that short time, I felt like I really hit the ground running, working on several projects for Fluent’s blog and social media pages. As a writer, I really loved being able to come into work every day and simply put pen to paper. My projects required research and helped me to build a foundational knowledge of the space. Sitting in on so many marketing meetings was also another amazing opportunity to learn about the digital marketing industry firsthand. Although I focused primarily on content, everyone from my team and across the company was so open to sharing their knowledge and experience.  <\/p>\n\n\n\n<h4><strong>The Office<\/strong><\/h4>\n\n\n\n<p>I could not ask for a better office space. Fluent moved into their new location at 300 Vesey Street back in March. The open floor plan makes the entire company completely accessible. During the first week of my internship, it seemed like everyone stopped by to introduce themselves. I wasn’t just an intern, but a valued member of the Fluent team. A great space is only the beginning of the perks. Weekly lunches, endless snacks, and even a game center helped to make the office feel like home. My favorite feature of Fluent HQ, though, had to be the views! Nestled up right next to the Hudson I had full views of the Statue of Liberty, Ellis Island, and the boats floating along the river. Taking my laptop and working next to the windows provided plenty of inspiration for my writing. <\/p>\n\n\n\n<h4><strong>Average Work Day<\/strong><\/h4>\n\n\n\n<p>After a 30-minute subway ride from the Upper East Side, no day at Fluent could officially start without first grabbing a coffee from our in-office barista, Orlando. The <em>Connection Point Cafe <\/em>is Fluent’s version of the local watering hole, where employees can greet one another for the day and simply catch up. After my morning coffee, the days would fly by. Between popping into various marketing-related meetings and developing content for the blog, my schedule was always busy.<\/p>\n\n\n\n<p>Each day was a unique experience. Once a week, Intern Sessions were held to help interns learn about the company and get facetime with upper management. These sessions also offered me a chance to get to know my fellow interns. There were several of us this year, 19 total, working with various teams across the company. Although we all had different backgrounds, talents, and goals, each of us put our maximum effort into the work we did at Fluent. <\/p>\n\n\n\n<h4><strong>Internship Takeaways<\/strong><\/h4>\n\n\n\n<p>Like I said before, my background isn’t one that would typically lead to an internship at a performance marketing company. Starting a new career, whether fresh out of college or several years later, is equal parts exciting and terrifying. The trick to making the most of it is diving right into new experiences while surrounding yourself with people who will motivate you and help you grow. If this sounds like where you are, and you’re willing to work hard in the process, why not <a href=\"https:\/\/www.fluentco.com\/join-our-team\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"start this new journey at Fluent (opens in a new tab)\">start this new journey at Fluent<\/a>? I promise you won’t regret it!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Starting a new career is equal parts exciting and terrifying. The trick to making the most of it is diving into new experiences and surrounding yourself with people who will help you grow. <a href=\"https:\/\/www.fluentco.com\/blog\/summer-marketing-internship-2019\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8025,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[185],"blog_category":[135],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8022"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8022"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8022\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8025"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8022"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8022"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8022"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8022"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}