{"id":8071,"date":"2019-09-25T21:25:51","date_gmt":"2019-09-25T21:25:51","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8071"},"modified":"2020-12-29T02:19:14","modified_gmt":"2020-12-29T02:19:14","slug":"recruitment-advertising-101","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/recruitment-advertising-101\/","title":{"rendered":"Recruitment Advertising 101: Reaching the Right Candidates"},"content":{"rendered":"\n<p>Simply put, recruitment advertising is a strategy used to attract potential employees. With <a aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\" href=\"https:\/\/money.cnn.com\/2017\/05\/24\/news\/economy\/gig-economy-intuit\/index.html\" target=\"_blank\">34% of the workforce moving to a freelance mindset<\/a>, and average job tenure shortening, recruitment advertising is more crucial than ever. In an industry that spans over 100 years, the end goal of recruitment advertising has always been the same &#8212; to find qualified candidates to fill job openings. As you navigate the evolving recruitment advertising landscape, here are some tips to help source top talent. <\/p>\n\n\n\n<h4><strong>Know Your Audience<\/strong>: Active vs. Passive Job Seekers<br><\/h4>\n\n\n\n<p>There are two different kinds of job seekers to consider when recruiting new talent. The active seeker is ready for a new job today. They are looking for new jobs daily or a few times a week. They want a change and may have already come across your company. Potential candidates can find information about your company without ever speaking to a recruiter. Because of this, it’s important to clearly communicate your brand identity and value proposition to potential employees across your corporate website and social media channels. <\/p>\n\n\n\n<p>The passive job seeker is content with their job for the moment, but open to exploring new possibilities. Rather than actively searching for job opportunities, they want <em>you<\/em>, the employer, to seek <em>them <\/em>out. A relationship with this type of job seeker should be nurtured from the very beginning to help foster a connection and lead to potential job interest. At any given point, <a aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\" href=\"http:\/\/www.digitaltalentgroup.com\/active-vs-passive-candidate.html\" target=\"_blank\">80% of today’s workforce is passively looking for a new job<\/a>. Making up the vast majority of job seekers, it is important for recruitment advertisers to invest resources in reaching this audience. <br><\/p>\n\n\n\n<h4><strong>Traditional vs. Digital<\/strong> Recruitment Advertising Channels<br><\/h4>\n\n\n\n<p>The roots of recruitment advertising are in traditional marketing. Since the beginning of modern print, starting in the 1900s, that looked like pay-per-word listings in the classified section of the local paper. While print is still an option today, companies are using TV, radio, podcasts, and outdoor ad space, such as billboards or taxis, to help recruit new talent. Using traditional channels to create a positive brand association can help to capture the attention of potential job seekers no matter what their stage in the job hunting process.&nbsp;<\/p>\n\n\n\n<p>While traditional recruitment advertising channels can have a huge impact on your company’s brand recognition and visibility, it can be difficult to track ROI. That’s where digital marketing comes in. By partnering with job boards and niche job sites, you can leverage sponsored posts to make job listings more visible in search results. Recently, social media has also become a top destination for those on the job hunt. <a aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.globenewswire.com\/news-release\/2016\/03\/23\/1202134\/0\/en\/Americans-Uncertain-About-the-Future-of-Work-2016-Jobvite-Job-Seeker-Nation-Study-Shows.html\" target=\"_blank\" rel=\"noreferrer noopener\">48% have used social platforms for their search<\/a>, with Facebook being the most popular. This presents companies with an opportunity to use both paid and organic social campaigns to connect with job seekers where they are already actively engaged.<\/p>\n\n\n\n<p>Recruitment advertising is just one slice of the talent acquisition pie, but it is something all companies should employ to help source top talent. At Fluent, we’re experts in providing candidates with highly relevant job openings based on self-declared insights. To learn how Fluent can help to enhance your recruitment advertising strategy, get in touch with us <a href=\"https:\/\/www.fluentco.com\/lets-talk\/\">here<\/a>. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Recruitment advertising is just one slice of the talent acquisition pie, but it is something all companies should employ. At Fluent, we’re experts in providing candidates with highly relevant job openings based on self-declared insights.  <a href=\"https:\/\/www.fluentco.com\/blog\/recruitment-advertising-101\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8073,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[142,182],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8071"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8071"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8071\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8073"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8071"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}