{"id":8264,"date":"2020-02-04T21:59:58","date_gmt":"2020-02-04T21:59:58","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8264"},"modified":"2020-12-29T02:19:15","modified_gmt":"2020-12-29T02:19:15","slug":"industry-preview-recap","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/industry-preview-recap\/","title":{"rendered":"AdExchanger&#8217;s Industry Preview: Key Takeaways for Marketers"},"content":{"rendered":"\n<p>Last week, top brands, agencies, publishers, and technology providers gathered in New York City for AdExchanger’s annual <a href=\"https:\/\/industrypreview.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Industry Preview (opens in a new tab)\">Industry Preview<\/a>. Over the course of the two-day conference, powerhouse speakers from Google, Amazon, Facebook, and others took to the stage to share their visions for the future of digital marketing in 2020 and beyond. <\/p>\n\n\n\n<p>Reeling from Google’s recent announcement to phase out third-party cookies by 2022, industry leaders shared their thoughts on the future of digital advertising in a world without cookies. In addition to discussions over the fate of the open web, other hot topics included consumer privacy, brand safety, and heightened competition in the OTT space. See below for a roundup of our key takeaways.<\/p>\n\n\n\n<h4><strong>The future of OTT\/CTV will be ad-supported<\/strong><\/h4>\n\n\n\n<p>As more consumers cut the cord and adopt subscription video on demand (SVOD) services, linear TV ad buys are becoming less effective in their ability to provide access to key audience segments. Rather than choosing between an SVOD or ad-based video on demand model (AVOD), streaming companies should consider adopting a dual revenue stream approach. For example, while Netflix currently leads the pack in terms of content consumption, it will need to raise prices or offer an ad-supported tier in order to compete with the likes of Disney Plus and NBCU’s upcoming Peacock service. With CTV ad spending projected to approach $9B in 2020, streaming service providers have an opportunity to offer expanded reach and more precise targeting to advertisers seeking to take advantage of this channel. Tiered pricing models (e.g. Hulu) and bundled service offerings (e.g. Amazon Prime) will also be key to acquiring new subscribers as the streaming wars continue.<\/p>\n\n\n\n<h4><strong>The death of third-party cookie ≠ the end of addressable advertising<\/strong><\/h4>\n\n\n\n<p>While the rollout of CCPA and ongoing browser crackdowns will push more ad dollars to walled gardens, all hope is not yet lost for the future of addressability on the open web. In the next two years, the quest for a single universal identifier across all devices and domains will reach its peak as buyers and sellers work to create a unified, privacy-safe ecosystem. In attempt to balance the needs for user privacy with the interests of advertisers and publishers, Google is positioning its sandbox a space for all relevant parties to work through these changes and create a consistent privacy standard– though the amount of say publishers, advertisers, and adtech companies will <em>actually <\/em>have in the process remains to be seen. <\/p>\n\n\n\n<h4><strong>Retail must evolve in an age of anti-escalator sentiment<\/strong><\/h4>\n\n\n\n<p>According to Scott Galloway, Professor of Marketing at NYU Stern, “Millennials won’t go into a store with an escalator.” The retail landscape is changing, and with access to next-day shipping at their fingertips, shoppers need a good reason to go into a brick and mortar. Retailers are leveraging consumer tech and purchase data to better communicate their brand narrative and motivate consumers to get involved. For example, Pandora has added an in-store engraving machine to make the shopping experience more engaging, in addition to a “Treasures Table” where consumers can discover bestselling products that are often purchased in tandem. In addition to efforts to improve the in-store shopping experience, online retailers such as Wayfair are looking beyond the conversion, launching loyalty programs that provide added value to the customer while also generating recurring revenue. <\/p>\n\n\n\n<p>For a look at some of Fluent’s predictions for what’s to come this year in digital marketing, check out our <a href=\"https:\/\/www.fluentco.com\/resources\/2020-digital-marketing-trends\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"2020 trends (opens in a new tab)\">2020 trends<\/a> blog post. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week, top brands, agencies, publishers, and technology providers gathered in New York City for AdExchanger’s annual Industry Preview. In addition to discussions over the fate of the open web, other hot topics included consumer privacy, brand safety, and heightened competition in the OTT space. <a href=\"https:\/\/www.fluentco.com\/blog\/industry-preview-recap\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8265,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[183],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8264"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8264"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8264\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8265"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8264"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8264"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8264"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8264"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}