{"id":8310,"date":"2020-03-09T17:53:42","date_gmt":"2020-03-09T17:53:42","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8310"},"modified":"2020-12-29T02:19:15","modified_gmt":"2020-12-29T02:19:15","slug":"rampup-recap-2020","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/rampup-recap-2020\/","title":{"rendered":"RampUp Wrap-Up: 3 Key Themes Shaping the Future of MarTech"},"content":{"rendered":"\n<p>In its eighth year, <a rel=\"noreferrer noopener\" aria-label=\"RampUp (opens in a new tab)\" href=\"https:\/\/rampedup.us\/rampup\/\" target=\"_blank\">RampUp<\/a> unveiled new tracks, reinvented its popular Innovation Studio, and introduced RampUp for Developers – an invitation for engineers, integration managers, and product leads to learn about the latest trends in big data.&nbsp;Welcoming industry professionals from leading brands, agencies, and ad technology vendors, the two-day event took place in San Francisco from March 2 – 3. <\/p>\n\n\n\n<p>Similar to <a href=\"https:\/\/www.fluentco.com\/resources\/rampup-recap-five-key-themes\/\">last year<\/a>, topics such as consumer privacy and compliance took center stage as speakers and panelists reckoned with the future of digital advertising in a post-cookie world. The <a href=\"https:\/\/www.fluentco.com\/resources\/advanced-tv-targeting\/\">convergence of TV and digital<\/a> was also a large focus as speakers discussed strategies for omnichannel activation and outcome-based measurement. Check out all of our key takeaways from the conference below. <\/p>\n\n\n\n<h4>1. <strong>Advertisers are uniquely positioned to help to shape our impending cookieless world. <\/strong><\/h4>\n\n\n\n<p>Google’s momentous decision to phase out third-party cookies represents a critical juncture for the advertising industry. All stakeholders affected by the decision have an opportunity to be active participants in shaping our new post-cookie world, but what are some ways to get involved? <\/p>\n\n\n\n<p>As the non-profit consortium engaging global leaders to develop industry standards and enable trust in the digital media ecosystem, the <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/iabtechlab.com\/priorities\/\" target=\"_blank\">IAB Tech Lab<\/a> is a great place to start. During her session, Lauren Silva, VP of Programmatic Partnerships at CBS Interactive, encouraged attendees to collaborate with the Tech Lab in helping to create an ecosystem that is mutually beneficial for both consumers and advertisers.<\/p>\n\n\n\n<h4>2. <strong>During a time of sweeping industry shifts, an emphasis on consumer trust remains constant.<\/strong><\/h4>\n\n\n\n<p>While the direction of the digital advertising industry as a whole is yet to be determined, the conversation around the importance of <a href=\"https:\/\/www.fluentco.com\/resources\/behind-the-rise-of-data-transparency\/\">data privacy and transparency<\/a> has only just begun. With GDPR and CCPA top of mind for most marketers, the idea of investing in consumer trust was a common theme throughout the conference. <\/p>\n\n\n\n<p>Introducing a solution to broader industry struggles, LiveRamp kicked off the event with its new <a rel=\"noreferrer noopener\" aria-label=\"“Safe Haven” (opens in a new tab)\" href=\"https:\/\/www.adweek.com\/programmatic\/liveramp-unveils-safe-haven-its-answer-to-privacy-demands\/\" target=\"_blank\">“Safe Haven”<\/a> product – an offering that will help stakeholders share customer insights “in a neutral, permission-controlled, privacy-first environment.” In order to gain consumers&#8217; trust, brands must educate customers on how their data is being used while also providing valuable experiences in exchange for first-party consent. <\/p>\n\n\n\n<h4>3. <strong>The personalized consumer journey lies at the intersection of ethical data use and creative. <\/strong><\/h4>\n\n\n\n<p>Neither data nor creative alone can be used to solve a brand’s problems. Instead, the two must be leveraged in tandem to create personalized experiences that matter to consumers. &nbsp;In a discussion on the power of data and creative, TBWA\\World Health’s Walt Geer explained to the crowd, “We’re too worried about scale. We need to think about the customer journey in terms of touchpoints: how do we communicate with consumers…and where?” <\/p>\n\n\n\n<p>The loss of third-party cookies and changing consumer preferences are making it more difficult to address audiences at different stages in the customer journey. In an age where personalization is becoming increasingly consumer-driven and self-directed, brands that can deliver tailored experiences while still honoring consumer privacy will be best positioned to maintain addressability across the changing ecosystem. <\/p>\n\n\n\n<h4>Looking Ahead<\/h4>\n\n\n\n<p>That’s a wrap for RampUp 2020! Check back with us next year to measure the progress of our industry as we strive toward creating meaningful consumer experiences in a privacy-safe, cookie-free world. &nbsp;<\/p>\n\n\n\n<p><strong>To learn how Fluent can help with your omnichannel marketing strategy in today’s changing privacy landscape, connect with us <a href=\"https:\/\/www.fluentco.com\/data-for-programmatic-targeting\/\">here<\/a>.  <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In its eighth year, RampUp unveiled new tracks, reinvented its popular Innovation Studio, and reckoned with the fate of digital advertising in a post-cookie world. Check out our key takeaways from the conference here. <a href=\"https:\/\/www.fluentco.com\/blog\/rampup-recap-2020\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8313,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[167],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8310"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8310"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8310\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8313"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8310"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}