{"id":8361,"date":"2020-04-07T08:43:00","date_gmt":"2020-04-07T08:43:00","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8361"},"modified":"2021-02-11T17:00:11","modified_gmt":"2021-02-11T17:00:11","slug":"kochava-traffic-index-q1-2020","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/kochava-traffic-index-q1-2020\/","title":{"rendered":"Fluent Ranked Among Top 20 Media Partners in Latest Kochava Traffic Index"},"content":{"rendered":"\n<p>On March 31, Kochava released its <a rel=\"noreferrer noopener\" aria-label=\"Q1 2020 Traffic Index (opens in a new tab)\" href=\"https:\/\/www.kochava.com\/kochava-traffic-index\/\" target=\"_blank\">Q1 2020 Traffic Index<\/a>, ranking Fluent among the <strong>top 20 in Fraud Prevention<\/strong> and the <strong>Best in Class for Click-to-Install Correlation<\/strong>.*  <\/p>\n\n\n\n<p>The Kochava Traffic Index is an objective ranking of independent media partners based upon Kochava’s qualitative, data-driven analysis of billions of mobile ad campaign transactions. Putting traditional vanity metrics aside, the index helps ad networks and brands make smarter decisions in evaluating the quality and integrity of campaign traffic.  <\/p>\n\n\n\n<p>The latest Traffic Index analyzes performance data from H2 2019 and ranks the top 20 media partners in terms of the following categories: Signal Clarity, Fraud, Click-to-Install Correlation, and Quality of Retention. Below we explore the two categories where Fluent ranked in the top 20, and why these factors are important for mobile marketers to consider when choosing a media partner. <\/p>\n\n\n\n<h2>Fraud Prevention<\/h2>\n\n\n\n<p>While many advertisers are beginning to take taking legal recourse against media partners that cost them millions in wasted ad spend, fraud remains a prevalent issue in the adtech arena. According to Kochava, placing in this category is “as high of an award or acknowledgment” a media partner can receive. Install fraud is weighted at 80% of the overall fraud score, with click fraud accounting for the remaining 20%.    <\/p>\n\n\n\n<h4>How it&#8217;s measured:<\/h4>\n\n\n\n<p>Click Fraud: The click score is the percentage of clicks that Kochava’s anti-fraud algorithms identify as having originated from a suspect device, sub-publisher, IP address, or any other vector of identification. <\/p>\n\n\n\n<p>Install Fraud: Install fraud is identical to click fraud, but measured as a percentage of installs. <\/p>\n\n\n\n<h4>Why it&#8217;s important:<\/h4>\n\n\n\n<p>Click Fraud: Fraudulent clicks have a trickle-down effect – stolen attribution and negative reinforcement for learning algorithms lead to data pollution and imprecise targeting over time.  <\/p>\n\n\n\n<p>Install Fraud: Fraudulent installs rarely result in high-value customers. Media partners that focus on a clean attribution signal well be best positioned to provide advertisers with loyal and engaged users. <\/p>\n\n\n\n<h3><strong>How Fluent Can Help<\/strong><\/h3>\n\n\n\n<p>As a leader in mobile user acquisition, Fluent leverages multiple\ntools to identify and prevent both click and install fraud. Prior to serving an\nad, Fluent uses third-party data validation solutions and proprietary\ntechnology to verify consumer information and create actionable profiles. <\/p>\n\n\n\n<div class=\"wp-block-columns\">\n<div class=\"wp-block-column\">\n<p>Third-party data validation partners verify the following data points collected across Fluent’s owned and operated sites:  <\/p>\n\n\n\n<ul><li>Email <\/li><li>Postal Address <\/li><li>Phone Number <\/li><\/ul>\n\n\n\n<p>Fluent’s proprietary technology and algorithms authenticate human behavior and user engagement. For example, if a user completes a 20-question survey in two seconds or other irregular behavioral patterns are detected, the user will then be redirected away from the Fluent-owned domain. <\/p>\n<\/div>\n\n\n\n<div class=\"wp-block-column\">\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Data-Verification.png\" alt=\"Data Verification\" class=\"wp-image-8362\" width=\"334\" height=\"419\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Data-Verification.png 532w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Data-Verification-239x300.png 239w\" sizes=\"(max-width: 334px) 100vw, 334px\" \/><\/figure>\n<\/div>\n<\/div>\n\n\n\n<h3><strong>Click-to-Install Correlation <\/strong><\/h3>\n\n\n\n<p>The higher the correlation between impression, click, install, and usage, the less fraud Kochava sees from a media partner’s traffic. In addition, app marketers can scale user acquisition more easily when there is a correlation among ads seen, interacted with, downloads, and app opens.  <\/p>\n\n\n\n<h4>How it’s measured:<\/h4>\n\n\n\n<p>Kochava measures the correlation between daily click volume and install volume, with a minimum of 21 days in a month containing at least 100 installs. Any media partner\/day combination that is plus or minus three standard deviations is labeled as an outlier and excluded.<\/p>\n\n\n\n<h4>Why it’s important: <\/h4>\n\n\n\n<p>Click-to-install correlation is a strong indicator of scalability, incrementality, and a lack of ad fraud. Media partners that can show the source of their traffic and reasonable impression-to-click, click-to-install, and install-to-payer performance can demand a high premium for their services. <\/p>\n\n\n\n<h3><strong>How Fluent Can Help<\/strong><\/h3>\n\n\n\n<p>Fluent interacts with nearly one million Americans daily across our portfolio of owned and operated media properties. There are no third-party exchanges on our site, nor do we allow traditional banner inventory. The breadth and depth of our user base enable advertisers to access audiences outside of their core demographic profile, while the exclusivity of our inventory provides incremental lift.<\/p>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:46% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"1012\" height=\"731\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Brand-Audience-2.png\" alt=\"Brand Audience\" class=\"wp-image-8364\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Brand-Audience-2.png 1012w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Brand-Audience-2-300x217.png 300w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/04\/Brand-Audience-2-768x555.png 768w\" sizes=\"(max-width: 1012px) 100vw, 1012px\" \/><\/figure><div class=\"wp-block-media-text__content\">\n<p>For example, a leading music streaming company worked with Fluent to drive new memberships. By creating and targeting audience segments with a confirmed interest in music streaming services, Fluent was able to identify and reach 10% more women compared to brand marketing alone. Delivering incremental reach, Fluent also expanded audience opportunity through geographic targeting and increased user acquisition in three key states by 55%. <\/p>\n<\/div><\/div>\n\n\n\n<p>We are honored to be featured alongside such great company in Kochava&#8217;s latest Traffic Index. This recognition is reflective of Fluent&#8217;s efforts to become a leader in fraud prevention and a trusted provider of <a rel=\"noreferrer noopener\" aria-label=\"mobile user acquisition (opens in a new tab)\" href=\"https:\/\/www.fluentco.com\/resources\/user-acquisition-beyond-duopoly\/\" target=\"_blank\">mobile user acquisition<\/a> solutions. If you want to more learn about how Fluent can help you acquire new users for your mobile app, connect with us <a rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\" href=\"https:\/\/www.fluentco.com\/mobile-user-acquisition\/\" target=\"_blank\">here<\/a>!<\/p>\n\n\n\n<hr class=\"wp-block-separator is-style-default\"\/>\n\n\n\n<p>*Kochava uses four categories to classify media partners in its Traffic Index: DSP, In-App Network, Rewarded Behavior, and Social\/App. Because Fluent operates across multiple categories and inventory types, for the purposes of this index, it has been labeled as a DSP.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>On March 31, Kochava released its Q1 2020 Traffic Index, ranking Fluent among the top 20 in Fraud Prevention and Best in Class for Click-to-Install Correlation. <a href=\"https:\/\/www.fluentco.com\/blog\/kochava-traffic-index-q1-2020\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8373,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[151,162],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8361"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8361"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8361\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8373"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8361"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}