{"id":8407,"date":"2020-04-23T18:15:10","date_gmt":"2020-04-23T18:15:10","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8407"},"modified":"2020-12-29T02:19:16","modified_gmt":"2020-12-29T02:19:16","slug":"performance-marketing-partnerships","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/performance-marketing-partnerships\/","title":{"rendered":"How Performance Marketing Partnerships Help to De-Risk Ad Spend"},"content":{"rendered":"\n<p>In partnership with the <a href=\"https:\/\/www.leadscouncil.org\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">LeadsCouncil<\/a>, Jonah Lovens, SVP of Revenue at Fluent, hosted a webinar with industry leaders from <a href=\"https:\/\/www.jornaya.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Jornaya<\/a>, <a href=\"https:\/\/digitalmediasolutions.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Digital Media Solutions<\/a>, <a href=\"https:\/\/www.progrexion.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Progrexion<\/a>, and <a href=\"https:\/\/www.centerfield.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Centerfield Media<\/a> to discuss strategies and best practices for de-risking ad spend. Check out some key takeaways from the webinar below or watch the full recording <a href=\"https:\/\/vimeo.com\/409025193\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">here<\/a>.  <\/p>\n\n\n\n<h3><strong>The State of Marketing Today <\/strong><\/h3>\n\n\n\n<p>As brands and advertisers adjust their marketing strategies in response to the COVID-19 outbreak, <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/topics-na1.emarketer.com\/category\/coronavirus\" target=\"_blank\">eMarketer continues to revise forecasts<\/a> for mobile, digital video, search, and TV ad spend in H1 2020. The digital duopoly is at risk of losing a combined <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/variety.com\/2020\/digital\/news\/facebook-google-ad-revenue-loss-coronavirus-1203544502\/\" target=\"_blank\">$44 billion in worldwide ad revenue<\/a> in 2020 due to the coronavirus and smaller digital businesses and ad agencies are making the news with aggressive layoffs and furloughs. <\/p>\n\n\n\n<p>Often perceived as a revenue center rather than a cost center, performance marketing and the ecosystem around it are perhaps most well-suited to withstand the turmoil of the changing advertising landscape. Performance marketers are held accountable to down-funnel actions that ensure advertisers see positive ROI. Even as marketing budgets shrink in the face of economic uncertainty, performance marketing programs remain a reliable channel for driving customer acquisition and overall growth.  <\/p>\n\n\n\n<h3><strong>3 Benefits of Moving Billable Actions Further Down the Marketing Funnel<\/strong><\/h3>\n\n\n\n<p>In recent years there has been a noticeable trend in performance marketing away from top-of-funnel conversions, like clicks and installs, towards “deeper funnel” billable actions, like a sale or paying customer. This trend has effectively de-risked performance ad spend for advertisers and marketers alike, ensuring that they only pay for the consumer actions that are most meaningful. When executed correctly this allows for scalable and sustainable marketing campaigns focused on transparency and real-time insights. <\/p>\n\n\n\n<h4>1. <strong>Shift to more strategic partnerships<\/strong><\/h4>\n\n\n\n<p>The trend toward moving billable actions further down the marketing funnel coincides with a larger shift to more strategic performance partnerships. Looking beyond the lead, the most effective relationships between advertisers and publishers are no longer solely transactional. <\/p>\n\n\n\n<p>When the publisher understands the pain points the advertiser is trying to solve inside the customer journey, they can work together to deploy an acquisition solution that enables efficiencies within the business and ultimately drives meaningful actions and long-term value. <\/p>\n\n\n\n<h4>2. <strong>Better alignment between advertisers and publishers<\/strong><\/h4>\n\n\n\n<p>Once a strategic\npartnership is established, advertisers and publishers should operate as natural\nextensions of one other. For the partnership to be successful, full alignment\nmust be achieved in the following areas:&nbsp;\n&nbsp;<\/p>\n\n\n\n<ul><li><strong>Performance<\/strong>: Advertisers and publishers must be committed to working toward the same goals in order to create a partnership built on trust and results. When the billable action is moved further down the funnel, there is less turnover and focus on short-term wins among publishers, and more opportunity to grow long-lasting partnership. Advertisers should also be willing to share proprietary performance data to identify which leads are converting and help publishers optimize toward quality and scale. <\/li><\/ul>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<ul><li><strong>Privacy and Compliance<\/strong>: The notion of de-risking ad spend goes beyond aligning performance incentives between advertisers and publishers. Because both parties interact with the consumer at different stages of the customer journey, they each take on a certain level of risk – publishers must take ownership of outbound communications with consumers, and advertisers must trust publishers to operate on behalf of their brand. A transparent and consistent approach to privacy and compliance across both partners is key to mitigating this risk and creating a seamless consumer experience.<\/li><\/ul>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4>3. <strong>A stronger focus on customer lifetime value<\/strong><\/h4>\n\n\n\n<p>With the shift from “lead-centric programs” to “person-centric programs,” lifetime value is becoming more important than conversions. Advertisers are looking at lead generation less as an opportunity to monetize immediately, but rather as a channel to acquire first-party data for their long-term CRM marketing efforts. <\/p>\n\n\n\n<p>Insights into purchase decisions and down-funnel actions are invaluable in identifying and responding to consumers’ needs. As performance marketing practices continue to evolve, advertisers will look beyond the completion of a lead generation form to connect consumers with the products and offers that build loyalty and add meaningful value to their lives. <\/p>\n\n\n\n<h3><strong>Work with Fluent to De-Risk Ad Spend <\/strong><\/h3>\n\n\n\n<p>At Fluent, we pride ourselves on being the trusted acquisition partner for both established and growing brands. Alignment and transparency with our advertising partners help to unlock evergreen performance marketing programs, and no tool has been more powerful in that effort than aligning ad spend with meaningful down-funnel actions. Connect with us <a href=\"https:\/\/www.fluentco.com\/lets-talk\/\">here<\/a> to learn how we can help your business drive qualified leads with high lifetime value. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Performance marketers are held accountable to down-funnel actions that ensure advertisers see positive ROI. Even as marketing budgets shrink in the face of economic uncertainty, performance marketing programs remain a reliable channel for driving customer acquisition and overall growth.   <a href=\"https:\/\/www.fluentco.com\/blog\/performance-marketing-partnerships\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8408,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[182],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8407"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8407"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8407\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8408"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8407"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8407"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8407"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8407"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}