{"id":8424,"date":"2020-05-21T14:25:44","date_gmt":"2020-05-21T14:25:44","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8424"},"modified":"2020-12-29T02:19:16","modified_gmt":"2020-12-29T02:19:16","slug":"alternatives-to-voter-files","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/alternatives-to-voter-files\/","title":{"rendered":"Alternatives to Voter Files: Tips for Targeting and Engaging Voters Across Channels"},"content":{"rendered":"\n<p>This month, Morgan Rigsbee, Fluent’s VP of Product and Strategy for its programmatic division, joined industry leaders from LiveRamp, Infogroup, Foursquare, and Mockingbird Lab for the RampUp: Virtual Political Summit. Check out some key takeaways from the webinar below or register to view the “Alternatives to Voter Files” session on-demand <a rel=\"noreferrer noopener\" href=\"https:\/\/rampedup.us\/rampup-political-virtual-summit\/register\/\" target=\"_blank\">here<\/a>.&nbsp;<\/p>\n\n\n\n<h3><strong>Traditional Voter Files in a Changing Digital Landscape<\/strong><\/h3>\n\n\n\n<p>A <a rel=\"noreferrer noopener\" href=\"https:\/\/www.pewresearch.org\/fact-tank\/2018\/02\/15\/voter-files-study-qa\/\" target=\"_blank\">voter file<\/a> is the database of registered voters in a given state or district.&nbsp;Beyond providing a view into voter registration and election turnout, voter files also include information from outside data sources such as consumer data vendors and political organizations. Below we explore some of the challenges with traditional voter files as well as alternative data sources political advertisers can leverage to connect with the right voters.<\/p>\n\n\n\n<h4><strong>Challenges with Traditional&nbsp;Voter&nbsp;Files<\/strong>​<\/h4>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<ul><li><strong>Accuracy​ &#8211;<\/strong> Voter files are stagnant and often do not account for real-time shifts in behavior and beliefs. Accuracy is dependent on multiple data vendors contributing to an individual file. While all vendors get their data from official government records, how they gather and match those records, and what additional information they include can vary.<\/li><\/ul>\n\n\n\n<ul><li><strong>Usability​ <\/strong>– Within the last year, Google has <a rel=\"noreferrer noopener\" href=\"https:\/\/www.theverge.com\/2019\/11\/20\/20975054\/google-advertising-political-rules-twitter-ban-election-uk-general-2020\" target=\"_blank\">restricted political advertisers<\/a> from using public voter records in their campaign targeting while Twitter has banned political advertising entirely from its platform. As voters become more conscious of how their data is used in the digital ecosystem, campaigns are limited in where and how they can leverage voter files for their targeting efforts. <\/li><\/ul>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4><strong>Alternatives to Traditional Voter Files<\/strong><\/h4>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<ul><li><strong>Real-time survey data<\/strong> &#8211; One of the best ways to understand consumers is to simply ask them how they feel. Data providers with real-time survey capabilities can collect actionable insights around behaviors, opinions, and sentiments as they change over time.<\/li><\/ul>\n\n\n\n<ul><li><strong>Location data<\/strong> &#8211; Geolocation data is useful for targeting voters in certain congressional districts or reaching people based on the types of events they attend. &nbsp;During a time when movement is limited, political advertisers can also use historical location data to help predict future actions and behaviors.<\/li><\/ul>\n\n\n\n<ul><li><strong>Ground truth data &#8211;<\/strong> Ground truth data refers to insights that are observed directly. For example, according to Richard Bell at Infogroup, behavioral data is less predictive and more difficult to model when trying to identify donor audiences. As a result, the best source for finding new donors is using a list of existing ones.<\/li><\/ul>\n\n\n\n<p><em>Need help deciding what type of data is right for your campaign? Check out our guide for selecting a data provider <a href=\"https:\/\/www.fluentco.com\/resources\/data-provider-criteria\/\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/em><\/p>\n\n\n\n<h3><strong>Key Takeaways for Political Advertisers<\/strong><\/h3>\n\n\n\n<p>Due to rising concerns around data privacy, advertisers across all verticals are reevaluating their audience targeting strategy. To navigate this changing landscape and more accurately tie campaign efforts to&nbsp;real-time&nbsp;behaviors, political advertisers should look to&nbsp;assemble a&nbsp;combination of insights from voter files, alternative data providers, and their own first-party data.<\/p>\n\n\n\n<h5>1. <strong>Look at attributes beyond partisanship to reach a more granular audience.<\/strong><\/h5>\n\n\n\n<p>Reactions to hot button issues don’t always correlate with voter files or fall along partisan lines. With DSPs and other platforms implementing strict targeting restrictions, data buyers should consider complementary audience attributes that may influence political leanings (i.e. environmentally conscious, attends church frequently). In order to reach niche audiences at scale, it also important to partner with data providers that offer options for strategic audience expansion.<\/p>\n\n\n\n<h5>2. <strong>Match online and offline consumer profiles to craft an omnichannel targeting approach. &nbsp;<\/strong><\/h5>\n\n\n\n<p>While traditional targeting efforts were once siloed, advertisers can now execute campaigns on digital, mobile, and CTV to create more meaningful interactions on the devices where consumers are most active. To engage consumers at each of these touchpoints, political advertisers should select data partners that can provide addressability across channels.<\/p>\n\n\n\n<h3><strong>Access Real-Time Insights from Fluent<\/strong><\/h3>\n\n\n\n<p>Fluent is a first-party data provider enabling campaigns and causes to <a href=\"https:\/\/www.fluentco.com\/resources\/driving-political-participation-how-to-engage-supporters-at-scale\/\">reach qualified audiences at scale<\/a>. Engaging with nearly one million consumers daily, we capture self-declared insights volunteered by opted-in users across Fluent’s proprietary network of websites.<\/p>\n\n\n\n<p>Leveraging our real-time survey capabilities, we create precise audience segments based on key insights like political affiliation and hot-button issues of interest. Whether the objective is driving people to donate, attend a rally, sign a petition, or get out to vote, Fluent helps political advertisers target net-new advocates and supporters.<\/p>\n\n\n\n<p><strong>For more information on leveraging Fluent data to identify and target voters, connect with us&nbsp;<a href=\"https:\/\/www.fluentco.com\/lets-talk\/\">here<\/a>.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>As voters become more conscious of how their data is used in the digital ecosystem, campaigns are limited in where and how they can use voter files for their targeting efforts. Here we explore some of the challenges with traditional voter files as well as alternative data sources political advertisers can leverage to connect with the right consumers. <a href=\"https:\/\/www.fluentco.com\/blog\/alternatives-to-voter-files\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8427,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[172,178],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8424"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8424"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8424\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8427"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8424"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8424"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8424"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}