{"id":8581,"date":"2020-07-16T16:47:13","date_gmt":"2020-07-16T16:47:13","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8581"},"modified":"2020-12-29T02:19:16","modified_gmt":"2020-12-29T02:19:16","slug":"future-of-martech-post-covid-19","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/future-of-martech-post-covid-19\/","title":{"rendered":"The Future of Martech: What Does the Industry Look Like Post-COVID-19?"},"content":{"rendered":"\n<p>In a few short months, COVID-19 has impacted nearly all aspects of daily life – from where we shop and eat to how we work out and interact with one another. Social distancing measures have prompted consumers to purchase groceries and other necessities online for the first time, while also increasing the demand for low-contact retail experiences. While these shifts in shopping behavior may seem like a sudden transformation, the adoption of conveniences like grocery delivery and curbside pickup are not unexpected nor temporary. For many advertisers, COVID-19 has simply accelerated changes in consumer behavior that were already in motion long before the pandemic erupted. <\/p>\n\n\n\n<p>Even with lockdown measures and stay-at-home orders being lifted in different corners of the globe, consumers will not be shopping in-store or dining out as consistently as they did pre-pandemic. While brick and mortar stores will become secondary to a brand’s online presence in our post-COVID-19 reality, marketers will need to identify and understand all their customers – not just the ones accustomed to shopping online. As a result, advertisers will need to search for new ways to connect the digital and physical worlds, creating streamlined shopping experiences both within and outside of the traditional retail environment.<\/p>\n\n\n\n<h3><strong>Mobile-first experiences will become table stakes post-COVID-19<\/strong><\/h3>\n\n\n\n<p>A mobile-first approach will become table stakes in creating convenient and safe environments for customers to engage. Mobile apps will be a primary tool in bridging the gap between the online and in-store shopping experience, helping to provide added convenience at a time when consumers need it most. While consumers are still making most of their online purchases via desktop, retailers are working to drive adoption of their mobile apps by optimizing load times, streamlining checkout, and adding easy payment options. Retailers with a strong&nbsp;<a href=\"https:\/\/www.clickz.com\/category\/digital-marketing\/ecommerce\/\" target=\"_blank\" rel=\"noreferrer noopener\">ecommerce<\/a>&nbsp; infrastructure and easy-to-use mobile app experience will be best positioned to accommodate consumers and respond to their changing needs.<\/p>\n\n\n\n<p>While ecommerce will be crucial in a post-COVID-19 world, retailers should also leverage mobile technology to make shoppers feel safe in existing brick and mortar store locations. For example, mobile wayfinding programs can help customers to navigate the aisles more easily and reduce time spent in-store, while click-and-collect options enable consumers to limit contact with other shoppers. According to its latest forecast, eMarketer predicts that click-and-collect will account&nbsp;<a href=\"https:\/\/content-na1.emarketer.com\/frictionless-commerce-2020\" target=\"_blank\" rel=\"noreferrer noopener\">for 8.2% of US ecommerce sales in 2020<\/a>, up from their pre-pandemic forecast of 7.6%. Allowing for more efficient curbside pickups and order-ahead options, mobile front-end transactions help create frictionless shopping experiences, saving time and money for retailers and customers alike.<\/p>\n\n\n\n<h3><strong>Consumers will continue to crave convenience and 1:1 brand interactions<\/strong><\/h3>\n\n\n\n<p>According to a<a href=\"https:\/\/www.demandlab.com\/resources\/chief-marketing-officer\/demandlab-report-martech-stack-optimization-2020\" target=\"_blank\" rel=\"noreferrer noopener\">&nbsp;January 2020 report<\/a>&nbsp;from DemandLab, about one in three senior marketing professionals worldwide identified improving personalization as both a priority and challenge when thinking about their martech stack optimization strategy. While the shift toward online shopping has made “<a href=\"https:\/\/www.clickz.com\/?s=personalization\" target=\"_blank\" rel=\"noreferrer noopener\">personalization<\/a>” a top priority for marketers in recent years, the importance of establishing one-to-one relationships will continue to grow as advertisers and consumers alike adjust to the “new normal.”<\/p>\n\n\n\n<p>For brands striving to attract new customers and build brand loyalty in a post-COVID-19 world, the notion of “customer-centricity” will be key. Whereas retail stores once acted as the middlemen between CPG brands and their customers, this paradigm shift represents an exciting opportunity for non-DTC advertisers to establish direct relationships with their customers. For example, take a traditional CPG marketer like Pepsi who moved rapidly to launch their own ecommerce experience for their snack brand. This move will only accelerate their ability to create one-to-one customer relationships at scale and enable far better personalization once consumers start shopping in-store again.<\/p>\n\n\n\n<p>For brands that don’t have the ability to spin up their own ecommerce solution overnight, there are tons of great solutions out there for building out robust first-party data assets including launching a sweepstakes, leveraging third-party customer acquisition solutions, and collecting first-party purchase data from their own brand websites. Once the dust settles, the marketers who properly leverage those insights to create personalized content experiences and inform better product recommendations will be the big winners from a brand loyalty perspective.<\/p>\n\n\n\n<h3><strong>Advertisers will turn to performance partners to de-risk ad spend post-COVID-19<\/strong><\/h3>\n\n\n\n<p>With the cancellation of live sports and the rapid rise of ad-free environments, marketers are reallocating ad dollars away from traditional channels and instead investing their dwindling budgets in more measurable digital channels. Unlike the years following the ’08-’09 financials crisis in which marketers adjusted their media mix from 15% digital to now over 54%, we will see far fewer overall dollars shifting from traditional to digital. Rather, this transitionary period will be marked by the shift from unmeasurable to measurable channels, resulting in a rapid acceleration of performance-based marketing programs and partnerships.<\/p>\n\n\n\n<p>In the face of economic uncertainty, advertisers need to move quickly to prioritize performance and <a aria-label=\"undefined (opens in a new tab)\" href=\"https:\/\/www.fluentco.com\/resources\/performance-marketing-partnerships\/\" target=\"_blank\" rel=\"noreferrer noopener\">de-risk ad spend<\/a>. Vanity metrics such as views and impressions are likely to fall out of favor among marketers held accountable to <a href=\"https:\/\/www.fluentco.com\/resources\/maximizing-return-on-ad-spend\/\" target=\"_blank\" aria-label=\"undefined (opens in a new tab)\" rel=\"noreferrer noopener\">driving positive ROI<\/a>. Instead, performance marketing programs that enable payment upon successful completion of a desire action will emerge as a reliable channel for driving customer acquisition, retention, and overall growth.<\/p>\n\n\n\n<p>With the shift from “lead-centric programs” to “person-centric programs,” lifetime value is becoming more important than conversions. Advertisers are looking at lead generation less as an opportunity to monetize immediately, but rather as a channel to acquire first-party data for their customer retention efforts. When paired with strong performance partnerships, a well-integrated martech stack will enable brands to collect and use consumer insights to facilitate an end-to-end marketing approach.<\/p>\n\n\n\n<p>Alignment and transparency between advertisers and their publishing partners is key to developing a strategic performance marketing program. Advertisers should be willing to share proprietary performance data to identify which customers are converting and help publishers optimize toward quality and scale. When the performance partner understands the pain points the advertiser is trying to solve inside the customer journey, they can work together to launch an acquisition solution that ultimately drives meaningful actions and long-term value.<\/p>\n\n\n\n<p><em>This article was originally published on <a href=\"https:\/\/www.clickz.com\/the-future-of-martech-what-does-the-industry-look-like-post-covid-19\/262065\/\" target=\"_blank\" aria-label=\"undefined (opens in a new tab)\" rel=\"noreferrer noopener\">ClickZ.com.<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>COVID-19 has accelerated changes in consumer behavior that were already in motion long before the pandemic began. As a result, advertisers will need to search for new ways to create streamlined shopping experiences both within and outside of the traditional retail environment. <a href=\"https:\/\/www.fluentco.com\/blog\/future-of-martech-post-covid-19\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8582,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[182,194,197],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8581"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8581"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8581\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8582"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8581"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8581"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8581"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8581"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}