{"id":8793,"date":"2020-09-08T18:49:05","date_gmt":"2020-09-08T18:49:05","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8793"},"modified":"2020-12-29T02:19:17","modified_gmt":"2020-12-29T02:19:17","slug":"customer-centricity-post-covid","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/customer-centricity-post-covid\/","title":{"rendered":"Leveraging Martech to Achieve Customer-Centricity Post-COVID"},"content":{"rendered":"\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-block-image is-style-default\"><figure class=\"alignright size-large is-resized\"><a href=\"https:\/\/www.toolbox.com\/marketing\/customer-experience\/guest-article\/leveraging-martech-to-achieve-customer-centricity-in-a-post-covid-19-world\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/09\/toolbox-logo-marketing.png\" alt=\"Marketing Toolbox Logo\n\" class=\"wp-image-8794\" width=\"345\" height=\"42\" srcset=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/09\/toolbox-logo-marketing.png 800w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/09\/toolbox-logo-marketing-300x38.png 300w, https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/09\/toolbox-logo-marketing-768x96.png 768w\" sizes=\"(max-width: 345px) 100vw, 345px\" \/><\/a><\/figure><\/div>\n<\/div><\/div>\n\n\n\n<p class=\"has-text-align-left\"><em><strong>This article was originally published on<\/strong><\/em><\/p>\n\n\n\n<p>COVID-19 has changed the ways consumers interact with brands, forcing marketers to adjust their marketing strategies and find new ways to respond to changing consumer needs. For brands striving to maintain relevance during this period, the notion of “customer-centricity” is crucial. Whereas retail stores once acted as the middlemen between CPG brands and their customers, this paradigm shift represents an exciting opportunity for non-DTC advertisers to establish direct relationships with their customers. In our post-COVID-19 world, marketers will shift their focus to the consumer, leveraging martech to deliver personalized brand messaging and establish one-to-one connections with their most valuable audiences.<\/p>\n\n\n\n<h3>Adjust Your Marketing Strategy to Reach Consumers on the Devices and Channels Where They’re Most Actively Engaged<\/h3>\n\n\n\n<p>Media consumption habits have increased across devices, with mobile projected to account for <a href=\"https:\/\/content-na1.emarketer.com\/us-time-spent-with-media-2020\" target=\"_blank\" rel=\"noreferrer noopener\">32% of total time spent with digital media<\/a> in the U.S. As brick and mortar locations reopen for business, mobile apps will be an important tool in bridging the gap between the online and in-store shopping experience. Retailers are working to optimize load times, streamline checkout, and add easy payment options to drive adoption of their mobile apps and provide added convenience at a time when consumers need it most. For consumers wary of spending too much time in-store, apps that leverage wayfinding technology will help customers find what they need and navigate stores more easily.<\/p>\n\n\n\n<p>Beyond promoting the use of their own brand apps, marketers should also tap into applications where consumers are spending most of their time. Since states began issuing stay-at-home orders in mid-March, Americans have turned to their devices as a source of entertainment. With consumers – especially Gen Z – downloading new gaming apps while in quarantine, brands should consider leveraging rewarded video and other similar ad formats that provide value to the user. As time spent with digital video also gets a boost from the COVID-19 crisis, brands should consider investing in creating <a href=\"https:\/\/www.toolbox.com\/marketing\/content-marketing\/guest-article\/why-ephemeral-video-content-helps-to-boost-engagement\/\" target=\"_blank\" rel=\"noreferrer noopener\">compelling video content<\/a> that is optimized for a vertical, mobile-viewing experience.<\/p>\n\n\n\n<h2>Leverage Consumer Insights and Location-Based Targeting to Create Personalized Brand Experiences<\/h2>\n\n\n\n<p>Now more than ever, it is important for marketers to be mindful of the unique circumstances consumers are facing while also identifying new ways to serve their changing needs. For example, with states reopening for business at differing rates across the country, a spray-and-pray approach to drive consumers back into stores will prove wasteful and ineffective. Location-based targeting will become a key priority for advertisers as they seek to deliver appropriate messaging around opportunities to shop in-store versus online during this time<\/p>\n\n\n\n<p>With more consumers shopping online, greater access to first-party consumer insights will also fuel machine learning efforts and support long-term CRM marketing initiatives. Insights into purchase decisions and down-funnel actions will be invaluable in identifying and responding to consumers’ needs no matter where they are in the customer journey. According to a <a href=\"https:\/\/chart-na1.emarketer.com\/236890\/current-vs-future-investment-personalization-efforts-according-us-b2c-marketers-march-2020-of-respondents\" target=\"_blank\" rel=\"noreferrer noopener\">recent report from Forrester<\/a> comparing current versus future investment in personalization efforts, loyalty programs and pricing will see some of the largest increases from B2C marketers as they adjust their strategy in a post-COVID-19 world. While consumer spending across categories may be down, this is a great time to launch a loyalty program to build meaningful relationships with customers and drive long-term retention.<\/p>\n\n\n\n<h2>Adopt a Performance-First Approach to Connect With Consumers and Drive Positive ROAs<\/h2>\n\n\n\n<p>With brands cutting, pausing, and shifting ad spending, measurement and tracking are becoming more important than ever in helping marketers to prove out the value of their investments. Attribution is often an issue for traditional channels like linear TV, and digital channels measured on clicks and impressions do little to reveal the actual impact of dollars spent. For advertisers seeking to drive and measure meaningful outcomes, performance marketing programs that require payment upon successful completion of a desired action will emerge as a reliable channel for driving customer acquisition and positive ROI<\/p>\n\n\n\n<p>Advertisers can leverage performance partnerships to connect with consumers during the discovery and awareness phase, when they’re making a purchase, and after the point of conversion for ongoing customer engagement. An entire ecosystem of performance-oriented, measurement platforms has emerged over the past five years, making the adoption of a performance-first approach fast and easy to implement. When paired with strong performance partnerships, a well-integrated martech stack will enable brands to collect and use consumer insights to facilitate an <a href=\"https:\/\/www.toolbox.com\/marketing\/marketing-strategy\/articles\/what-is-an-omnichannel-customer-experience-definition-journeys-and-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">omnichannel marketing<\/a> approach.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>COVID-19 has changed the ways consumers interact with brands, forcing marketers to adjust their marketing strategies and find new ways to respond to changing consumer needs. For brands striving to maintain relevance during this period, the notion of “customer-centricity” is crucial.  <a href=\"https:\/\/www.fluentco.com\/blog\/customer-centricity-post-covid\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8795,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[182,194,204],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8793"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8793"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8793\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8795"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8793"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8793"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8793"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8793"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}