{"id":8911,"date":"2020-10-12T15:42:09","date_gmt":"2020-10-12T15:42:09","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8911"},"modified":"2021-06-15T12:05:15","modified_gmt":"2021-06-15T16:05:15","slug":"limitations-of-first-and-third-party-cookies","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/limitations-of-first-and-third-party-cookies\/","title":{"rendered":"Limitations of First- and Third-Party Cookies for Modern Marketers"},"content":{"rendered":"\n<p>In our new <strong><em>“Data Dive” <\/em><\/strong>blog&nbsp;series, we’ll explore our&nbsp;evolving&nbsp;data landscape&nbsp;and what brands, tech vendors, and&nbsp;data providers are doing to address the operational and strategic shifts taking place.&nbsp;This series will cover the demise of third-party cookies,&nbsp;what to expect&nbsp;for the future of addressability, and&nbsp;how brands can&nbsp;activate&nbsp;first-party, deterministic insights&nbsp;to reach consumers&nbsp;across channels.&nbsp;If you&nbsp;want to&nbsp;learn how Fluent can help your brand navigate this new era of online advertising,&nbsp;connect with our team&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.fluentco.com\/lets-talk\/\" target=\"_blank\">here<\/a>.&nbsp;&nbsp;<\/p>\n\n\n\n<h2><strong>Third-Party Cookies Lose in the Battle to Protect Consumer Privacy<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Mounting concerns around consumer privacy are driving an industry-wide push away from the use of third-party cookies. Growing increasingly distrustful of data collection practices, consumers want more transparency and control over which entities can use the information collected during their internet activities. According to the <a href=\"https:\/\/www.pewresearch.org\/internet\/2019\/11\/15\/americans-and-privacy-concerned-confused-and-feeling-lack-of-control-over-their-personal-information\/\" target=\"_blank\" rel=\"noreferrer noopener\">Pew Research Center<\/a>, 79% of U.S. adults say they are concerned with how companies use their data, while 59% have very little or no understanding of what companies do with their information.<\/p>\n\n\n\n<p>While policy changes like GDPR and CCPA have accelerated efforts to protect consumer privacy, Google’s plan to eliminate third-party cookies by 2022 has officially put the entire ad industry on notice. With essentially all browser traffic soon either disabling or limiting third-party cookies, the industry will need to find a new currency to facilitate targeting, frequency capping, and attribution in our changing digital ecosystem.<\/p>\n\n\n\n<h3><strong>First- v<\/strong><strong>s<\/strong><strong>. Third-Party Cookies<\/strong>&nbsp;<\/h3>\n\n\n\n<p>While Google is currently planning to phase out the third-party cookie on its browsers, first-party cookies are still safe – though not without their own limitations. At its core, a cookie is a piece of code that is created by a server and saved on a user’s device. Below we explore the differences between first- and third-party cookies, and the challenges associated with each type.<\/p>\n\n\n\n<h4>What&nbsp;Are First-Party Cookies?&nbsp;<\/h4>\n\n\n\n<p>First-party cookies are&nbsp;created by the domain the user is visiting&nbsp;and stored on their&nbsp;computer by default.&nbsp;They allow website owners to collect analytics data, remember language settings and passwords, and perform other useful functions that create a positive user experience.&nbsp;For advertisers, first-party cookies are especially useful for&nbsp;tracking&nbsp;what people do on their site &#8212; i.e. what pages they visited,&nbsp;how much times they spent –&nbsp;in order to&nbsp;develop effective marketing strategies around&nbsp;their&nbsp;behavior&nbsp;and preferences.&nbsp;<\/p>\n\n\n\n<h4>Challenges of First-Party Cookies&nbsp;<\/h4>\n\n\n\n<p>While first-party&nbsp;cookies are useful for tracking user&nbsp;behavior&nbsp;across proprietary&nbsp;properties, they do not allow website owners to&nbsp;see data related to&nbsp;their&nbsp;visitor&#8217;s behavior&nbsp;on&nbsp;other&nbsp;domains.&nbsp;As a result, advertisers cannot leverage first-party cookies to create omnichannel marketing strategies that span across channels and devices.&nbsp;Cue to the third-party cookie.&nbsp;&nbsp;<\/p>\n\n\n\n<h4>What Are Third-Party Cookies?&nbsp;<\/h4>\n\n\n\n<p>&nbsp;Third-party cookies are created by domains outside those the user is visiting directly and must be accepted manually. Whereas a first-party cookie is only accessible via the domain that created it, third-party cookies are accessible on any website that loads the third-party server’s code. Third-party cookies enable advertisers to understand their users’ online behavior across different websites, helping them to build robust user profiles and lookalike audiences based on their most valuable customers.<\/p>\n\n\n\n<h4>Challenges of Third-Party Cookies&nbsp;<\/h4>\n\n\n\n<p>Third-party cookies are useful for cross-site tracking, retargeting, and ad-serving – all the sophisticated tracking and targeting capabilities that make up a savvy advertiser’s marketing toolbox. Yet while it is in a user’s best interest not to block or delete first-party cookies, many consumers delete their third-party cookies on a regular basis due to data privacy concerns and distrust of advertising practices. As browser support for third-party cookies continues to decline, advertisers that rely on third-party data for their audience-targeting strategy will need to consider alternative first-party data sources to support their marketing efforts.<\/p>\n\n\n\n<h3><strong>Preparing for a World Without Third-Party Cookies<\/strong>&nbsp;<\/h3>\n\n\n\n<p>While the rollout of CCPA and ongoing browser crackdowns will inevitably push more ad dollars to walled gardens, there is still hope for the future of addressability on the open web. In the next two years,&nbsp;options like universal IDs and translation services will be evaluated&nbsp;across all devices and domains as buyers and sellers work to create a unified, privacy-safe ecosystem. In attempt to balance the needs for user privacy with the interests of advertisers and publishers, the challenge will be standardizing something that works across channels.&nbsp;<\/p>\n\n\n\n<h4>What Does a Post-Cookie World Look Like for Tech and Data Vendors?&nbsp;<\/h4>\n\n\n\n<p>Initiatives like Google’s&nbsp;<a href=\"https:\/\/blog.google\/products\/chrome\/building-a-more-private-web\/\" target=\"_blank\" rel=\"noreferrer noopener\">Privacy Sandbox<\/a>&nbsp;and the IAB’s&nbsp;<a href=\"https:\/\/www.iab.com\/blog\/project-rearc-an-industry-collaboration-to-rearchitect-digital-marketing\/\" target=\"_blank\" rel=\"noreferrer noopener\">Project Rearc<\/a>&nbsp;are encouraging&nbsp;cross-industry&nbsp;collaboration in&nbsp;pursuit of&nbsp;solutions&nbsp;that will not only keep&nbsp;the&nbsp;digital ad ecosystem&nbsp;afloat, but&nbsp;also&nbsp;improve&nbsp;it.&nbsp;Universal identifiers&nbsp;present one option, but&nbsp;they&nbsp;leave&nbsp;control&nbsp;with&nbsp;browsers and&nbsp;operating systems&nbsp;and&nbsp;can&nbsp;often&nbsp;lead to more challenges&nbsp;– like&nbsp;when we saw&nbsp;Firefox reject&nbsp;DigiTrust’s&nbsp;universal ID, or more recently, Apple’s crippling changes to IDFA. The most likely and realistic option would be the&nbsp;move to an identity-based identifier that&nbsp;is sourced from&nbsp;first-party,&nbsp;<a href=\"https:\/\/www.fluentco.com\/resources\/advanced-tv-targeting\/\" target=\"_blank\" rel=\"noreferrer noopener\">deterministic data<\/a>&nbsp;and&nbsp;tied to privacy preferences&nbsp;&#8212; more on this later in our series.&nbsp;<\/p>\n\n\n\n<h4>What Does a Post-Cookie World&nbsp;Look Like&nbsp;for Advertisers?&nbsp;&nbsp;<\/h4>\n\n\n\n<p>As data-privacy regulations and a lack of transparency continue&nbsp;to&nbsp;muddy the reputation of third-party data, marketers are recognizing the importance&nbsp;of&nbsp;leveraging&nbsp;their own first-party&nbsp;insights&nbsp;to deliver&nbsp;personalized and relevant experiences to their target customers.&nbsp;Moving forward, advertisers must focus on a privacy-safe approach to data collection and identity management as they seek out reliable alternatives to third-party cookies in the changing digital ecosystem.&nbsp;<\/p>\n\n\n\n<p><strong><em>Stay tuned for our next blog where we’ll explore this shift in mindset among brand marketers as they take greater ownership of their data assets and work toward building one-to-one connections with consumers.<\/em><\/strong><\/p>\n\n\n\n<hr class=\"wp-block-separator is-style-dots\"\/>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h4>Want to learn how Fluent can help your business prepare for the loss of third-party cookies? Connect with us below.<\/h4>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<!--[if lte IE 8]>\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2-legacy.js\"><\/script>\n<![endif]-->\n<script charset=\"utf-8\" type=\"text\/javascript\" src=\"\/\/js.hsforms.net\/forms\/v2.js\"><\/script>\n<script>\n  hbspt.forms.create({\n\tportalId: \"455243\",\n\tformId: \"6b9d2cdc-c11f-44b6-bb5e-b5248e441aed\"\n});\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>With essentially all browser traffic soon either disabling or limiting third-party cookies, the industry will need to find a new currency to facilitate targeting, frequency capping, and attribution in our changing digital ecosystem. <a href=\"https:\/\/www.fluentco.com\/blog\/limitations-of-first-and-third-party-cookies\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8913,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[172,212],"blog_category":[136],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8911"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8911"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8911\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8913"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8911"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8911"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8911"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8911"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}