{"id":8994,"date":"2020-11-13T23:46:33","date_gmt":"2020-11-13T23:46:33","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8994"},"modified":"2020-12-29T02:19:17","modified_gmt":"2020-12-29T02:19:17","slug":"3-marketing-lessons-learned-quibi","status":"publish","type":"post","link":"https:\/\/www.fluentco.com\/blog\/3-marketing-lessons-learned-quibi\/","title":{"rendered":"3 Marketing Lessons Learned From The Rise And Fall Of Quibi"},"content":{"rendered":"\n<p><em><strong>This article was originally published on <a href=\"https:\/\/www.mediapost.com\/publications\/article\/357472\/marketing-lessons-learned-from-the-rise-and-fall-o.html?edition=120315\" target=\"_blank\" rel=\"noreferrer noopener\">MediaPost<\/a>.<\/strong><\/em><\/p>\n\n\n\n<p>On Comcast’s third-quarter earnings call, NBCUniversal CEO Jeff Shell described the company’s new Peacock streaming service as “the opposite of Quibi,” citing its deep library of familiar content and it’s nearly 22 million sign-ups to date as the key differences.<\/p>\n\n\n\n<p>Yet the truth is, while the mobile video platform had its fair share of shortcomings, content was not one of them. Quibi’s programing was solid and it had top talent on board, making its content assets an attractive buy for up-and-coming streaming services looking to differentiate their offering in market.<\/p>\n\n\n\n<p>Timing has also been named as a possible obstacle, considering that Quibi &#8211; the short-form video platform for “people on the go” &#8211; was launched during a pandemic that forced people to stay home. Yet with <a href=\"https:\/\/fluentpulse.com\/covid-19-streaming-and-video\/\" target=\"_blank\" rel=\"noreferrer noopener\">34% of Americans streaming more content<\/a> than normal during quarantine and <a href=\"https:\/\/fluentpulse.com\/covid-19-streaming-and-video\/\" target=\"_blank\" rel=\"noreferrer noopener\">17% subscribing to one or more new streaming services<\/a> since stay-at-home orders took effect in mid-March, the lockdowns should have served as an opportunity, rather than a hindrance, for the platform.<\/p>\n\n\n\n<p>Attempting to find its footing amidst the release of a wave of new streaming services, Quibi could not keep up with the likes of Peacock and HBO Max. In a saturated market where consumer attention is a top commodity, Quibi was painfully out of touch with its digitally native audience &#8211; from the features they value in a content platform to the channels where they’re most receptive to brand messaging. <\/p>\n\n\n\n<h2 class=\"has-medium-font-size\"><strong>Take a Mobile-First Approach<\/strong><\/h2>\n\n\n\n<p>Fierce competition in the streaming services space continues to drive up ad spend, making the channels where those dollars are deployed more important than ever. As a service designed to be enjoyed on mobile, Quibi approached a digitally born channel using old-school tactics. It spent $40.8 million on TV ads in the first half of 2020, yet users could only access Quibi content on their mobile device at the time of its launch. This disconnect undoubtedly created confusion among consumers already facing a paradox of choice in the crowded streaming services space.<\/p>\n\n\n\n<p>Savvy digital marketers, especially those in the mobile app community, know that the key to successful user growth starts with a mobile-first strategy, hyper-focused on tangible metrics– a secret Quibi executives seem to have missed, as their app was notably missing from any “top downloads” app store lists since launch. Rather than funneling its ad budget into brand awareness campaigns across TV and print, Quibi should have focused on driving measurable outcomes via a targeted user acquisition strategy within the mobile app ecosystem.<\/p>\n\n\n\n<h2 class=\"has-medium-font-size\"><strong>Know Your Audience<\/strong><\/h2>\n\n\n\n<p>Quibi’s heavy emphasis on the wrong advertising channels also indicates a fundamental lack of understanding of its target audience. Most streaming services do not have time to play the dated cost-per-impression spray-and-pray game that prioritizes scale over quality. Rather than going mass-market with splashy TV ads during the Oscars and Super Bowl, Quibi should have focused on targeting consumers who were already consuming video content via their mobile device.<\/p>\n\n\n\n<p>According to a study commissioned by Snap, Gen Z and millennials are driving growth in mobile video usage, with <a href=\"https:\/\/forbusiness.snapchat.com\/blog\/us-2020-vision-for-mobile-video?preview=true\" target=\"_blank\" rel=\"noreferrer noopener\">73% of young consumers watching more video<\/a> on their smartphones this year than in 2019. Preferring short videos to full-length TV shows, Gen Z and millennials have an active interest in short-form premium content &#8212; making them the perfect audience for Quibi’s snackable video format.<\/p>\n\n\n\n<p>While in many ways a platform like TikTok was Quibi’s real competitor in the short-form video arena, Quibi failed to take obvious cues from the Chinese-owned app and the massive online community it has created. Social sharing features and the ability to take screenshots &#8212; factors that have made TikTok so sticky among its users&#8211; were noticeably missing from the Quibi platform.<\/p>\n\n\n\n<p>Quibi’s failure to resonate with Gen Z and millennial audiences represents a missed opportunity to grow a strong user base and ultimately keep its service afloat. While Quibi’s content was solid, the clunky user experience and antisocial nature of the platform did not appeal to its target demographic. For any new business seeking a product-market fit, it’s important to listen to consumers’ needs and incorporate the features proven to keep them actively engaged.<\/p>\n\n\n\n<h2 class=\"has-medium-font-size\"><strong>Diversify Your Acquisition Strategy<\/strong><\/h2>\n\n\n\n<p>Quibi spent a fortune on TV and traditional digital channels while overlooking the power of performance partnerships and affiliate marketing. Alignment and transparency between advertisers and publishers help to unlock evergreen performance marketing programs that drive meaningful down-funnel actions. For streaming platforms seeking to drive installs and convert free trial users to paid subscribers, leveraging alternative acquisition channels is the key to reaching incremental audiences and ultimately building a loyal subscriber base.<\/p>\n\n\n\n<p>By aligning with marketing partners that offer access to first-party consumer insights, streaming service companies can identify users with a high intent to subscribe. From there, an accurate lifetime value prediction model is key to creating a sophisticated targeting and pricing strategy around their highest-performing audience segments.<\/p>\n\n\n\n<p>Partners that deliver qualified audiences on a pay-for-performance pricing model will become the obvious choice for growth-minded streaming providers looking to win in the crowded streaming services space. While Quibi clearly missed the mark, there may still be room for a mobile-first streaming platform that leverages performance partnerships to connect engaged audiences with the right content and UX.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In a saturated market where consumer attention is a top commodity, Quibi was painfully out of touch with its digitally-native audience &#8211; from the features they value in a content platform to the channels where they’re most receptive to brand messaging.  <a href=\"https:\/\/www.fluentco.com\/blog\/3-marketing-lessons-learned-quibi\/\">Read More<\/a><\/p>\n","protected":false},"author":6,"featured_media":8995,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[],"tags":[140,141,187],"blog_category":[134],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8994"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=8994"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/posts\/8994\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8995"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8994"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8994"},{"taxonomy":"blog_category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/blog_category?post=8994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}