{"id":10166,"date":"2021-01-06T19:08:57","date_gmt":"2021-01-06T23:08:57","guid":{"rendered":"https:\/\/www.fluentco.com\/?page_id=10166"},"modified":"2021-08-04T13:38:17","modified_gmt":"2021-08-04T17:38:17","slug":"privacy-policy-consumer-facing-product-service-websites","status":"publish","type":"page","link":"https:\/\/www.fluentco.com\/privacy-policy-consumer-facing-product-service-websites\/","title":{"rendered":"Privacy Policy for Fluent’s Consumer Facing Product and Service Websites"},"content":{"rendered":"\n<p><em>Last updated 7.30.2021<\/em><\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Fluent, LLC &nbsp;and its subsidiaries ( “we,” “our,” or “us”) provide the following Privacy Policy (&#8220;Privacy Policy” or “Policy&#8221;), which sets forth our practices related to the collection, use, disclosure, and sale of information that is personally-identifiable to a user (“PII”), as well as information that is not personally-identifiable (“non-PII”). For purposes of this Policy, PII and non-PII will be referred to collectively as “Information.”<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>ACCEPTANCE OF PRIVACY POLICY<\/strong><\/strong><\/p>\n\n\n\n<p>By accessing and using one of our consumer facing websites which offer a variety of goods and services and content and (collectively, the “Websites” and individually, a “Website”) that we own and operate, you signify your acceptance of this Privacy Policy and your agreement to the collection, use, disclosure, and sale of your Information as described herein.&nbsp;<strong>If you do not intend to agree to the terms of this Privacy Policy, DO NOT use the Websites.&nbsp;<\/strong>As set out below, the Privacy Policy is subject to change. Your continued use of the Websites following the posting of changes to these terms will confirm your acceptance of all changes made except for changes which expand the use of your Information where we will notify users by: (a) sending the modified Policy to our users via email or (b) any other reasonable means acceptable under applicable state and federal law.&nbsp;&nbsp;<strong>Please note if you are not a U.S. resident, you are not permitted to use the Websites and\/or otherwise access any other offerings.<\/strong><\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>NOTICE OF COLLECTION OF PERSONAL INFORMATION<\/strong><\/strong><\/p>\n\n\n\n<p>This Policy provides notice to users, including those who are California residents and fall within the definition of “consumers” as provided for in the California Consumer Privacy Act of 2018 (“CCPA”), that we collect Information. As required by the CCPA, the following sections of the Policy also detail the categories and sources of Information collected and the business and commercial purposes for the collected Information. We also include a description of rights afforded to California consumers at “RIGHTS OF CALIFORNIA USERS WITH REGARD TO THEIR INFORMATION”, including rights to know the Information we have collected and sold, the right to opt-out from the sale of Information, and the right to deletion.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>TYPES\/CATEGORIES OF INFORMATION WE MAY COLLECT REGARDING USERS<\/strong><\/strong><\/p>\n\n\n\n<p>Here are the types and categories of Information that we may collect regarding users (see below for additional descriptions of the categories of Information collected that are provided to California residents):<\/p>\n\n\n\n<p>Information that could reasonably identify a user, such as name, postal address, email address(es), mobile\/landline phone number(s), date of birth, and gender;<\/p>\n\n\n\n<ul><li>Information collected from a user’s responses to survey questions, including preferences, products and services of interest, personal attributes such as marital status, home or auto ownership, political affiliation, views on various issues, and responses to wellness questions, as further described below;<\/li><li>Information collected from our web server log files, including device type(s), user agent data, referring URL(s), and IP address(es);<\/li><li>Information collected from third parties or parties under common control (which includes our parent, subsidiaries, and other entities under common control with us &#8211; collectively &#8220;Related Parties&#8221;) to validate and augment a user’s profile including a user’s email address, postal address, telephone number, device ID, or other user Information.<\/li><li>Information collected from our Welcome Center (an affiliated call center),&nbsp;customer support department and fulfillment vendors, including customer support inquiries, claims related to “Rewards” (cash or merchandise provided to users of our rewards Websites) and emails and, as needed, proof of identification and completion of Reward requirements;<\/li><li>Information relating to a user’s interaction with telemarketing calls, SMS messaging, push notifications, commercial email, and other forms of communication;<\/li><li>Information collected by third parties regarding users&#8217; interaction with our Site which may include the creation of a report and visual playback of the user responding&nbsp;to one or more survey questions and the interacting with the page that seeks to obtain a user&#8217;s “prior express written consent” (as defined in the Telephone Consumer Protection Act (“TCPA”)to receive telemarketing and text messages; and<\/li><li>Information collected from Cookies (as defined below), including whether a user has previously visited the Website or has opened an email sent by a Related Party ( a party owned by us or a party under common control with us) or one of our third-party marketing partners (together, “Marketing Partners”).&nbsp;<\/li><\/ul>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>HOW WE COLLECT INFORMATION &#8211; SOURCES<\/strong><\/strong><\/p>\n\n\n\n<p>We collect Information from and about users (see below for additional descriptions of the methods of Information collection that are provided to California residents) from the following sources:<\/p>\n\n\n\n<ul><li>Registration forms and surveys;<\/li><li>Emails, telephone calls, USPS mail, and other contacts received from users as part of customer service;<\/li><li>Publicly availably sources, such as Internet search engines;<\/li><li>Our hosting servers, which collect Information from users through various technological means when users access and interact with the Websites;<\/li><li>Third parties (including service providers) who assist us in hosting the Websites, providing customer support, and fulfillment;<\/li><li>Our Marketing Partners and third-party publishers, who may (a) send emails, push notifications, or SMS messages or make telemarketing calls to users, (b) drive users to the Websites, and\/or (c) advertise goods and services on the Websites; and<\/li><li>Cookies (small text files placed on a user’s computer that track online behavior), web beacons (single-pixel GIF image files), and other technological means (collectively, “Cookies”).&nbsp;<\/li><\/ul>\n\n\n\n<p>We may combine Information collected from various sources to augment and verify Information to improve the overall quality of the Website experience.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>HOW WE MAY USE INFORMATION<\/strong><\/strong><\/p>\n\n\n\n<p>We may use Information in many ways and for many purposes, including the following (see below for additional descriptions of Information uses that are provided to California residents):<\/p>\n\n\n\n<ul><li>For Website operations, content improvements, testing, research, analysis, and product development;<\/li><li>To verify whether users are entitled to participate in the product or service and, if so, to facilitate the fulfillment of our responsibilities to the user;<\/li><li>To provide users with customer service and respond to customer inquiries;<\/li><li>To provide users with email, direct mail, and telemarketing messages concerning certain of our products and\/or services, as well as third-party products and\/or services, that we believe may be of interest to you;<\/li><li>To provide users with email alerts, text\/SMS message alerts, and other communications that users have requested or consented to receive or that we are required to send concerning users’ registrations, our products or services, or other information;<\/li><li>To carry out our obligations and enforce our rights arising from any contracts entered into between users and us, including for purposes of our Arbitration Agreement and any inquiry specific to express written consent under the Telemarketing Sales Rule (“TSR”) and\/or the TCPA (“TCPA Consent”);<\/li><li>To detect, investigate, and respond to any fraudulent or malicious activity or any other activity we determine is or may be a violation of one of our&nbsp;Website’s Terms and Conditions, this Policy, or existing laws, rules, and regulations;<\/li><li>As necessary or appropriate to protect the rights, property, and\/or safety of us and our Marketing Partners, service providers, and Related Parties;<\/li><li>As described to you when collecting Information or as otherwise set forth in any applicable consumer protection, state or federal privacy, or data security laws;<\/li><li>To maintain suppression or opt-out lists so that users are not contacted when they have asked not to be;<\/li><li>To augment Information by enhancing it with other data sources provided by third parties and Related Parties to enable us, for example, to gain deeper insights into our users; and<\/li><li>To respond to subpoenas, court orders, or legal process, or to establish or exercise our legal rights or defend against legal claims, or when we determine it is necessary to comply with applicable laws and\/or regulations.&nbsp;&nbsp;<\/li><\/ul>\n\n\n\n<p>We may share Information with applicable third party(ies) as necessary if we become the subject of bankruptcy proceedings, or in connection with the sale, assignment, merger, or other transfer of all or a portion of our business. If we are involved in any of these transactions, we will notify users via email or a Policy update on the Website regarding any material details pertaining to Information.&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>HOW WE MAY DISCLOSE AND\/OR SELL INFORMATION<\/strong><\/strong><\/p>\n\n\n\n<p>We may share and\/or sell Information with our vendors, Marketing Partners, or other third party(ies). For example, we may disclose and\/or sell information including: (see below for a description of the augmented rights that California residents have with respect to opting-out of the sale of their Information):<\/p>\n\n\n\n<ul><li>With our vendors, service providers, and\/or Marketing Partners in connection with marketing activities, including the delivery of email messaging, telemarketing calls, text\/SMS messaging, and push notifications to users, provided that we have obtained TCPA Consent from such users to be contacted by telephone or text\/SMS messaging;<\/li><li>With our interest-based Marketing Partners to create anonymized sets of Information which are made available for use by third-party Marketing Partners for programmatic advertising purposes;<\/li><li>With our Related Parties to augment and verify the Information we collect and to develop and enhance their products and services;<\/li><li>With one or more vendors who provide independent verification of consent, including verification of consent for purposes of the TSR and TCPA;<\/li><li>To enable third parties, including our Marketing Partners and data and list management partners, to market products and services to you;<\/li><li>To enable customer service vendors to perform their respective tasks, including for fulfillment of our responsibilities to users;<\/li><li>To enable our Information verification and fraud detection vendors to perform contracted-for services; and<\/li><li>To submit users’ contact information to comment and petition campaigns run by governmental agencies, elected officials, or other parties where users have provided their express consent to endorse and be a part of the campaign including, in some instances, appending the user contact information with specific comment language.&nbsp;<\/li><\/ul>\n\n\n\n<p>When we share and\/or sell Information, we enter into agreements that describe the purpose for which the Information is shared\/sold, restrict its use to the agreement’s specified purpose, and require that all Information remain confidential and be protected from unauthorized disclosure.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong>MINORS AND NON-US RESIDENTS<\/strong><\/strong><\/p>\n\n\n\n<p>The Websites are designed to comply with the Children&#8217;s Online Privacy Protection Act (“COPPA”). COPPA requires that website operators not knowingly collect PII from anyone under the age of 13 without prior verifiable parental consent. In compliance with COPPA, we do not knowingly collect or retain information from the Website from children under the age of 13 and may only collect a limited amount of Information from users who are between the ages of 13 and 18. We do not sell the Information of users who are under eighteen (18) years of age.&nbsp;&nbsp;<br><br>The Websites are intended for use only by U.S. residents and the respective Website’s Terms and Conditions&nbsp;limit the use of the Websites to U.S. residents and instruct others not to utilize the Websites.&nbsp;&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong><strong><strong>COOKIES, INTEREST-BASED ADVERTISING, AND THIRD-PARTY ANALYTICS<\/strong><\/strong><\/strong><\/p>\n\n\n\n<p>Our websites use Cookies to determine whether users have previously visited the Website and to streamline the registration process. Although we don’t use Cookies for other purposes, some of our third-party Marketing Partners may place Cookies on the Websites to track users’ online behavior while on the Websites and after they leave the Websites. These third-party Cookies may enable the delivery of interest-based advertisements (to find out more about Cookies, visit&nbsp;<a href=\"https:\/\/www.networkadvertising.org\/understanding-online-advertising\/glossary\/\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/www.networkadvertising.org\/understanding-online-advertising\/glossary\/<\/a> based on a user’s visit to the Websites and\/or other websites. In addition, our Marketing Partners use Information gathered in this manner to recognize users across different channels and platforms, including computers, mobile devices, and Smart TVs. Our Marketing Partners may use this information over time for advertising, analytics, attribution, and reporting purposes. For additional information about the health-related, political, and related custom data segments used for advertising, please click here.<\/p>\n\n\n\n<p>We may use Google Analytics and similar tools provided by our third-party partners to help analyze how users interact with the Websites and to display customized ads and other content to our users during a current browsing session or in the future when the user is online. These analytics are performed by using the technological means described above to monitor a user’s interactions with the Websites and do not involve the collection of any additional PII.<br><br>Most computers are initially set up to accept Cookies, but users can reset their Internet browsers to refuse all Cookies or to indicate when a Cookie is being sent. To disable and reject certain Cookies, follow the instructions associated with your Internet browser. Even where you reject a Cookie, you may still use the Website but your ability to use certain features or offerings may be impaired. For example, if you return to the Website, you may have to re-enter Information you previously supplied to us. We may retain Cookie data indefinitely.<br><br>Users may opt-out from interest-based advertising delivered to their web browser by companies who have elected to participate in one of the interest-based advertising opt-out mechanisms such as the Digital Adverting Alliance’s opt-out program located&nbsp;<a href=\"https:\/\/optout.aboutads.info\/?c=2&amp;lang=EN\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>&nbsp;or the National Advertising Institute’s opt-out program located&nbsp;<a href=\"https:\/\/optout.aboutads.info\/?c=2&amp;lang=EN\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.&nbsp; Users may also choose to opt-out of interest-based advertising on their mobile devices. For more information, please click&nbsp;<a href=\"https:\/\/www.networkadvertising.org\/mobile-choice\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.&nbsp; &nbsp;<\/p>\n\n\n\n<p>Please note that opting out of interest-based advertising does not mean you will no longer see advertising online. Rather, it means that the company or companies from which you opt-out will no longer show ads that have been tailored to your interests.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>OPTING-OUT FROM MARKETING<\/strong><br><br>Users may opt-out from receiving future contact from us.<\/p>\n\n\n\n<ul><li>To opt-out from email marketing and to remove your anonymized data from programmatic advertising, click the “Unsubscribe” link on the bottom of every page or click <a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>;<\/li><\/ul>\n\n\n\n<ul><li>Providing TCPA Consent is not required to utilize any of our products and services. You may continue to use all other aspects of the Websites, regardless of whether you elect to provide TCPA Consent. Users who elected to provide TCPA Consent but later wish to revoke it can opt out from future telemarketing calls by following prompts to stop individual telemarketing calls on recorded calls, by informing calling parties that they wish to be placed on their do not call list, or by contacting, as appropriate, the Marketing Partner(s) or our customer service team <a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.;<\/li><li>To revoke consent for, or opt-out from, SMS\/text messaging, reply STOP to text\/SMS messages received or contact customer service <a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>;<\/li><li>To opt-out of browser-based push notifications, disable the notifications at the time you receive the notification or disable notifications through your browser’s settings; and<\/li><li>To-opt out of Cookies, interest-based advertising and\/or third-party analytics, see the section above.<\/li><\/ul>\n\n\n\n<p>In addition and as described below, residents of California (and, in certain circumstances, residents of Nevada) have the right to opt-out of the sale of their Information.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>ACCESSING, CORRECTING, AND DELETING YOUR INFORMATION<\/strong><br><br>We may use Information provided by users for the purposes disclosed in this Privacy Policy until a user requests that their Information be modified, deleted, or corrected. All users who provide Information to us may request that we modify, delete, and\/or correct their Information by contacting us&nbsp;<a href=\"mailto:privacy@fluentco.com\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>&nbsp;(see below for a description of the augmented rights with respect to accessing and deleting Information that are provided to California residents). We will respond to user requests within 45 days. If you request deletion of your Information, please note that your Information will be suppressed from further use as described in this Policy. However, please remember that if we have shared your information with our third-party Marketing Partners, you will need to contact those Marketing Partners individually to have them suppress or delete your personal information. Note that we may retain and use your Information as necessary to comply with our policies including legal obligations, dispute resolution, and enforcement of our agreements.<br><br>We ask individual users to identify themselves and the Information requested to be accessed, corrected, or deleted (suppressed) before processing such requests and, to the extent permitted by applicable law, we may decline to process requests that we are unable to verify, are unreasonably repetitive or systematic, require disproportionate technical effort, jeopardize the privacy of others, or would be extremely impractical (for instance, requests concerning Information residing on archive servers).<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>HEALTH AND WELLNESS INFORMATION<\/strong><br><br>Our surveys may ask health and wellness-related questions. We may share your responses with our third-party Marketing Partners who advertise health and wellness-related products and services on the Websites, or who otherwise promote health and wellness-related products or services. We may also use this Information to display offers for health and wellness-related products and services to you. With your consent, we may provide Information to these providers so they can contact you. If you do not wish to share health and wellness-related Information, do not answer the health and wellness-related survey questions and do not provide TCPA Consent.&nbsp;&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>FINANCIAL AND EMPLOYMENT INFORMATION<\/strong><br><br>Our surveys may ask questions related to your financial and\/or employment status. We may share your responses with our third-party Marketing Partners who advertise finance and\/or job-related products and services on the Websites, or who otherwise promote finance and\/or job related products or services. We may also use this Information to display offers for finance and\/or job-related products and services to you. With your consent, we may provide this Information to providers so they can contact you. If you do not wish to share this Information, do not answer the finance and\/or job related survey questions and do not provide&nbsp;TCPA Consent.&nbsp;&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>MEDICARE SUPPLEMENT PLANS DISCLOSURE<\/strong><\/p>\n\n\n\n<p>Some of our Marketing Partners offer Medicare Supplement plans. Medicare Supplement plans are not connected with or endorsed by the U.S. Government or the Federal Medicare program. Our Marketing Partners have confirmed to us that all related optional marketing offers and deals on the Websites comply with applicable Federal civil rights laws and do not discriminate on the basis of race, color, national origin, age, disability, or sex. With your consent, we may provide information to Medicare Supplement providers so they can contact you. If you do not wish us to share your Information, do not provide TCPA Consent.&nbsp;&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>THIRD-PARTY SITES<\/strong><\/p>\n\n\n\n<p>Our Websites contain links to other websites or services. When you link from the Websites to a third-party site, for example, when you link from a survey question, optional marketing offer, or Deal advertisement to another site, you are leaving the Website and are subject to the privacy policies and terms and conditions of those sites – NOT this Privacy Policy. We are not responsible for the privacy practices, content, or security of such third-party sites.&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>SECURITY OF YOUR INFORMATION<\/strong><br><br>We use commercially reasonable efforts to prevent unauthorized access, disclosure, or accidental loss or destruction of your Information. Access to your Information is strictly limited and we take reasonable measures to ensure that your Information is not accessible to the public. We restrict access to users’ Information to only those persons who need access to perform or provide their job or service, both internally and with our third-party service providers.<\/p>\n\n\n\n<p>As part of our Rewards fulfillment requirements, users will be asked to verify their identification by scanning or uploading a clear photo of an unexpired, government-issued ID. The ID verification process is operated through our third-party vendor, Veratad. Submission of your ID via a secure process is encrypted end-to-end, and user &nbsp;information will only be used for purposes of ID verification.&nbsp;&nbsp;<\/p>\n\n\n\n<p>We do not otherwise generally collect sensitive Information such as medical information, health insurance information, data collected from an automated license plate recognition system, Social Security Number, and credit card information. If and when we do collect, store, and transmit sensitive information, that Information will be encrypted with advanced TLS (Transport Layer Security).&nbsp;&nbsp;<\/p>\n\n\n\n<p>While we have endeavored to create secure and reliable Websites for users, we are not able to fully eliminate security risks associated with Information. Given the nature of the Internet, your Information passes through entities that we are unable to control. Therefore, we cannot guarantee that our security measures or those of third parties who access or transmit your Information will prevent your Information from being improperly accessed, stolen, or altered. In compliance with applicable federal and state laws, we shall notify you and any applicable regulatory agencies if we learn of an information security breach of your Information. You will be notified via email in the event of such a breach. Please be advised that notice may be delayed in order to address the needs of law enforcement, determine the scope of network damage, and to engage in remedial measures.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>CALIFORNIA NOTICE REGARDING CATEGORIES, SOURCES AND BUSINESS AND COMMERCIAL USES OF INFORMATION<\/strong><\/p>\n\n\n\n<p>The following chart contains the categories of information, as enumerated in CCPA Sec. 1798.140(o), of Information we collect, use, disclose and sell, the sources of the Information and our business and commercial uses of such Information:<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><strong>Category<\/strong><\/td><td><strong>Category Name\/Description<\/strong><\/td><td><strong>1. Sources<\/strong><\/td><td><strong>2. Business Use<\/strong><\/td><td><strong>3. Commercial Use<\/strong><\/td><\/tr><tr><td>A<\/td><td>Identifiers &#8211; name, postal, email and IP address, telephone number<\/td><td>User provided on registration, customer service inquiries, and claim forms; related and 3rd party sources to verify and\/or augment user supplied information<\/td><td>Operational purposes including determining survey questions, optional marketing offers, and Deals to be displayed; customer service; fraud and security incidence detection; pre-population of user forms; website improvement&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/td><td>Sold to third parties for marketing purposes; shared with third parties to determine Deals to be offered and to pre-populate order forms<\/td><\/tr><tr><td>B<\/td><td>Personal information categories listed in the California Customer Records statute – Identifiers and education, employment, medical, and health information&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/td><td>As above, plus user responses to survey questions<\/td><td>Same as 2. A&nbsp;<\/td><td>Same as 3. A and to target sales of Information to third parties<\/td><\/tr><tr><td>C<\/td><td>Protected classification characteristics under California or federal law &#8211; Age, marital status, medical condition, physical or mental disability, sex, and related medical conditions<\/td><td>Same as 1. B&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<\/td><td>Same as 2. A<\/td><td>Same as 3. B<\/td><\/tr><tr><td>D<\/td><td>Commercial information &#8211; products or services purchased, obtained, or considered, or other purchasing data<\/td><td>User provided customer service inquires and claim forms, from 3rd party advertisers and system collected website activity logs<\/td><td>Same as 2. A and to determine entitlement to Rewards and amounts owed by advertisers and data purchasers<\/td><td>Determine amounts owed by advertisers and data buyers and performance of data campaigns<\/td><\/tr><tr><td>E<\/td><td>Internet or similar network activity -browsing and search history, information on a consumer&#8217;s interaction with a website, application, or advertisement&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/td><td>System collected activity logs and cookies<\/td><td>Same as 2. A and to determine (i) whether user is a repeat visitor; (ii) performance of and amounts owed to paid media suppliers; and (iii) support proof of user consent for email marketing and TCPA purposes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/td><td>Same as 3. D<\/td><\/tr><tr><td>F<\/td><td>Inferences drawn from other personal information &#8211; profile reflecting a person&#8217;s preferences, characteristics, psychological trends, and attitudes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/td><td>Same as 1. B and system algorithms<\/td><td>Same as 2. A<\/td><td>None<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>RIGHTS OF CALIFORNIA USERS WITH REGARD TO THEIR INFORMATION<\/strong><br><br>California users have several rights regarding the collection, use, disclosure, and sale of their information under the CCPA. One of these rights, notice of collection of Information, is described above; the balance of these rights are described below and include the following rights:<\/p>\n\n\n\n<ul><li>Disclosure of information collected and sold<\/li><li>Opt-out from the sale of Information<\/li><li>Deletion of Information<\/li><li>Access and portability of Information collected<\/li><li>Non-discrimination<\/li><\/ul>\n\n\n\n<p><strong>Exercising Your Rights, Verification, and Timing.<\/strong> To exercise your CCPA rights, click on the “<a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">Do Not Sell My Personal Info<\/a>” link on the bottom of our Website pages where we collect Information, or send an email to <a href=\"mailto:privacy@fluentco.com\">privacy@fluentco.com<\/a>. To prevent an unauthorized third party from accessing or making decisions regarding a user’s Information, we verify all requests to exercise these rights (a verifiable consumer request). We do not charge a fee to process or respond to a verifiable consumer request unless it is excessive, repetitive, unfounded, or abusive.<br><br>In general, we will verify a request by matching the identifying information supplied by the user with the Information we already have for the user. If we cannot verify the user using the foregoing method, we may request additional information, which we will not retain or use for any other purpose.<br><br>For all verifiable consumer requests, we strive to respond within forty-five (45) days of receipt. If we require additional time, which can be up to ninety (90) days in the aggregate, we will provide written notice. Any disclosures we provide will cover only the 12-month period preceding the verifiable consumer request&#8217;s receipt and will be delivered electronically in a secure fashion. If, for some reason, we cannot fulfill or comply with your request, our response will explain that decision. <br><br><strong>Disclosure of Information Collected and Sold.<\/strong> While users have the right to request different levels of disclosure regarding the collection, use, disclosure, and sale of Information, we have elected to treat all requests from California residents as an exercise of expanded disclosure requests by businesses that sell Information. Once we receive and confirm your verifiable consumer request, we will disclose to you for the 12 months prior to your request:<\/p>\n\n\n\n<ul><li>The categories and sources of Information collected;<\/li><li>Our business and commercial purposes for collecting and selling that Information;<\/li><li>The categories of third parties with whom we shared that Information;<\/li><li>The specific pieces of Information collected;<\/li><li>If we sold or disclosed your personal information for a business purpose, we will disclose:<\/li><li>For sales &#8211; the Information categories for each category sold and the categories of third parties to whom the Information was sold; and<\/li><li>For disclosures &#8211; the Information categories for each category disclosed and the categories of third parties to whom the Information was disclosed.&nbsp;<\/li><\/ul>\n\n\n\n<p><strong>Right to Opt-Out. <\/strong>Users have the right to opt-out from the sale of their Information. We provide a “Do Not Sell My Personal Info” link on each Website page where we collect Information that links to an online request form. You can access the form <a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a> or you can send an email to <a href=\"mailto:help@myprivacyrequest.com\" target=\"_blank\" rel=\"noreferrer noopener\">privacy@fluentco.com<\/a> and elect to opt-out from the sale of your Information.  We reserve the right to verify all opt-out requests using the methods described above. <br><br>While our agreements with third parties to whom we sell or disclose Information prohibit the further sale or use beyond the scope of our agreement with them, if a California user opts-out, we will notify all third parties to whom we have sold or disclosed the California user’s Information within the previous 90 days and remind them not to further sell the Information. We will not ask a California user who has opted out to re-opt-in for one year after the California user opts-out. If the user requests a transaction with us that requires the sale of their Information, we will inform them that they have opted out and if they want to proceed with the transaction, we will offer the opportunity to opt-in by completing a two-step process.<\/p>\n\n\n\n<p><strong>Deletion of Information<\/strong>. You have the right to request that we delete any of your Information that we collected from you, subject to certain exceptions. Once we receive and confirm your verifiable consumer request using the process set forth above, we will delete or deidentify (and direct our service providers, vendors, and other applicable third parties to delete) your Information from our system other than from our archive servers (which we maintain for compliance purposes), unless there is an applicable exception.&nbsp;&nbsp;<\/p>\n\n\n\n<p>We may decline to process your deletion request if the Information is necessary for us or our service providers, vendors, or other applicable third parties for a number of reasons. For example, we may decline your deletion request if the Information is required to Complete the transaction for which we collected the Information or provide the goods or services you requested;<\/p>\n\n\n\n<ol type=\"1\"><li>Detect security incidents, protect, investigate and respond to malicious, deceptive, fraudulent, or illegal activity, or prosecute those responsible for such activities;<\/li><li>Identify and correct errors that negatively impact intended functionality; and<\/li><li>Comply with a legal obligation, including Federal and\/or State tax liability and reporting.<\/li><\/ol>\n\n\n\n<p>If we do not comply with a deletion request, we will provide the grounds for our denial.<br><br><strong>Access and Portability.&nbsp;<\/strong>California users have the right to access the Information we have collected about them in the previous twelve (12) months. Upon receipt of verified consumer request, we will provide the information in a readily usable format. You cannot request access more than twice in any 12-month period.&nbsp;&nbsp;<br><br><strong>Nondiscrimination.<\/strong>&nbsp;We are committed not to discriminate against California users who exercise their CCPA rights. As such, unless otherwise permitted by the CCPA, we will not deny, charge you different prices or rates, or provide a different quality level of goods or services, including through granting discounts or other benefits, or imposing penalties, and\/or suggest that you may receive a different price, rate, or quality level of goods or services. While we do not provide financial incentives for users who do not exercise their CCPA rights, please note that some of the functionality of the Website may be unavailable if consumers exercise their rights to have their personal information deleted.<br><br><strong>Authorized Agent.<\/strong>&nbsp;The CCPA enables California users to appoint an authorized agent to act on their behalf to submit disclosure requests and or deletion requests under the CCPA. The authorized agent must register with the California Secretary of State. We will honor a request from an authorized agent provided you provide written authorization to the authorized agent to act on your behalf and we can verify your identity and the agent submits proof of authorization.&nbsp;&nbsp;<br><br><strong>CCPA Metrics.&nbsp;<\/strong>We are required to compile certain annual metrics regarding the CPPA including the number of disclosure, deletion and opt-out requests we receive, the median number of days it takes us to respond, and how many of each were denied. The metrics for the period of 1\/1\/2020 from 12\/31\/2020 are displayed below. Please note that the information outlined below is compiled from various entities, which include our parent, subsidiaries, and other entities under common control with us.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-table is-style-stripes\"><table><tbody><tr><td>Total Number of Requests Received*&nbsp;<\/td><td>12,416<\/td><\/tr><tr><td>Total Number of Requests to Know Received<\/td><td>1,729<\/td><\/tr><tr><td>Number of Requests to Know Fulfilled<\/td><td>1,576<\/td><\/tr><tr><td>Number of Requests to Know Denied&nbsp;<\/td><td>153<\/td><\/tr><tr><td>Total Number of Requests to Delete Received<\/td><td>1,430<\/td><\/tr><tr><td>Number of Requests to Delete Fulfilled**<\/td><td>1,430<\/td><\/tr><tr><td>Number of Requests to Delete Denied<\/td><td>0<\/td><\/tr><tr><td>Total Number of Requests to Opt-Out Received<\/td><td>9,257<\/td><\/tr><tr><td>Number of Opt-Out Requests Fulfilled<\/td><td>9,257<\/td><\/tr><tr><td>Number of Opt-Out Requests Denied<\/td><td>0<\/td><\/tr><tr><td>The median or mean number of days within which the business substantively responded to requests<\/td><td>3.5 Days<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>* The total number of requests received from California Consumers do not include the requests that were abandoned by the consumer if the consumer did not complete our email verification process.<\/p>\n\n\n\n<p>** If a consumer requested their right to deletion and their PI was associated with a record of TCPA Consent, we are obligated to maintain the PI associated with that consent and consider such deletion request fulfilled.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>CALIFORNIA ONLINE PRIVACY PROTECTION ACT<\/strong><br><br><strong>Shine the Light Rights.<\/strong>&nbsp;In addition to the CCPA-mandated disclosures described above, the California Online Privacy Protect Act (“CalOPPA”) contains a Shine the Light section that permits users who are California residents to request information regarding our disclosure of their Information to third parties, including the categories of Information shared and a list of the names and addresses of third parties with whom the Information was shared. If you are a California resident and would like to exercise your rights under the Shine the Light provision, please submit a request by sending an email to&nbsp;help@myprivacyrequest.com.&nbsp;In your request, please specify that you want to exercise your rights to disclosure under the Shine the Light provision please specify the Website that you visited and the email address you registered with. Please allow thirty (30) days for a response.<\/p>\n\n\n\n<p><strong>Browser “Do Not Track” Signals.<\/strong>&nbsp;Most browsers contain a “do-not-track” setting. In general, when a “do-not-track” setting is active, the user’s browser notifies other websites that the user does not want their personal information and online behavior to be tracked and used, for example, for interest-based advertising. &nbsp;As required by CalOPPA, we are required to inform you that, as is the case with most websites, we do not honor or alter our behavior when a user to one of the Website has activated the “do-not-track” setting on her\/his browser.<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>NEVADA PRIVACY RIGHTS<\/strong><br><br>Nevada State residents have the right to submit opt-out requests to website operators instructing those website operators not to sell any “covered information” that the website operators have collected about the Nevada State residents to any third-party data broker(s). Covered information includes a consumer’s name, postal and email addresses, telephone number, and Social Security Number, and includes the Information described above in the “TYPES\/CATEGORIES OF INFORMATION WE MAY COLLECT REGARDING USERS” section. If you are a Nevada State resident and you wish to exercise your right to request that we to stop the sale of your Information to third party data brokers, please submit your request by clicking on the link “<a href=\"https:\/\/privacyportal.onetrust.com\/webform\/42194476-4013-4c77-ba0d-3040a55b20f2\/f0da368d-3cb1-4430-b390-61759fc40282\" target=\"_blank\" rel=\"noreferrer noopener\">Do Not Sell My Personal Info<\/a>” or send an email to <a href=\"mailto:help@myprivacyrequest.com\" target=\"_blank\" rel=\"noreferrer noopener\">privacy@fluentco.com<\/a> with the subject line “Nevada Privacy Rights.” In your request, please specify that you want to exercise your rights to opt-out from the sale of covered information under the Nevada Privacy Law and specify the Website that you visited and the email address you registered with. Please allow thirty (30) days for a response. <\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>CHANGES TO THIS POLICY<\/strong><br><br>We reserve the right to revise and update this Policy at any time. If we make material changes to this Policy, we will post the updated Policy on our Websites. &nbsp;Any such revisions will be effective thirty (30) days after posting to the Websites and will apply to all Information collected by us both before and following the effective date. If we expand the way we use Information, we will notify users by: (a) sending the modified Policy to our users via email or (b) any other reasonable means acceptable under applicable state and federal law. You will have a choice as to whether we use your Information in this different manner and we will only use your Information in this way where you opt-in to such use. Users should periodically access this Policy to review our current policies regarding the collection and use of Information.&nbsp;<\/p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>QUESTIONS, SUGGESTIONS, OR TO CONTACT US<\/strong><\/p>\n\n\n\n<p>If you have any questions, comments, complaints, or suggestions regarding this Policy or the Website, please contact us&nbsp;<a href=\"mailto:privacy@fluentco.com\" target=\"_blank\" rel=\"noreferrer noopener\">here<\/a>.<\/p>\n\n\n\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last updated 7.30.2021 Fluent, LLC &nbsp;and its subsidiaries ( “we,” “our,” or “us”) provide the following Privacy Policy (&#8220;Privacy Policy” or “Policy&#8221;), which sets forth our practices related to the collection, use, disclosure, and sale of information that is personally-identifiable &hellip; <a href=\"https:\/\/www.fluentco.com\/privacy-policy-consumer-facing-product-service-websites\/\">Read More<\/a><\/p>\n","protected":false},"author":16,"featured_media":9258,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-wp-reading-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages\/10166"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=10166"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages\/10166\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/9258"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10166"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}