{"id":9647,"date":"2021-01-06T19:08:57","date_gmt":"2021-01-06T19:08:57","guid":{"rendered":"http:\/\/www.fluentco.com\/?page_id=9647"},"modified":"2021-07-30T15:38:31","modified_gmt":"2021-07-30T19:38:31","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.fluentco.com\/privacy-policy\/","title":{"rendered":"Privacy Policy (Standard)"},"content":{"rendered":"\n<p><strong>Terms of Use &amp; Privacy Policy for <a href=\"https:\/\/www.fluentco.com\">www.fluentco.com<\/a><\/strong><\/p>\n\n\n\n<p><em>Last updated 7.30.2021<\/em><\/p>\n\n\n\n<p>Thank you visiting&nbsp;<a href=\"http:\/\/fluentinc.wpengine.com\/\">www.fluentco.com<\/a>&nbsp;(“Site”) which is owned and operated by Fluent, Inc. The Site’s purpose is to provide general information about our company, our management team and the services we provide to advertisers and publishers. The following describes the Terms of Use of our Site and our Privacy Policy applicable to any information we collect from Site users. By using our Site, you agree to the following.<\/p>\n\n\n\n<p><strong>Terms of Use<\/strong><\/p>\n\n\n\n<p>You may use the Site and the content to gain information about us, to request that we contact you and for your own non-commercial use. We own all of the content and information on the Site (except for any third-party trademarks displayed on the Site) and claim all intellectual property rights in our content. You agree not to modify, copy, translate, broadcast, perform, display, distribute, frame, reproduce, republish, download, display, post, transmit or sell any of our content without our prior written consent. You also agree not to use any data mining, robots, scraping or similar data gathering methods. Nothing in these Terms of Use shall be interpreted as granting any license of intellectual property rights in the Site or our content to you.<\/p>\n\n\n\n<p>While we do our best to ensure that all of the information on the Site is accurate and up to date, we are not responsible for any mistakes or errors. We also don’t promise that our Site will always be available or operational or be free defects, bugs or other errors. The Site and any content is provided to you on an ‘as is’ and ‘as available’ basis and we disclaim all other warranties.<\/p>\n\n\n\n<p><strong>Privacy Policy<\/strong><\/p>\n\n\n\n<p>We respect your privacy and are committed to protecting the security of any personal information that we collect from you. The following describes the types of information we collect and how we collect it and what we do with the information we collect.&nbsp;&nbsp;<a href=\"https:\/\/www.fluentco.com\/privacy-policy-consumer-facing-product-service-websites\/\">For information on how we collect and use personal information on our consumer facing product and service websites, please click here.<\/a><\/p>\n\n\n\n<p><strong>The Information We Collect and How We Collect It<\/strong><\/p>\n\n\n\n<p>The Site does not collect personal information other than the contact information you supply on the “Contact Us” page which includes your name, address, email and phone number. If you provide us with your telephone number, you consent to us calling you on the telephone number provided even if it’s your mobile number or it’s on the federal or a State “do not call” list. We may also collect other information about your visits to our Site without you actively submitting information. This information may include, for example, your browser type and language, your operating system, your Internet Protocol (IP) address, the URLs of sites you visited before and after visiting our site, the web search that landed you on our site, and web pages you view and links you click on within our Site.<\/p>\n\n\n\n<p><strong>How We Use the Personal Information We Collect<\/strong><\/p>\n\n\n\n<p>We use your personal information to contact you with information regarding our services. We will not rent or sell your personal information though we may share it with our subsidiaries and companies that are affiliated with us.<\/p>\n\n\n\n<p><strong>Security of Your Information<\/strong><\/p>\n\n\n\n<p>We maintain physical, electronic and procedural safeguards designed to protect personal information. We limit access to personal information to authorized personnel who need access to perform their job and are contractually required to keep your information secure. Due to the nature of the Internet, we cannot guarantee that your information will not be obtained by someone without our authorization.<\/p>\n\n\n\n<p><strong>Updates to this Privacy Policy<\/strong><\/p>\n\n\n\n<p>As business conditions change, we will update this policy to reflect changes in our business practices. We will post revisions to our policy on our Site and reflect that in the “Last update” above.<\/p>\n\n\n\n<p><strong>Questions and Comments<\/strong><\/p>\n\n\n\n<p>Please feel free to send your privacy-related comments or questions to <a href=\"mailto:legal@fluentco.com\">legal@fluentco.com<\/a> or write: Fluent, Inc., Chief Compliance Officer, 300 Vesey Street, 9th Floor, New York, NY 10282. You may also call us at 646-669-7272.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms of Use &amp; Privacy Policy for www.fluentco.com Last updated 7.30.2021 Thank you visiting&nbsp;www.fluentco.com&nbsp;(“Site”) which is owned and operated by Fluent, Inc. The Site’s purpose is to provide general information about our company, our management team and the services we &hellip; <a href=\"https:\/\/www.fluentco.com\/privacy-policy\/\">Read More<\/a><\/p>\n","protected":false},"author":16,"featured_media":9258,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-wp-reading-width.php","meta":[],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages\/9647"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/comments?post=9647"}],"version-history":[{"count":0,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/pages\/9647\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/9258"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=9647"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}