{"id":10013,"date":"2021-02-16T20:23:19","date_gmt":"2021-02-16T20:23:19","guid":{"rendered":"http:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10013"},"modified":"2021-02-16T20:23:20","modified_gmt":"2021-02-16T20:23:20","slug":"2021-singular-roi-index-announcement","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/2021-singular-roi-index-announcement\/","title":{"rendered":"Fluent Named a Global ROI Leader in 2021 Singular ROI Index"},"content":{"rendered":"\n<h2 class=\"has-medium-font-size\">Recognized across multiple global categories as a top mobile media source<\/h2>\n\n\n\n<p>NEW YORK, Feb. 16, 2021 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2021\/02\/16\/2176260\/0\/en\/Fluent-Inc-Named-a-Global-ROI-Leader-in-2021-Singular-ROI-Index.html\" target=\"_blank\" rel=\"noreferrer noopener\">GLOBE NEWSWIRE<\/a>) &#8212; <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=Q79xrZBWUF_QHxEGPVOf6HdZJEbD3xOdpC_oidwIy4ay8Up_vNT5-GH-iIgoSODzVxCvNL9TavQHFZCbl-LZIQ==\" rel=\"noreferrer noopener\" target=\"_blank\">Fluent, Inc.<\/a> (NASDAQ: FLNT), a leading data-driven performance marketing company, was named to Singular’s 2021 ROI Index, ranking among tech giants like Facebook and Google on the overall Global ROI Leaders list. In its debut on the Singular Index, Fluent was also recognized as a top media source in the gaming category and a “hidden gem” for driving high-performing mobile user acquisition campaigns on iOS.<\/p>\n\n\n\n<p>The latest edition of the Singular ROI Index includes 27 total lists and 323 potential positions, ranking ad networks, platforms, and mobile marketing players based on criteria like spend, reach, fraud rates, ROI, and retention. Following a year marked by massive disruption and rapid change, Fluent is among 10 new media sources to be included in Singular’s all-vertical, all-encompassing global ROI list &#8212; the most competitive of the group.<\/p>\n\n\n\n<p>“Our proprietary mobile web inventory enables us to provide incremental growth solutions that drive loyalty at scale,” said Matthew Conlin, Co-Founder and President of Fluent. “We operate in a highly competitive media landscape and debuting on the Singular ROI Index speaks to the impact our solutions make on our clients’ growth objectives and specifically their user acquisition programs. We are excited to be recognized among such a diverse and competitive list of leaders in the space.”<\/p>\n\n\n\n<p>An industry-standard, the latest Singular ROI Index is its most comprehensive to date, covering $10 billion in ad spend and nearly 3 billion app installs. Singular introduced the ROI Index in 2017 as the first of its kind analysis of ROI generated by different mobile app ad networks. The 2021 Index offers app marketers insight into top media sources as they navigate the evolving privacy landscape and seek to drive growth for their mobile business in the year ahead.<\/p>\n\n\n\n<p>“What powers our ROI Index is that Singular sees both sides of the equation: ad spend and revenue,” said Susan Kuo, COO &amp; Co-Founder at Singular. “On the one hand, we see what every MMP sees: the outputs of marketing campaigns, the conversions. But on the other hand, we also see what most other MMPs don’t: the inputs into those marketing campaigns. That means costs, creatives, targeting criteria, bids, budgets, and more. Combining those datasets for our customers results in deeper insights into future growth, and for readers of the ROI Index it means a reliable analysis of the top ROI-driving ad networks in the world.”<\/p>\n\n\n\n<p>To learn more about what makes Fluent a top media source, visit&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=_0smPh0XQSD8SxSBWQze-balTDMY8fAT6NBJztioLKf8dHuLKSIGG4dDk7n8xxhpYk7_sbvkzgW6-pc6_3_EfGhkiDZzF5WvsIBRpgXVTiI=\" rel=\"noreferrer noopener\" target=\"_blank\">https:\/\/www.fluentco.com\/<\/a>.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><\/p>\n\n\n\n<p>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Media Contact:<\/strong><\/p>\n\n\n\n<p>N6A for Fluent<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=Q79xrZBWUF_QHxEGPVOf6BTjnICC1_Ry-EYvMdorGfjtCv7nPhiy-R2tzQnnv0sS4RuNLnYz0gie776a_JuAWQ==\" rel=\"noreferrer noopener\" target=\"_blank\">Fluent@n6a.com<\/a><br>401.464.1772<\/p>\n\n\n\n<p><\/p>\n","protected":false},"featured_media":10001,"template":"","categories":[144],"tags":[151,162],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10013"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10001"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10013"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10013"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10013"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}