{"id":10059,"date":"2021-03-25T13:11:00","date_gmt":"2021-03-25T13:11:00","guid":{"rendered":"http:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10059"},"modified":"2021-03-25T13:11:00","modified_gmt":"2021-03-25T13:11:00","slug":"appsflyer-performance-index-xii-h2-2020","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/appsflyer-performance-index-xii-h2-2020\/","title":{"rendered":"Fluent Recognized as Multi-Category Mobile Leader in 2021 AppsFlyer Performance Index XII"},"content":{"rendered":"\n<h2 class=\"has-large-font-size\"><strong>Company ranks as a top growth partner in North America and Western Europe<\/strong><\/h2>\n\n\n\n<p>NEW YORK, March 25, 2021 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2021\/03\/25\/2199389\/0\/en\/Fluent-Recognized-as-Multi-Category-Mobile-Leader-in-2021-AppsFlyer-Performance-Index-XII.html\" target=\"_blank\" rel=\"noreferrer noopener\">GLOBE NEWSWIRE<\/a>) &#8212;&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=NEsoSN4WNwj91nP36MorZX2OLU5UcYl6zk2HH0r3WpVfG3z2tjQpYLbZ5RPxqqwn_ll60gs6sMVzmeBrtE_X9g==\" rel=\"noreferrer noopener\" target=\"_blank\">Fluent, Inc.<\/a>&nbsp;(NASDAQ: FLNT), a leading data-driven performance marketing company, was named across seven lists in AppsFlyer’s&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=rVmy6xKtxn7SH8eSMQ4jxwrchlqHVvF6_9rfj34vqGYodKORPk2CClOe6AdbNRycw4LTU_lF5ZyUNIfuuYknwVD85g0_L18CkuMpZzJarSWFlL-ULOd5AQUU-6Lnr7AZ\" rel=\"noreferrer noopener\" target=\"_blank\">Performance Index XII<\/a>, up from four lists in edition XI. In addition to top rankings in North America, Fluent made its debut as the number 10 fastest-growing media source in Western Europe. Other notable accolades include:<\/p>\n\n\n\n<ul><li>Global In-App Purchase (IAP) Index: #2 Power Ranking (Social Casino, iOS)<\/li><li>North America Retention Index: #12 Power Ranking (Social Casino, iOS)<\/li><li>North America Retention Index: #18 Power Ranking (Casual, Android &amp; iOS)<\/li><\/ul>\n\n\n\n<p>“Fluent has solidified its place as a high-value growth partner and recurring fixture on the AppsFlyer Performance Index,” said Matthew Conlin, Co-Founder and President of Fluent. “Our latest recognition as one of the fastest growing media sources in Western Europe is a testament to our continued investment in developing world-class growth solutions for the mobile app ecosystem.”<\/p>\n\n\n\n<p>The latest edition of the AppsFlyer Performance Index analyzes data from the second half of 2020, ranking the top 580 media sources across the following indices: Retention, Growth, In-App Purchases, In-App Advertising, and Remarketing. 2021 marks Fluent’s third consecutive year being featured among top mobile growth leaders on AppsFlyer&#8217;s Performance Index.<\/p>\n\n\n\n<p>“Through Fluent’s performance platform, mobile app marketers can leverage first-party insights to reach incremental users at scale,” said Conlin. “We’re proud to be recognized among such a diverse and competitive list of leaders in the space as we continue to drive high-value users and strong ROI for our app clients on a global scale.”<\/p>\n\n\n\n<p>An industry-standard, the latest AppsFlyer Performance Index is its most comprehensive to date, spanning 29 billion installs and 60 billion opens across 16,000 apps. AppsFlyer first introduced its Performance Index in 2015 to showcase up-and-coming media sources and encourage a diversified ecosystem. Since then, the Index has offered app marketers insight into top media sources as they navigate the evolving mobile advertising landscape and seek actionable data to inform their user acquisition strategy.<\/p>\n\n\n\n<p>To learn more about what makes Fluent a top media source, visit <a href=\"https:\/\/www.fluentco.com\/\">https:\/\/www.fluentco.com\/<\/a>.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><\/p>\n\n\n\n<p>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n","protected":false},"featured_media":10060,"template":"","categories":[144],"tags":[151,162],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10059"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10060"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10059"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10059"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}