{"id":10064,"date":"2021-04-21T19:08:03","date_gmt":"2021-04-21T19:08:03","guid":{"rendered":"http:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10064"},"modified":"2021-04-21T19:08:04","modified_gmt":"2021-04-21T19:08:04","slug":"fluent-lotame-partnership","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-lotame-partnership\/","title":{"rendered":"Lotame Panorama ID Gains Support From Leading Data Partners, Enabling Expanded Data Collection Across the Open Web"},"content":{"rendered":"\n<p><em>Reposted from <a href=\"https:\/\/www.lotame.com\/lotame-panorama-id-gains-support-from-leading-data-partners-enabling-expanded-data-collection-across-the-open-web\/\" target=\"_blank\" rel=\"noreferrer noopener\">Lotame<\/a><\/em><\/p>\n\n\n\n<p>Lotame, the leading global provider of data enrichment solutions to drive customer insights and turn personas into addressable advertising, today announced 11 leading data partners including Dun &amp; Bradstreet, ShareThis, and Throtle will support <a href=\"https:\/\/www.lotame.com\/lotame-unveils-panorama-id-the-first-global-cookieless-identity-solution-for-a-privacy-first-open-web\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Lotame Panorama ID<\/strong><\/a>, the first global, people-based, privacy-compliant and interoperable identity solution for a cookieless open web. <\/p>\n\n\n\n<p>Lotame is providing the industry with privacy-compliant solutions that allow data partners to capture data on the Panorama ID in cookieless environments (Safari, Firefox, and soon Chrome) in order to maintain scale. This also benefits brands who can buy and target their audiences of choice across the open web.&nbsp;<\/p>\n\n\n\n<p>“Without a replacement for third-party tracking, marketers around the globe will lose the ability to collect quality data to power campaigns,” said Andy Monfried, CEO&nbsp;at Lotame. “Marketers need options outside the walled gardens, such as data-driven targeting, to reach consumers up and down the funnel. With Panorama ID and partnerships with data partners, marketers can find and engage in-market, relevant consumers thanks to accurate, privacy-compliant data.”&nbsp;<\/p>\n\n\n\n<p>With Panorama ID, these data partners will now have access to:<\/p>\n\n\n\n<ul><li><strong>Expanded data collection across all browsers and apps<\/strong>: Access to previously invisible audiences for data collection based on a variety of attributes in cookieless environments, with no additional engineering required.<\/li><li><strong>Activated rich data sets everywhere<\/strong>: Aggregated valuable data on the Panorama ID for interoperable activation across the open web.<\/li><li><strong>Increased value of publisher partner’s inventory<\/strong>: Assistance for partner monetization of first-, second- and third-party audiences cross-domain by enabling advertisers to target audiences in cookieless environments on all available impressions.<\/li><li><strong>Future-proofing the ability to sell unique data sources:&nbsp;<\/strong>Ability to continue to offer custom audiences to brands and advertisers in a cookieless future.&nbsp;&nbsp;<\/li><\/ul>\n\n\n\n<p>Launched in late 2020, Lotame Panorama ID is the only enriched global identity solution. As a delivery mechanism for an extraordinary quantity of privacy-compliant, rich, pseudonymized data, individual Panorama IDs carry an average of 200+ behavioral attributes. In January, Lotame announced that Magnite, Sovrn, Eyeota, and Advance Local would support the identifier.&nbsp;<\/p>\n\n\n\n<p>The current list of data partners supporting Panorama ID is:<\/p>\n\n\n\n<ul><li>BDEX<\/li><li>Data Axle<\/li><li>digitalAudience<\/li><li>DTScout<\/li><li>Dun &amp; Bradstreet, Inc.<\/li><li>Eyeota<\/li><li>Fluent<\/li><li>Killi<\/li><li>Safe-Reach<\/li><li>ShareThis<\/li><li>Sovrn<\/li><li>The Kochava Collective<\/li><li>Throtle<\/li><\/ul>\n\n\n\n<p>“We’re excited to support Lotame in its efforts to safeguard advertisers’ abilities to make quality, genuine connections with target consumers,” said David Finkelstein, CEO &amp; Co-Founder of&nbsp;<strong>BDEX<\/strong>. “As the privacy-first, cookieless data marketplace nears, it’s imperative advertisers prepare by partnering with the right solutions.”<\/p>\n\n\n\n<p>“We’re thrilled to continue to partner with Lotame as we proactively look for a solution to the sunset of third-party cookies,” said Tom Zawacki,&nbsp;<strong>Data Axle’s<\/strong>&nbsp;Chief Digital Officer. “We believe comprehensive datasets, like Data Axle’s, which span offline and online channels, will be key to finding a privacy compliant solution and are excited to work with Lotame to set a new standard of collaboration and innovation in the industry. There is a ton of opportunity to get this right and improve this space for both businesses and consumers.”<\/p>\n\n\n\n<p>“Dun &amp; Bradstreet’s data will continue to be targetable, even in the absence of third-party cookies,” said Stacy Greiner, Chief Marketing Officer at&nbsp;<strong>Dun &amp; Bradstreet<\/strong>. “We realize that the approach going forward will be multi-faceted, and we are committed to giving our clients a choice. We will do so by integrating our data into high-quality ID solutions, platforms, and media channels, which is why we have collaborated with Lotame.”<\/p>\n\n\n\n<p>“Partnering with Lotame to help them solve challenges in the cookieless environment is&nbsp;strategically aligned with our focus on privacy,” said Neil Sweeney, Founder, and CEO of&nbsp;<strong>Killi<\/strong>.&nbsp;“We are excited to partner with the Panorama ID and help Lotame bring this ubiquitous solution&nbsp;to the market.”<\/p>\n\n\n\n<p>“Lotame’s Panorama ID solution provides another glimmer of promise to data providers and marketers alike in facing the challenges around identity resolution and marketing attribution,” said&nbsp;John Nakhla, VP Media and Data at Safe-Reach. “As an advocate for many business owners in the cannabis &amp; CBD industry,&nbsp;<strong>Safe-Reach<\/strong>&nbsp;understands the importance of being prepared for these changes to digital marketing. Dispensary owners, MSOs, and CBD brands already have limited options to invest in to reach new customers on digital channels. Walled garden environments like Google and Facebook maintain a near zero-tolerance policy on the vertical as a whole. Attribution and targeting against first-, second-, and third-party data across the web are critical to measuring success and growing their businesses. Without a scalable persistent ID solution in place, an entire emerging industry is at risk of losing their ability to connect with known and prospective customers. Panorama ID will be a necessary component in the collective toolset that marketers across all industries will need to implement in concert together. With a focus on user privacy, method for scalability, and compatibility with other ID solutions, it makes all the sense in the world to fold it into the mix.”<\/p>\n\n\n\n<p>“Lotame is offering the industry a solution that improves engagement even in the absence of deterministic data,” says Michael Gorman, SVP of Product and Marketing,&nbsp;<strong>ShareThis<\/strong>. “We are happy to support this comprehensive approach toward meeting advertisers’ needs in the cookieless world.”<\/p>\n\n\n\n<p>“Our integration with the Lotame Panorama ID aligns with our commitment to remain a neutral player in the industry as we continue to power consumer identity across the cookieless web,” said Moira McKenna, CRO of&nbsp;<strong>Throtle<\/strong>. “We are committed to creating a better standard for identity so publishers and brands can continue to thrive in a privacy-first future.”<\/p>\n\n\n\n<p>To learn more about how Lotame Panorama ID builds a connected digital advertising ecosystem for all, please visit&nbsp;<a href=\"http:\/\/www.lotame.com\/panorama\/id\" target=\"_blank\" rel=\"noreferrer noopener\">www.lotame.com\/panorama\/id<\/a><\/p>\n","protected":false},"featured_media":10065,"template":"","categories":[144],"tags":[157,172],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10064"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10065"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10064"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10064"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10064"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}