{"id":10135,"date":"2021-06-22T11:37:11","date_gmt":"2021-06-22T15:37:11","guid":{"rendered":"https:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10135"},"modified":"2021-06-22T11:37:11","modified_gmt":"2021-06-22T15:37:11","slug":"fluent-fyllo-partnership","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-fyllo-partnership\/","title":{"rendered":"Health, Pharma, and Wellness Brands to Benefit from Fyllo and Fluent Audiences"},"content":{"rendered":"\n<p><em>Reposted from <a href=\"https:\/\/hellofyllo.com\/health-pharma-and-wellness-brands-to-benefit-from-fyllo-and-fluent-audiences\/\" target=\"_blank\" rel=\"noreferrer noopener\">Fyllo<\/a><\/em><\/p>\n\n\n\n<p>Fyllo, the leader in digital marketing and compliance solutions for highly regulated industries, has partnered with Fluent, a leading data-driven performance marketing company, to create Fyllo Infused Fluent Audiences, a new set of precision targets for pharma, health, and wellness advertising.<\/p>\n\n\n\n<p>Through the partnership, Fluent’s 100% opt-in, deterministic ﬁrst-party survey data is enriched with Fyllo’s oﬄine cannabis and CBD-endemic purchase data, providing unique access to today’s most progressive health seekers across leading Demand Side Platforms, Data Management Platforms, Supply Side Platforms and Social Platforms.<\/p>\n\n\n\n<p>When combined, these datasets signal a strategic change in the relevance of the cannabis and CBD consumer to major pharma and healthcare brands. According to MRI-Simmons, cannabis and CBD consumers are more likely to embrace cutting edge health practices and behaviors than the general population, for example:<\/p>\n\n\n\n<ul><li>75% more likely to be ﬁrst to try the most advanced medicines<\/li><li>69% more likely to prefer alternative medicine to traditional<\/li><li>26% more likely to follow a regular exercise routine<\/li><li>21% more likely to say they are always looking for ways to live a healthier lifestyle<\/li><li>20% more likely to say newer drugs work better than older ones<\/li><\/ul>\n\n\n\n<p>While mainstream brands like Uber and Clorox are already leveraging Fyllo Infused Audiences to reach lucrative cannabis and CBD consumers in mainstream environments, Fyllo Infused Fluent Audiences represents the ﬁrst in a series of strategic partnerships meant to enrich data from some of the most respected data providers, creating enhanced targeting for brands.<\/p>\n\n\n\n<p>“We are incredibly proud to partner with a world-class data provider like Fluent to expand our ecosystem of Fyllo Infused Audiences,” said&nbsp;Chad Bronstein, CEO and Founder of Fyllo. “Together we’re creating new opportunities for brands in the pharma and health\/wellness space to drive incrementality and accelerate growth.”<\/p>\n\n\n\n<p>“Fyllo has built the most robust, compliant advertising and data ecosystem for the cannabis and non-cannabis category available today for brands,” said&nbsp;Brian Hogan, President of Data Solutions at Fluent. “By infusing our self-declared, health and wellness-centric consumer data with Fyllo’s cannabis and CBD transaction data, together, we bring advertisers access to powerful audiences they can’t get elsewhere.”<\/p>\n\n\n\n<p><strong><u>About Fyllo<br><\/u><\/strong>The Fyllo Compliance Cloud is a suite of software and services built to overcome the complexities of highly regulated industries. We deliver data, media, retail and regulatory solutions that enable organizations to streamline compliance, increase efficiencies, and scale with speed. Mainstream brands also seek out Fyllo’s Data Marketplace to target previously inaccessible cannabis and CBD consumers.<\/p>\n\n\n\n<p><strong><u>About Fluent, Inc.:<\/u><\/strong><br>Fluent (NASDAQ: <a href=\"https:\/\/www.prnewswire.com\/news-releases\/health-pharma-and-wellness-brands-to-benefit-from-fyllo-and-fluent-audiences-301316736.html?tc=eml_cleartime#financial-modal\">FLNT<\/a>) is a leading performance marketing company with expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary ﬁrst-party data asset of opted-in consumer proﬁles, Fluent drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City. For more information, visit <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3203435-1&amp;h=1562756194&amp;u=https%3A%2F%2Fwww.globenewswire.com%2FTracker%3Fdata%3D8HRzy7mZNlSnrF38BPWLs2iS-45DkOelvMwRrEi0qMBctn3b30AGxwj5ndYldKaJmRRqGIwWfe2amlHmWFMdmg%253D%253D&amp;a=www.%EF%AC%82uentco.com\" target=\"_blank\" rel=\"noreferrer noopener\"><u>www.ﬂuentco.com<\/u><\/a>.<\/p>\n","protected":false},"featured_media":10136,"template":"","categories":[144],"tags":[157,172],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10135"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10136"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10135"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10135"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10135"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}