{"id":10154,"date":"2021-07-06T08:51:29","date_gmt":"2021-07-06T12:51:29","guid":{"rendered":"https:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10154"},"modified":"2021-07-06T09:29:04","modified_gmt":"2021-07-06T13:29:04","slug":"fluent-implements-key-executive-changes","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-implements-key-executive-changes\/","title":{"rendered":"Fluent Implements Key Executive Changes for the Next Phase of Its Strategic and Sustainable Growth Agenda"},"content":{"rendered":"\n<h2 class=\"has-medium-font-size\">Leading Performance Marketing Company’s Executive Leadership Enthusiastically Steps Back in to Lead Strategic Roles that Facilitate Hands-On Operating Protocols in Today’s Rapidly Evolving Marketplace<\/h2>\n\n\n\n<p>NEW YORK, July 6, 2021 (<a href=\"https:\/\/www.globenewswire.com\/en\/news-release\/2021\/07\/06\/2258245\/0\/en\/Fluent-Implements-Key-Executive-Changes-for-the-Next-Phase-of-Its-Strategic-and-Sustainable-Growth-Agenda.html\" target=\"_blank\" rel=\"noreferrer noopener\">GLOBENEWSWIRE<\/a>)— <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=NEsoSN4WNwj91nP36MorZX2OLU5UcYl6zk2HH0r3WpVfG3z2tjQpYLbZ5RPxqqwn_ll60gs6sMVzmeBrtE_X9g==\" target=\"_blank\" rel=\"noreferrer noopener\">Fluent, Inc.<\/a>  (NASDAQ: FLNT), a leading data-driven, performance marketing company, announced changes to its leadership and management team to place greater focus on strategic growth initiatives.  The company continues its commitment to quality, which is the decided path to expanding strategic partnerships with leading global brands.  In addition, the changes will further expand Fluent’s ability to deliver relevant experiences that connect consumers to world-class brands, products, and services.<\/p>\n\n\n\n<p>As Co-Founder of the Company and having served as Fluent’s CEO since the inception of the business, Ryan Schulke is invigorated by his move into the new role of Chief Strategy Officer.&nbsp; “<em>Fluent is at an exciting juncture in a rapidly evolving and dynamic performance marketing industry.&nbsp; As Fluent’s Chief Strategy Officer, I am better positioned to evolve our growth agenda to take advantage of these market dynamics, with industry leading quality for our consumers and advertisers, while continuing to build our platform that attracts strategic partnerships with some of the world’s greatest brands.<\/em>”&nbsp; Ryan Schulke has also been appointed as Chairman of Fluent’s Board of Directors, overseeing the strategic direction of the Company.<\/p>\n\n\n\n<p>Stepping into the new role of Chief Customer Officer, Matthew Conlin, who co-founded the company with Ryan Schulke and has served as Fluent’s President for the last 10 years, will focus on the company’s end-to-end customer acquisition strategy and capabilities in his new role. “<em>With the sharpened focus my role as Fluent’s Chief Customer Officer brings to our organization, our commitment to building valuable consumer experiences and delivering our partners more highly efficient performance-driven growth solutions, increases exponentially.<\/em>”&nbsp; Mr. Conlin will continue to serve on Fluent’s Board of Directors.<\/p>\n\n\n\n<p>Don Patrick, who has served as Fluent’s COO for over three years, will take on the role of Interim CEO. “<em>The changes we are implementing will allow for better alignment across our product, sales and partnership teams against a number of our most important strategic growth initiatives. Just as important, we’ll be enhancing our ability to deliver rewarding experiences between brands and consumers. We couldn’t be more enthusiastic about the exciting growth opportunities and business outcomes that will result from our putting the right Fluent leaders in the right places operationally to evolve our strategy and guide the execution of our strategic initiatives.<\/em>”<\/p>\n\n\n\n<p>To learn more about Fluent, visit  <a href=\"https:\/\/www.fluentco.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/www.fluentco.com\/<\/a><\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><\/p>\n\n\n\n<p>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:<\/strong><\/p>\n\n\n\n<p>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br>InvestorRelations@fluentco.com<\/p>\n","protected":false},"featured_media":10155,"template":"","categories":[144],"tags":[153],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10154"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10155"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10154"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10154"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10154"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}