{"id":10161,"date":"2021-07-22T14:18:56","date_gmt":"2021-07-22T18:18:56","guid":{"rendered":"https:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10161"},"modified":"2021-07-29T12:25:04","modified_gmt":"2021-07-29T16:25:04","slug":"narrative-makes-data-monetization-accessible","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/narrative-makes-data-monetization-accessible\/","title":{"rendered":"Narrative Makes Data Monetization Accessible to All Businesses with the Launch of Data Shops"},"content":{"rendered":"\n<p><em>Reposted from <a href=\"https:\/\/www.narrative.io\/press\/data-shops\" target=\"_blank\" rel=\"noreferrer noopener\">Narrative<\/a><\/em><\/p>\n\n\n\n<h2 class=\"has-medium-font-size\">&#8220;Shopify for Data&#8221; Earns Customer Praise for Innovative and Accessible Data Monetization Solution<\/h2>\n\n\n\n<p>Following the recent success of a limited early access program for its users, <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=3840822113&amp;u=https%3A%2F%2Fwww.narrative.io%2F&amp;a=Narrative\" rel=\"noreferrer noopener\" target=\"_blank\">Narrative<\/a>, the Data Streaming Platform that makes it easy to buy, sell and win, today launched <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=3952489531&amp;u=http%3A%2F%2Fwww.narrative.io%2Fdata-shops&amp;a=Data+Shops\" rel=\"noreferrer noopener\" target=\"_blank\">Data Shops<\/a>, the company&#8217;s latest innovative solution that makes it easy for any business in any industry to launch their own branded data e-commerce experience without spending significant time and resources.<\/p>\n\n\n\n<p>&#8220;E-commerce has become a common part of our lives,&#8221; said Nick Jordan, Founder and CEO of Narrative. &#8220;It&#8217;s never been easier to buy almost anything at any time. Yet the buying and selling of data have remained a convoluted process that often takes months. Narrative Data Shops is a category maker &#8211; a truly transformational offering in the marketplace that is being enthusiastically embraced by customers as the &#8216;Shopify for Data.&#8217; It&#8217;s an end-to-end solution for standing up a data business, from the top of the sales and marketing funnel through to transactions and delivery.&#8221;<\/p>\n\n\n\n<h3 class=\"has-medium-font-size\"><strong>Narrative Data Shops: The &#8220;Shopify for Data&#8221;<\/strong><\/h3>\n\n\n\n<p>Data Shops makes data monetization accessible to all businesses and all types of data—from healthcare to financial services to marketing. The suite of apps enables businesses to package, sell, and deliver data via a customized e-commerce storefront. Even with zero coding or design experience, a user can have a customized digital shop up and running in an hour or less. The Data Shops collection of apps includes:<\/p>\n\n\n\n<ul><li><strong>Dataset Manager&nbsp;<\/strong>to automatically transform raw data into standardized datasets for easy packaging and discoverability, no coding experience necessary.<\/li><li><strong>Seller Studio&nbsp;<\/strong>to package your data into custom data products and manage licensing terms and access rules.<\/li><li><strong>Shop Builder<\/strong>&nbsp;to create a custom-branded e-commerce storefront.<\/li><\/ul>\n\n\n\n<h3 class=\"has-medium-font-size\"><strong>Customers Praise Narrative Data Shops<\/strong><\/h3>\n\n\n\n<p>Customers who recently participated in the company&#8217;s Early Access Program are praising Data Shops for meeting a critical need in the marketplace and applauding the revenue opportunities that it opens up for users:<\/p>\n\n\n\n<p><em>&#8220;Narrative Data Shops has made it easy for us to spin up an e-commerce store that showcases AdImpact&#8217;s advertising intelligence data. The team has been outstanding in providing us with logistical support &#8212; from warehousing data to delivering it to our media, agency, political, and platform buyers. Data Shops is a turnkey, end-to-end data monetization experience that opens up an entirely new channel for us to deliver real-time linear, CTV, and digital ad spend data to customers.&#8221; &#8211;&nbsp;<\/em><strong><em>Dwight Green, Chief Business Officer,&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=1568363730&amp;u=https%3A%2F%2Fadimpact.com%2F&amp;a=AdImpact\" rel=\"noreferrer noopener\" target=\"_blank\">AdImpact<\/a><\/em><\/strong><\/p>\n\n\n\n<p><em>&#8220;AnalyticsIQ is excited to be a founding customer of Narrative Data Shops. Data users are only as good as the data they are aware of and can access. With Data Shops, we can more easily connect users with a variety of quality data they may not have otherwise found, giving them the ability to identify the right data for their analytic mission and to us, that is both exciting and important.&#8221; &#8211;&nbsp;<strong>Dave Kelly, CEO,&nbsp;<\/strong><\/em><strong><em><a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=1301460665&amp;u=https%3A%2F%2Fanalytics-iq.com%2F&amp;a=AnalyticsIQ\" rel=\"noreferrer noopener\" target=\"_blank\">AnalyticsIQ<\/a><\/em><\/strong><\/p>\n\n\n\n<p><em>&#8220;Narrative Data Shops is an important part of our data monetization strategy, providing options that go well beyond traditional listings on data marketplaces today. With our proprietary first-party data asset of over 250 million opted-in consumer profiles, this relationship provides us with the ability to build an entirely new revenue stream &#8211; while allowing us to retain full control of our licensing terms and who gets access to our data shop.&#8221; &#8211;&nbsp;<strong>Brian Hogan, President, Data Solutions,&nbsp;<\/strong><\/em><strong><em><a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=1094490305&amp;u=https%3A%2F%2Fwww.fluentco.com%2F&amp;a=Fluent%2C+Inc\" rel=\"noreferrer noopener\" target=\"_blank\">Fluent, Inc<\/a>.<\/em><\/strong><\/p>\n\n\n\n<p><em>&#8220;PurpleLab is driving innovation in the healthcare data industry by re-architecting how real-world data is understood and accessed. We aim to deliver on a standard of access in minutes, and insight instantly. While our database structures and flexibility are foundational to enabling life science organizations to better understand markets and analyze outcomes at speed, digital marketplaces have struggled to meet this velocity, hidebound as they are by older data structures and business rules that restrict how buyers and sellers can collaborate. Narrative Data Shops is the first solution we&#8217;ve found with the same commitment to frictionless marketplaces that provides data on the client&#8217;s terms, and easy iteration of new product types to identify unmet demand.&#8221; &#8211;&nbsp;<strong>Mark Brosso, CEO,&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=1081510406&amp;u=https%3A%2F%2Fpurplelab.com%2F&amp;a=PurpleLab\" rel=\"noreferrer noopener\" target=\"_blank\">PurpleLab<\/a><\/strong><\/em><\/p>\n\n\n\n<p>For more information about the Narrative Data Shops offering, visit <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3234502-1&amp;h=305099403&amp;u=http%3A%2F%2Fwww.narrative.io%2Fdata-shops&amp;a=www.narrative.io%2Fdata-shops\" rel=\"noreferrer noopener\" target=\"_blank\">www.narrative.io\/data-shops<\/a><\/p>\n\n\n\n<h3 class=\"has-medium-font-size\"><strong>About Narrative<\/strong><\/h3>\n\n\n\n<p>Narrative is the Data Streaming Platform that makes it easy to buy, sell, and win. Narrative simplifies the buying and selling of information by eliminating the inefficiencies in data transactions that hold businesses back from maximizing the success of their most important data-driven initiatives. Innovative brands and direct-to-consumer companies leverage Narrative&#8217;s technology to fuel powerful data strategies, build data monetization businesses, power growth marketing, and inform product development. Founded in 2016, Narrative is a private company headquartered in&nbsp;New York City.<\/p>\n","protected":false},"featured_media":10162,"template":"","categories":[144],"tags":[172],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10161"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10162"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}