{"id":10207,"date":"2021-08-05T12:32:14","date_gmt":"2021-08-05T16:32:14","guid":{"rendered":"https:\/\/www.fluentco.com\/?post_type=newsroom&#038;p=10207"},"modified":"2021-08-05T13:21:07","modified_gmt":"2021-08-05T17:21:07","slug":"q2-2021-truthset-truthscore-index","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/q2-2021-truthset-truthscore-index\/","title":{"rendered":"Fluent Ranks First in Quality Across 8 Key Data Categories in Q2 2021 Truthset Truthscore™ Index"},"content":{"rendered":"\n<h2 class=\"has-medium-font-size\">Company also joins 15 other industry-leading third-party data providers as part of Truthset Data Provider Network<\/h2>\n\n\n\n<p>NEW YORK, August 5, 2021 (<a href=\"https:\/\/www.globenewswire.com\/news-release\/2021\/08\/05\/2275674\/0\/en\/Fluent-Ranks-First-in-Quality-Across-8-Key-Data-Categories-in-Q2-2021-Truthset-Truthscore-Index.html\" target=\"_blank\" rel=\"noreferrer noopener\">GLOBENEWSWIRE<\/a>)— <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=NEsoSN4WNwj91nP36MorZX2OLU5UcYl6zk2HH0r3WpVfG3z2tjQpYLbZ5RPxqqwn_ll60gs6sMVzmeBrtE_X9g==\" target=\"_blank\" rel=\"noreferrer noopener\">Fluent, Inc.<\/a>  (NASDAQ: FLNT), a leading data-driven, performance marketing company, announced rankings in Truthset’s Truthscore™ Index for Q2 2021. Truthset is a data intelligence company, focused exclusively on validating the accuracy and compliance of consumer data. The Truthscore™ Index is a record-level rating measure of a single provider’s overall data quality within a given attribute segment relative to the entire cohort of data providers for the same segment.<\/p>\n\n\n\n<p>A data provider’s average Truthscore™ quantifies the probability that record-level consumer data is accurate across 20+ different attributes. In the first quarter of participation, Fluent scored highly on several data attributes both in Index and Rank.&nbsp; Most notable:<\/p>\n\n\n\n<ul><li>Household Income: Index of 121, Rank #1<\/li><li>Presence of Children: Index of 174, Rank #1<\/li><li>Single Relationship Status: Index of 300, Rank #1<\/li><li>Education Overall: Index of 196, Rank #1<\/li><li>Employment Overall: Index of 129, Rank #1<\/li><\/ul>\n\n\n\n<p>With hard-to-find and reach 55+ year old individuals, Fluent ranked #1 in both the 55-64 and 65+ age demographics. Fluent also ranked #1 for accuracy in the overall household income segment, over-indexing across each of the three income bands.<\/p>\n\n\n\n<p>Fluent’s differentiated data offering enables advertisers to connect to 260 million authenticated consumer profiles across programmatic, social, and connected TV platforms. Using Fluent’s platform, brands build meaningful connections with consumers, making it easier for them to find relevant products and services aligned to their self-reported interests and preferences.<\/p>\n\n\n\n<p>“Accuracy is important for all types of data, and Fluent’s commitment to publicly verifying their data with Truthset underscores how their unique method of data collection is only enhanced by measuring its accuracy.&nbsp;Accurate data will improve the precision and performance of any data-driven decision,” said Scott McKinley, CEO of Truthset. “Advertisers need to know that the data they are getting is credible, accurate, and will deliver ROI on their chosen audiences. Truthset makes it easy for advertisers to select great data from quality partners like Fluent.”<\/p>\n\n\n\n<p>Fluent joins 15 of the largest third-party data providers in the advertising industry as a recent addition to the Truthset Data Provider Network.<\/p>\n\n\n\n<p>“We are proud to collaborate with Truthset on this data validation initiative as we continue to uphold transparent data practices and provide best-in-class data solutions for our advertisers,” said Brian Hogan, President Data Solutions at Fluent. “Fluent’s #1 ranking across key consumer attributes is a true testament to the overall quality and accuracy of our data offerings.”<\/p>\n\n\n\n<p>To learn more about Fluent, visit&nbsp; <a href=\"https:\/\/www.fluentco.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/www.fluentco.com\/<\/a>.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>About Fluent, Inc.&nbsp;<\/strong>&nbsp;<\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth&nbsp;strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>About Truthset<\/strong><\/p>\n\n\n\n<p>Founded in 2019, Truthset is a data intelligence company focused exclusively on validating the accuracy of consumer data. The company helps brands build trust in data and improve the performance of any data-driven decision. Truthset does not sell data and is not a data broker; it compiles a likelihood of truth for any individual record that can be used to validate the accuracy of data and power more accurate consumer interactions. To learn more about Truthset, visit <a href=\"https:\/\/www.truthset.io\/\">truthset.io<\/a><\/p>\n\n\n\n<p><strong>Forward-Looking Statements&nbsp;<\/strong>&nbsp;<\/p>\n\n\n\n<p>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.&nbsp;<\/p>\n","protected":false},"featured_media":10211,"template":"","categories":[144],"tags":[172],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/10207"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/10211"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=10207"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=10207"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=10207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}