{"id":7165,"date":"2020-08-16T13:43:16","date_gmt":"2020-08-16T13:43:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7165"},"modified":"2021-02-23T20:11:42","modified_gmt":"2021-02-23T20:11:42","slug":"fluent-philanthropy-2018","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-philanthropy-2018\/","title":{"rendered":"Fluent, Inc. Announces Donation of $100,000 to Aid in the Education &#038; Development of New York City Youth"},"content":{"rendered":"<p>NEW YORK, Aug. 16, 2018 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2018\/08\/16\/1552967\/0\/en\/Fluent-Inc-Announces-Donation-of-100-000-to-Aid-in-the-Education-Development-of-New-York-City-Youth.html\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc. (NASDAQ: FLNT), a leading data-driven performance marketing company, today announced that the Company has donated $100,000 to benefit the youth development STEM programs of Sheltering Arms.<\/p>\n<p>“Thank you to all the sponsors, donors, and attendees for always supporting Fluent’s charitable efforts through this event,” said Mohit Singla, Chairman, Fluent Philanthropy. “We are proud to support the great work being done by the Sheltering Arms team and hope our contribution makes a difference in the STEM development of NYC youth.”<\/p>\n<p>These funds will be used to benefit the advancement of STEM education in afterschool programs implemented in a partnership with the NYC Department of Education.<\/p>\n<p>&#8220;We&#8217;re so grateful for Fluent’s support and are honored to be the beneficiary of the Golf Outing for the second consecutive year,” said Elizabeth McCarthy, CEO, Sheltering Arms. “From volunteering in our Early Childhood Education classrooms, to spreading awareness of the challenges faced by the youth we serve in foster care, Fluent&#8217;s ongoing and multi-faceted partnership helps support our mission of fostering a society where every child and family we serve will have the opportunity to succeed and thrive.”<\/p>\n<p>Since its inception in 2016, Fluent Philanthropy has been aware of the social responsibility to support its communities. Fluent’s efforts engage employees through service activities aimed at inspiring the next generation of leaders, raising over $500,000 for various charities and volunteering hundreds of hours. These beneficiaries include the Police Athletic League, Memorial Sloan Kettering, City Harvest and the Young Women’s Leadership Network.<\/p>\n<p>About Fluent, Inc.<br \/>\nFluent (NASDAQ: FLNT) is the trusted acquisition partner for both established and growing brands. Leveraging our proprietary first party data asset, Fluent creates marketing programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Founded in 2010, the company is headquartered in New York City. For more information, visit www.fluentco.com.<\/p>\n<p>About Sheltering Arms<br \/>\nAt Sheltering Arms, our goal is to foster a society where every child and family we serve will have the opportunity to succeed and thrive. We address the effects of social inequity in the most challenged communities in New York City. Our innovative programs and compassionate services measurably enhance the education, well-being, and development of children, their families, and communities. We have maintained an unwavering commitment to our mission since 1831.<\/p>\n<p>Contact Information:<br \/>\nInvestors:<br \/>\nJordyn Tarazi<br \/>\nFluent, Inc.<br \/>\n(646)356-8469<br \/>\nJTarazi@fluentco.com<\/p>\n<p>Media:<br \/>\nNorth 6th Agency, Inc.<br \/>\n(212)334-9753 ext. 143<br \/>\nfluent@n6a.com<\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[145],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7165"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}