{"id":7176,"date":"2018-07-17T10:24:16","date_gmt":"2018-07-17T10:24:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7176"},"modified":"2021-02-23T20:12:13","modified_gmt":"2021-02-23T20:12:13","slug":"fluent-inc-partners-with-mbolden","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-inc-partners-with-mbolden\/","title":{"rendered":"Fluent, Inc. Partners with mBolden to Champion Diversity and Inclusion in the Mobile Industry"},"content":{"rendered":"<p>NEW YORK, July 17, 2018 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2018\/07\/17\/1538299\/0\/en\/Fluent-Inc-Partners-with-mBolden-to-Champion-Diversity-and-Inclusion-in-the-Mobile-Industry.html\">GLOBE NEWSWIRE<\/a>) — Fluent, Inc. (NASDAQ:FLNT), a leading performance marketing company with an expertise in driving intelligent user acquisition for mobile apps, today announced that the Company has partnered with mBolden, formerly Women in Wireless, a trade organization that connects, inspires, and emboldens women in mobile and digital. Through this partnership, Fluent will work with mBolden to help provide members access to networking and educational opportunities to help propel careers forward.<\/p>\n<p>Fluent joins a prestigious list of corporate partners and sponsors, including Facebook, Viant, Microsoft, and Mindshare.<\/p>\n<p>“Our vision is to raise the voice and visibility of women and showcase leadership at every level,” said Sheryl Tullis, Global Co-President, mBolden. “Forward-leaning companies like Fluent are essential to help embolden women to achieve greater impact in our industry.”<\/p>\n<p>This partnership marks Fluent’s continued dedication to supporting employees learning and development as well as its commitment to spreading thought leadership.<\/p>\n<p>“We are thrilled to partner with mBolden, whose mission we very much respect and support as a mobile-first business dedicated to helping women succeed in the tech industry,” said Kelly Patterson, VP, Corporate Marketing, Fluent.<\/p>\n<p>About Fluent, Inc.<br \/>\nFluent (NASDAQ:FLNT) is the trusted acquisition partner for both established and growing brands. Leveraging our proprietary first party data asset, Fluent creates marketing programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Founded in 2010, the company is headquartered in New York City. For more information, visit www.fluentco.com.<\/p>\n<p>About mBolden<br \/>\nmBolden is a volunteer-run global non-profit whose mission is to champion of women in digital. With over 10,000 members in 10 chapters around the world we seek to connect, inspire and embolden a diverse representation of women so they may positively influence and lead. We achieve this through inspiring content and events, corporate and conference partnerships and training programs. We are dedicated to ensuring gender equality at industry conferences, created a Speakers Bureau featuring hundreds of qualified female speakers and offer a speaker training course at http:\/\/MadwomenUniversity.com. We also produce the MADWomen podcast featuring executive women sharing their career path, inspiration and lessons learned. For more information, visit http:\/\/www.wearembolden.org and follow us on Twitter, LinkedIn, Facebook.<\/p>\n<p>Contact Information:<br \/>\nInvestors:<br \/>\nJordyn Tarazi<br \/>\nFluent, Inc.<br \/>\n(646)356-8469<br \/>\nJTarazi@fluentco.com<\/p>\n<p>Media:<br \/>\nNorth 6th Agency, Inc.<br \/>\n(212)334-9753 ext. 143<br \/>\nfluent@n6a.com<\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[157,161],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7176"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7176"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7176"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7176"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}