{"id":7177,"date":"2018-06-26T10:26:16","date_gmt":"2018-06-26T10:26:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7177"},"modified":"2021-02-23T20:12:53","modified_gmt":"2021-02-23T20:12:53","slug":"fluent-inc-makes-data-available-for-programmatic","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-inc-makes-data-available-for-programmatic\/","title":{"rendered":"Fluent, Inc. Makes Health-Interest Data Available for Programmatic Targeting"},"content":{"rendered":"<p>NEW YORK, June 26, 2018 — Fluent, Inc.&nbsp;(NASDAQ:<a href=\"http:\/\/www.globenewswire.com\/News\/Listing?symbol=FLNT&amp;exchange=2\">FLNT<\/a>), a leading data-driven performance marketing company, today announced that it has made its 100% opt-in, first-party data available for programmatic targeting via&nbsp;<a title=\"LiveRamp\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=mncU2lFvg_iGpw8EaZmsWS0a3GZieBl99RHrsGQozHsmdMQVwNBaGF6QmtpzLe0QLM6UE3v7lBA1FIakAi7b8Q==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">LiveRamp<\/a><sup>®<\/sup>, an&nbsp;<a title=\"Acxiom\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=YhZPofBvPuHGHEV0YlKqW_b2MgsDdXokTEcqYXgazB2mmmP37KXApEVQlvaLp4BTBRIFl8t2BM1l_ukxB1x9cw==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Acxiom<\/a><sup>®<\/sup>&nbsp;company (NASDAQ:<a href=\"http:\/\/www.globenewswire.com\/News\/Listing?symbol=ACXM&amp;exchange=2\">ACXM<\/a>) and leading provider of identity resolution. Through this partnership, Fluent will make its syndicated audience data segments available for reaching consumers through the LiveRamp IdentityLink<sup>TM<\/sup>&nbsp;Data Store. Fluent’s offering called&nbsp;<em>Audience Now by Fluent<\/em><em>&nbsp;<\/em>meets a need for healthcare marketers who have increasingly demanded more accurate, self-declared health-related data to utilize in their advertising efforts. As a result of this partnership, consumers will receive more relevant and accurate messaging experiences based on their declared health interests.<\/p>\n<p>Since its inception in 2010, Fluent has amassed a database of self-declared insights from over 150 million opted-in U.S. consumers sourced across its network of proprietary websites that provide immersive experiences for consumers. A leader in performance marketing with an expertise in consumer engagement,&nbsp;<em>Audience Now by Fluent<\/em>, marks Fluent’s first foray into programmatic advertising.&nbsp;<em>Audience Now by Fluent<\/em><em>&nbsp;<\/em>enables health marketers to reach consumers in a more efficient, scalable, and privacy-safe way. Since the segments are decoupled from media, audiences are able to be targeted anywhere, including mobile, display, and connected TV.<\/p>\n<p>This product launch follows the formation of Fluent Health, the health marketing division, led by Brian Hogan, the former COO of LifeScript.<\/p>\n<p>“As programmatic has become more established, pharma and healthcare advertisers are more comfortable to embrace this channel,” said Hogan, “which presents a huge opportunity for Fluent and its unique first-party, self-declared dataset as there is increasing demand for verified, declared data, particularly in health marketing. Our expertise in engaging opted-in consumers at scale will be an advantage for our clients.”<\/p>\n<p>“We are seeing increased demand for declared data and specifically for specialized audiences such as health interest,” said Jeff Smith, GM of Brands and Agencies and CMO at LiveRamp. “We’re excited to partner with Fluent to make interest-based segments within the health vertical available to our brand, agency, and platform clients for people-based marketing.”<\/p>\n<p><em>Audience Now<\/em><em>™&nbsp;<\/em>data is voluntarily self-reported by opted-in consumers and anonymized. As it is not sourced from medical records or covered entities, it is not subject to HIPAA. Now, in the LiveRamp Data Store, this data is available directly to marketers and other data buyers, and audiences can be activated in advertisers’ preferred technology platforms and online publishers of choice.<\/p>\n<p>About Fluent, Inc.<br \/>\nFluent (NASDAQ:<a href=\"http:\/\/www.globenewswire.com\/News\/Listing?symbol=FLNT&amp;exchange=2\">FLNT<\/a>) is the trusted acquisition partner for both established and growing brands. Leveraging our proprietary first-party data asset, Fluent creates marketing programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Founded in 2010, the company is headquartered in New York City. For more information, visit&nbsp;<a title=\"www.fluentco.com\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=tfKD4sudTNrsXMS38J5Oijwu6Ba7O6pfLP7VanOGugB6b07ebMSTzN3CDhGhwj5MtpEhg2jZyVX6I-HL7D074g==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">www.fluentco.com<\/a>.<strong>&nbsp;<\/strong><\/p>\n<p align=\"justify\">Forward-Looking statements<br \/>\nThis press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. These forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations, including whether we will continue to have growth and expansion and whether programmatic will be a huge opportunity. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release and are advised to consider the factors listed above together with the additional factors under the heading “Forward-Looking Statements” and “Risk Factors” in the&nbsp; Annual Report on Form 10-K filed by Cogint, Inc., n\/k\/a Fluent, Inc. , as may be supplemented or amended by Fluent’s&nbsp; Quarterly Reports on Form 10-Q and other SEC filings. We undertake no obligation to publicly update or revise any forward-looking statement, whether because of new information, future events or otherwise, except as required by law.<\/p>\n<p>Contact Information:<strong><br \/>\n<\/strong>Investors:<br \/>\nJordyn Tarazi<br \/>\nFluent, Inc.<br \/>\n(646)356-8469<br \/>\n<a title=\"JTarazi@fluentco.com\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=_yVGBIivfFq_tx6NFzM6tMCpZHkXi7aLnFJ8EPYF5dDtxGnSTQ1vIzN_qXiOlwuSF7FJBsjnRlEWYVGoQTDK2k_j4vmF984mU89EHuRCVUc=\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">JTarazi@fluentco.com<\/a><\/p>\n<p>Media:<br \/>\nNorth 6th Agency, Inc.<br \/>\n(212)334-9753 ext. 143<br \/>\n<a title=\"fluent@n6a.com\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=1lI0-_cjCBbAwwJ4rukXFWULhkRarrnOVDh_2l0M4Pl6zDadhXuyOyXxb6Y9jmfhBwHoWsmU4ovAm0bR4x1nng==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">fluent@n6a.com<\/a><\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[147],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7177"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7177"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7177"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7177"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}