{"id":7178,"date":"2018-07-03T10:12:16","date_gmt":"2018-07-03T10:12:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7178"},"modified":"2021-02-23T19:28:51","modified_gmt":"2021-02-23T19:28:51","slug":"snapchat-story-ads","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/snapchat-story-ads\/","title":{"rendered":"Snapchat Story Ads Work: Here’s How to See Success in Seconds"},"content":{"rendered":"<p><em>Reposted from <a href=\"https:\/\/www.adweek.com\/digital\/snapchat-story-ads-work-heres-how-to-see-success-in-seconds\/\" target=\"_blank\" rel=\"noopener noreferrer\">Adweek<\/a><\/em><\/p>\n<p>A little over one year ago, small and midsized businesses won a battle against the duopoly of Google and Facebook when&nbsp;<a href=\"https:\/\/www.adweek.com\/tv-video\/snapchat-is-about-to-let-brands-of-all-sizes-buy-self-service-ads\/\" target=\"_blank\" rel=\"noopener noreferrer\">Snapchat introduced its self-service, programmatic ad platform<\/a>. The offering has quietly evolved, challenging acquisition specialists to develop a unique set of video advertising skills.<\/p>\n<p>From developing new ad products to weathering scandals and volatile stock prices, Snapchat still stands strong. The disappearing video application continues to&nbsp;<a href=\"https:\/\/www.emarketer.com\/content\/facebook-losing-younger-users-at-even-faster-pace?ecid=NL1001\" target=\"_blank\" rel=\"noopener noreferrer\">grow its user base<\/a>&nbsp;as younger demographics abandon other social media channels. Use Snapchat to diversify your marketing programs and engage the newest generation of consumers.<\/p>\n<h4>Snapchat raises the bar<\/h4>\n<p>With&nbsp;<a href=\"https:\/\/forbusiness.snapchat.com\/blog\/location\" target=\"_blank\" rel=\"noopener noreferrer\">187 million daily users opening the app an average of 25 times per day<\/a>, Snapchat reaches a hyperactive, highly engaged audience. The platform is taking in-app advertising to the next level, producing unprecedented conversion rates and return on investment, specifically when it comes to app installs and engagement.<\/p>\n<p>I have personal proof: Our own campaigns at&nbsp;<a href=\"https:\/\/www.adweek.com\/brand-marketing\/infographic-here-are-the-types-of-ads-super-bowl-li-viewers-are-most-looking-forward-to\/\" target=\"_blank\" rel=\"noopener noreferrer\">Fluent<\/a>&nbsp;have seen a 10 percent lift in conversion rate and 15 percent lift in ROI over Facebook advertising. Snapchat is a vital piece of our marketing plan.<\/p>\n<p>In recent developments, Snapchat’s addition of a<a href=\"https:\/\/www.adweek.com\/digital\/snapchat-is-doling-out-free-stats-to-brands-on-how-many-users-visit-their-locations\/\" target=\"_blank\" rel=\"noopener noreferrer\">udience insights<\/a>&nbsp;takes the platform one step closer to the interface and offerings provided by Facebook and Twitter.<\/p>\n<p>User-facing analytics was previously limited to views and screenshots—like the data provided to app users in the consumer-facing user experience—and this February rollout expanded the offering to view-time breakdowns and demographic audience data. To integrate with overall marketing campaigns, Snapchat now offers&nbsp;<a href=\"https:\/\/www.adweek.com\/digital\/snapchat-is-finally-opening-up-pixel-tracking-for-marketers-to-measure-cross-platform-stats\/\" target=\"_blank\" rel=\"noopener noreferrer\">pixels<\/a>&nbsp;that can be placed on websites for retargeting purposes and building lookalike audiences, and advertisers now have the option to upload email lists to match ads on a user level.<\/p>\n<p>Most important, Snapchat released a new ad format:&nbsp;<a href=\"https:\/\/forbusiness.snapchat.com\/blog\/introducing-story-ads-a-new-way-to-showcase-your-brand-or-product-in-discover\/\" target=\"_blank\" rel=\"noopener noreferrer\">Story Ads<\/a>. Fluent was lucky enough to test this format in beta, and our campaigns almost immediately turned a profit. Although it means more competition for the collection of advertisers who were using it in beta, this format was fully released to the platform in May.<\/p>\n<p>If you are a Snapchat user, you have likely experienced Story Ads, which appear under the Discover feed of the app. They feature a cover photo and headline, which tend to be heavy on the “clickbait.” Story Ads also feature your typical swipe up attachment, allowing users to view the snap and choose their own adventure by tapping through or swiping to a third-party experience.<\/p>\n<p>What’s the secret to success?<\/p>\n<h4>User-generated content is tried and true<\/h4>\n<p>As marketers have learned through native and other social advertising, the trick is camouflage. Blending your ads into the flow of the platform creates the illusion of influencer marketing. Facebook and Snapchat have taken steps to help advertisers keep the mask on, making the sponsored denotation small and inconspicuous. Ultimately, the responsibility lies with acquisition specialists to create appropriate content.<\/p>\n<p>When testing video ads to run in Snapchat Stories, the Fluent team leveraged the skills of our graphic designer to create polished, professional ads driving to swipe up attachments. (The attachments were content landing pages, most driving app installs.) The videos and GIFs featured sleek logos and smooth transitions—perfect for a Facebook advertisement. While these ads were moderately successful, we barely broke even when it came to ROI.<\/p>\n<p>After researching purchase behaviors, we discovered that most consumers learn about new products from social media, friends or family. It was that easy: We needed to be more relatable. We needed to identify ourselves as the target consumer’s friend. So, we took some selfies.<\/p>\n<p>We asked employees and friends of employees to take snaps of themselves while using the apps we advertise. A pretty face with money in-hand is the closest you can get to clickbait—Snapchat calls this “<a href=\"https:\/\/forbusiness.snapchat.com\/blog\/introducing-story-ads-a-new-way-to-showcase-your-brand-or-product-in-discover\/\" target=\"_blank\" rel=\"noopener noreferrer\">creating a curiosity gap<\/a>.” Yes, it worked.<\/p>\n<p>Demonstrating the app in real-time was effective, too, just like average Snapchat users would document their own lives. Simply put, imitate and iterate the content your target consumer enjoys on Snapchat organically.<\/p>\n<p>Although it is an older concept in the social media marketing world, UGC refers to creating campaigns focused on making your customers your best advocates. The authenticity of these campaigns drives higher consumer engagement and conversions. In&nbsp;<a href=\"https:\/\/www.recode.net\/2017\/5\/31\/15693686\/mary-meeker-kleiner-perkins-kpcb-slides-internet-trends-code-2017\" target=\"_blank\" rel=\"noopener noreferrer\">Mary Meeker’s 2017 Internet Trends Report<\/a>, she presented compelling data about UGC Instagram campaigns generating 6.9 times higher engagement than brand-generated content. I estimate that this number is even higher for Snapchat UGC campaigns.<\/p>\n<p>In technical tips, Snapchat reports that 60 percent of users have their sound on while in the app. Capitalize on this by intelligently overlaying audio.<\/p>\n<p>Snapchat recommends that the&nbsp;<a href=\"https:\/\/businesshelp.snapchat.com\/en-US\/article\/snap-ads-practices\" target=\"_blank\" rel=\"noopener noreferrer\">call to action is revealed within two seconds of the ad<\/a>, and that the ad itself lasts approximately five seconds.<\/p>\n<p>In Story Ads, you can feature three to 20 snaps; we’ve found at Fluent that our sweet spot is five to eight. Snapchat users consume content unbelievably fast and, as a marketer, you don’t have time to stop and look around.<\/p>\n<p><em>The above is a guest post for <a href=\"https:\/\/www.adweek.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Adweek<\/a> by Jonah Lovens, VP of Strategic Partnerships at <a href=\"https:\/\/www.fluentco.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Fluent, Inc.<\/a>&nbsp;<\/em><\/p>\n","protected":false},"featured_media":7860,"template":"","categories":[148],"tags":[162,163,164],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7178"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/7860"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7178"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7178"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7178"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}