{"id":7295,"date":"2018-09-02T12:45:16","date_gmt":"2018-09-02T12:45:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7295"},"modified":"2021-02-23T19:09:36","modified_gmt":"2021-02-23T19:09:36","slug":"fluent-joins-ana-council-for-data-integrity","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-joins-ana-council-for-data-integrity\/","title":{"rendered":"Fluent, Inc. Joins the ANA Council for Data Integrity &#038; IAB’s Data Transparency Standards Group"},"content":{"rendered":"<p align=\"left\">NEW YORK, Sept. 20, 2018 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2018\/09\/20\/1573696\/0\/en\/Fluent-Inc-Joins-the-ANA-Council-for-Data-Integrity-IAB-s-Data-Transparency-Standards-Group.html\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc.&nbsp;(NASDAQ: FLNT), a leading data-driven performance marketing company, today announced that it has joined the ANA Council for Data Integrity and IAB’s Data Transparency Standards Group.<\/p>\n<p>Brian Hogan, President of Fluent Health, has joined these organizations leading the charge on data transparency on Fluent’s behalf.&nbsp; With Fluent’s unique first-party data asset, Hogan will bring Fluent’s thought leadership to these organizations with the goal of providing transparency for brands and advertisers.<\/p>\n<p>“Providing more transparency to marketers and advertisers while protecting consumer data is essential for the maturity of the industry.&nbsp; Fluent is in a great position to lead this charge, as data transparency is an integral part of our business, especially in the programmatic landscape.&nbsp; We look forward to working with our colleagues and partners to provide thought leadership on this important issue,” said Brian Hogan, President of Fluent Health.<\/p>\n<p>The focus of the ANA Council for Data Integrity is on transparency and consumer data.&nbsp; Consumers demand relevant experiences and for marketers to meet and exceed those expectations they must use data-and use it well. Knowing the customer and their preferences and motivations is the most critical capability to delivering seamless, personalized experiences that generate relevance and value for the consumer while delivering brand affinity and results for the marketer. Properly recognizing the customer allows brands to create seamless cross-channel relationships based on trust.&nbsp; Additional council members include Acxiom, 1-800 Flowers.com, Experian, LiveRamp, United States Postal Service, Neustar, MediaMath, MetLife, and Oracle.<\/p>\n<p>“We are excited to have an industry leader like Fluent as part of our Council for Data Integrity.&nbsp; Marketers and agencies need a clear and standard understanding of the source and composition of data they are using. Transparency enables greater relevance and value to the consumer, with elevated integrity and responsibility,” said Tom Benton, Group Executive Vice President, Data Marketing &amp; Analytics Division, ANA. “With the acquisition of DMA by ANA, membership diversity, including marketing service and data providers like Fluent, enables this association to bring to market quickly data transparency standards that marketers, agencies and data companies all view as valuable and practical.”<\/p>\n<p>The IAB Data Benchmarks &amp; Data Transparency Standards Group intends to originate and build technical standards &#8211; in support of buyers, sellers, and vendors &#8211; aimed at making data &#8220;quality&#8221; consistently understandable, transparent, and comparable across vendors. Quality in this sense is defined as data that accurately assigns demographic, geographic, or behavioral attributes to an identified user.&nbsp; Additional group members include CBS Interactive, Criteo, Dentsu Aegis, Foursquare, Oath, Pandora, Publicis Media and The Trade Desk.<\/p>\n<p><strong>About Fluent, Inc.&nbsp;<\/strong><br \/>\nFluent (NASDAQ: FLNT) is the trusted acquisition partner for both established and growing brands. Leveraging our proprietary first-party data asset, Fluent creates marketing programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Founded in 2010, the company is headquartered in New York City. For more information, visit&nbsp;<a title=\"\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=mzqXllx10oZuBckt6Twjq0qCEx9PhHnxF9yrqlzVfrpezBKdT0nF8nTuDXDXPbSbcVEzJh4OF2ZrPoUv38DSTg==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><u>www.fluentco.com<\/u><\/a>.<\/p>\n<p><strong>About ANA<\/strong><br \/>\nThe ANA (Association of National Advertisers) makes a difference for individuals, brands, and the industry by driving growth, advancing the interests of marketers, and promoting and protecting the well-being of the marketing community. Founded in 1910, the ANA provides leadership that advances marketing excellence and shapes the future of the industry. The ANA’s membership includes nearly 2,000 companies with 25,000 brands that engage almost 150,000 industry professionals and collectively spend or support more than $400 billion in marketing and advertising annually. The membership is comprised of more than 1,100 client-side marketers and more than 800 marketing service provider members, which include leading marketing data science and technology suppliers, ad agencies, law firms, consultants, and vendors. Further enriching the ecosystem is the work of the nonprofit ANA Educational Foundation (AEF), which has the mission of enhancing the understanding of advertising and marketing within the academic and marketing communities.&nbsp; For more information, visit&nbsp;<a title=\"\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=Z7zDxrJ9Oh6DVve0Ii3z26vXyhwta_Jskd_vwKboQXWYF6X6GWJcTEhLqqAsorcRceHt1YYs1366laLpUhdmuA==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><u>www.thedma.org<\/u><\/a>.<\/p>\n<p><strong>About IAB<\/strong><br \/>\nThe Interactive Advertising Bureau (IAB) empowers the media and marketing industries to thrive in the digital economy. Its membership is comprised of more than 650 leading media and technology companies that are responsible for selling, delivering, and optimizing digital advertising or marketing campaigns. The trade group fields critical research on interactive advertising, while also educating brands, agencies, and the wider business community on the importance of digital marketing. In affiliation with the IAB Tech Lab, it develops technical standards and best practices. IAB and the IAB Education Foundation are committed to professional development and elevating the knowledge, skills, expertise, and diversity of the workforce across the industry. Through the work of its public policy office in Washington, D.C., IAB advocates for its members and promotes the value of the interactive advertising industry to legislators and policymakers. There are 43 IABs licensed to operate in nations around the world and one regional IAB, in Europe. Founded in 1996, the IAB is headquartered in New York City and has a San Francisco office.&nbsp; For more information, please visit&nbsp;<a title=\"\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=ftBoQZ-Lhlk2OZw79Fb7o_dr9ZInxaoPRycNbuQg9A3LzE-m_XHJ3j9fbIzXdmekOBBPlK-QXiSN4QDWq0J3uA==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><u>www.iab.com<\/u><\/a>.<\/p>\n<p><strong>Contact Information:&nbsp;<\/strong><br \/>\nInvestors:<br \/>\nJordyn Tarazi<br \/>\nFluent, Inc.<br \/>\n(646)356-8469<br \/>\n<a title=\"\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=q13Ah2OOCuq0AnCvm15NTrt1uBL2oppgv_07Y5qe987WBpjTbF-dD9EfjRK-2zWTB1fh-Su_RGVbQcwUQvXShA9o1KXaUi0ttXjK9d9MQ9s=\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><u>JTarazi@fluentco.com<\/u><\/a><\/p>\n<p>Media:<br \/>\nNorth 6th Agency, Inc.<br \/>\n(212)334-9753 ext. 143<br \/>\n<a title=\"\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=RhmQ8nMs-iG6KNSdjfDSfwEBkjkn0cdE5eQwNDCumwOdCydz1IRm1In6f_fF1_lp2lM8mlwSBcBGaEFnOXQ-lg==\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><u>fluent@n6a.com<\/u><\/a><\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[157,161],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7295"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7295"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7295"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7295"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}