{"id":7334,"date":"2018-10-02T12:50:16","date_gmt":"2018-10-02T12:50:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7334"},"modified":"2021-02-23T19:29:39","modified_gmt":"2021-02-23T19:29:39","slug":"dmn-40under40-2018","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/dmn-40under40-2018\/","title":{"rendered":"Fluent, Inc. Announces Ryan Schulke &#038; Matthew Conlin Named to DMN’s 2018 40Under40"},"content":{"rendered":"<p>NEW YORK, Oct. 02, 2018 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2018\/10\/02\/1588580\/0\/en\/Fluent-Inc-Announces-Ryan-Schulke-Matthew-Conlin-Named-to-DMN-s-2018-40Under40.html\" target=\"_blank\" rel=\"noopener noreferrer\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc. (NASDAQ: FLNT), a leading data-driven performance marketing company, today announced that its CEO, Ryan Schulke, and President, Matthew Conlin, have been recognized as DMN’s 2018 40Under40 winners. Each year DMN (Direct Marketing News) selects the 40 brightest, most ambitious, and fastest-rising marketers under the age of 40. An awards ceremony will be held on Tuesday, November 6, 2018 at the Dream Downtown Hotel in New York City.<\/p>\n<p>“Our inclusion in DMN’s 40Under40 is another milestone for this incredible team,” said Ryan Schulke, CEO. “In our first year as a standalone public company, we have continued to push the boundaries as marketers and disrupt the performance marketing industry, setting the stage for continued ambition and growth.”<\/p>\n<p>“As always, we want to thank our amazing team at Fluent for making it possible for Ryan and I to be included in DMN’s 40Under40,” said Matthew Conlin, President. “It is an honor to be recognized alongside such esteemed colleagues.”<\/p>\n<p>DMN has also recognized established and growing brands this year such as Marriott International, Epsilon, The Trade Desk, SAP, Experian and Fidelity Investments.<\/p>\n<p>About Fluent, Inc.<br \/>\nFluent (NASDAQ: FLNT) is the trusted acquisition partner for both established and growing brands. Leveraging our proprietary first-party data asset, Fluent creates marketing programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Founded in 2010, the company is headquartered in New York City. For more information, visit www.fluentco.com.<\/p>\n<p>About DMN<br \/>\nDMN covers all aspects of digital and data-driven marketing. A resource for marketing and senior sales professionals, the core audience consists mostly of decision-makers and key influencers within their organizations. Readers depend on our brand for unbiased, clear, incisive reporting on the topics that matter most to their profession, including innovative use of data, strategy, and technology across all marketing channels. DMN delivers content via newsletters, eBooks, webcasts, podcasts, and custom projects\/publications, as well as at DMNews.com. It hosts a number of live events (such as our annual 40Under40 Marketing Awards, the DMN Awards, and the DMN Marketing Hall of Femme), and the editors can be found at many marketing trade shows throughout the year. For more information, visit www.dmnews.com.<\/p>\n<p>Contact Information:<br \/>\nInvestors:<br \/>\nJordyn Tarazi<br \/>\nFluent, Inc.<br \/>\n(646)356-8469<br \/>\nJTarazi@fluentco.com<\/p>\n<p>Media:<br \/>\nNorth 6th Agency, Inc.<br \/>\n(212)334-9753 ext. 143<br \/>\nfluent@n6a.com<\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[151],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7334"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7334"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7334"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7334"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}