{"id":7899,"date":"2019-06-19T12:50:16","date_gmt":"2019-06-19T12:50:16","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=7899"},"modified":"2021-02-23T20:17:28","modified_gmt":"2021-02-23T20:17:28","slug":"fluent-inc-announces-signing-of-definitive-agreement-to-acquire-adparlor","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-inc-announces-signing-of-definitive-agreement-to-acquire-adparlor\/","title":{"rendered":"Fluent, Inc. Announces Signing of Definitive Agreement to Acquire AdParlor"},"content":{"rendered":"\n<h4 style=\"text-align:center\">The acquisition will expand Fluent’s Managed Media Buying, Creative Services, and Campaign Execution Platform<\/h4>\n\n\n\n<p>NEW YORK, June 19, 2019 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2019\/06\/19\/1871162\/0\/en\/Fluent-Inc-Announces-Signing-of-Definitive-Agreement-to-Acquire-AdParlor.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"GLOBE NEWSWIRE (opens in a new tab)\">GLOBE NEWSWIRE<\/a>) &#8212;&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=UdoSFmJu9MyDf7anEA1Td_yUM80G7tsWs2_N4li7FESDQIn7ilz_JnvFwuOl7e8467tZfZpCq_RM1Nvaof7zlQ==\" target=\"_blank\">Fluent, Inc.<\/a>&nbsp;(<a rel=\"noreferrer noopener\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=Az5Zc354PFlKQlwQu4DM6iim7fx1A8kzIsQjNMwCnAqxhMMhfDMSihrcFrz3TwQskEQlhlNcb76kkBKAf6VlxJgRrtnq_89LPxd8yVZl3vk=\" target=\"_blank\">NASDAQ: FLNT<\/a>), a leading data-driven performance marketing company today announced the signing of a definitive agreement to acquire substantially all of the assets of AdParlor Holdings, Inc. and certain of its subsidiaries (collectively, “AdParlor”), a digital advertising solution for social media buying.<br><\/p>\n\n\n\n<p>“I am thrilled to welcome Evan Conway and the AdParlor team,” said Ryan Schulke, CEO of Fluent. “The combination of their high-touch approach to managing digital strategies with tech-enabled media buying and our scalable, first-party, self-declared data asset creates a unique value proposition for performance-focused and growth-minded brands.”<\/p>\n\n\n\n<p>With the addition of AdParlor, Fluent will expand its performance-based marketing capabilities into the broader digital ecosystem. AdParlor’s expertise in developing social media strategy, planning, and buying will enable Fluent to extend its reach into alternative digital channels beyond its portfolio of websites. AdParlor also provides additional client service experience and product capabilities, as well as personalized creative design and testing across channels, to drive actionable insights.<\/p>\n\n\n\n<p>“We have worked hard to build a team and a company that specializes in delivering performance for our customers on social networks, and we are excited to be joining the Fluent family,” said Evan Conway, CEO of AdParlor. “Our customer-focused approach will be enhanced by leveraging Fluent’s proprietary technology and resources, allowing us to provide more value across social channels, and leverage greater personalization and measurement capabilities.”<\/p>\n\n\n\n<p>Fluent and AdParlor, together, create a new approach to blending media buying with tailored program design and execution, resulting in measurable outcomes for their clients.<\/p>\n\n\n\n<p>For more information please visit&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=Z7lIMM8eUJe1NS4XIN12-KqnrWjomMGelF4QI804D2N6rq88zrTD0Ab0HjCL4iteCmKLrSdaDF-9ffcdl5rG8uc0RBxDMCbJ9ueP-4qJb6I=\" rel=\"noreferrer noopener\" target=\"_blank\">https:\/\/www.fluentco.com<\/a>.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>About AdParlor<\/strong><br>Founded in 2008, AdParlor is uniquely positioned at the intersection of media buying and creative. AdParlor’s 10+ year reputation and high-touch approach to managing digital strategies with a best-in-class, tech-enabled media buying team drives success for performance-focused clients. AdParlor maintains strategic partnerships with the leading social networking platforms. For more information, visit&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=Z7lIMM8eUJe1NS4XIN12-PW0rJSevGaaisJsDUplsS-BEf2pvB08d3M_4PFx4knY_QTmVf89yn039iDMG_-Ich1lMJMXoaE_yLrNBxrjjNg=\" rel=\"noreferrer noopener\" target=\"_blank\">http:\/\/www.adparlor.com<\/a>.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><br>This press release contains &#8220;forward-looking statements,&#8221; as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as &#8220;expects,&#8221; &#8220;plans,&#8221; &#8220;projects,&#8221; &#8220;will,&#8221; &#8220;may,&#8221; &#8220;anticipate,&#8221; &#8220;believes,&#8221; &#8220;should,&#8221; &#8220;intends,&#8221; &#8220;estimates,&#8221; and other words of similar meaning. These statements include statements regarding the intent, belief or current expectations or anticipations of Fluent and members of its management team regarding the expected benefits from the acquisition.&nbsp; Factors currently known to management that could cause actual results to differ materially from those in forward-looking statements include the following: the potential failure of closing conditions; the retention of key employees of AdParlor; the ability of Fluent to successfully integrate AdParlor to achieve expected benefits; the ability to maintain and grow key AdParlor client relationships; the ability to develop new products and services and enhance existing ones; competition; the potential effects of existing and new laws, rules or regulations; failure to maintain the integrity of systems and infrastructure through integration; and failure to adequately protect intellectual property rights or allegations of infringement of intellectual property rights. Such forward looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading &#8220;Forward-Looking Statements&#8221; and &#8220;Risk Factors&#8221; in the Company&#8217;s Annual Report on Form 10-K, as may be supplemented or amended by the Company&#8217;s Quarterly Reports on Form 10-Q and other&nbsp;SEC&nbsp;filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:<\/strong><\/p>\n\n\n\n<p>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=ZH_Vr8avegUunlZnGur-SYHKncZi39mkZrNfsESVz1Ku-cQ9dqkF9PLast1L2t9shxGQZPwv55Mmtz-1sPbknprpBPgYTOrw9qWT29tEb1v8WHWefVEmmp873xpSWWg9\" rel=\"noreferrer noopener\" target=\"_blank\">InvestorRelations@fluentco.com<\/a><\/p>\n\n\n\n<p>Walker Sands Communications<br>Liza Massingberd<br>312-319-7666<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=LvGHBQLGUnattWyM1R-GhymepCMRwr3LYDUVZbOgNtTQdTG0JYiq2AcqYW24MIlwf3ORcHaxmbptmRrMAO0kcyRmjuD9GOhciLkdYhi7Yx-nFbmdHGAlLdDOc4XLlYdc\" rel=\"noreferrer noopener\" target=\"_blank\">liza.massingberd@walkersands.com<\/a><\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[153,169],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/7899"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=7899"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=7899"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=7899"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}