{"id":8145,"date":"2019-11-19T17:15:17","date_gmt":"2019-11-19T17:15:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8145"},"modified":"2021-02-23T20:29:57","modified_gmt":"2021-02-23T20:29:57","slug":"fluent-activeprospect-partnership","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-activeprospect-partnership\/","title":{"rendered":"Fluent Partners with ActiveProspect to Certify Web Leads for TCPA Compliance"},"content":{"rendered":"\n<p>NEW YORK—November 19, 2019 (<a href=\"https:\/\/www.globenewswire.com\/news-release\/2019\/11\/19\/1949648\/0\/en\/Fluent-Partners-with-ActiveProspect-to-Certify-Web-Leads-for-TCPA-Compliance.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"GLOBE NEWSWIRE (opens in a new tab)\">GLOBE NEWSWIRE<\/a>)— <a rel=\"noreferrer noopener\" aria-label=\"Fluent, Inc. (opens in a new tab)\" href=\"https:\/\/www.fluentco.com\/\" target=\"_blank\">Fluent, Inc.<\/a> (<a rel=\"noreferrer noopener\" aria-label=\"NASDAQ: FLNT (opens in a new tab)\" href=\"https:\/\/www.nasdaq.com\/market-activity\/stocks\/flnt\" target=\"_blank\">NASDAQ: FLNT<\/a>), a leading data-driven performance marketing company, is partnering with ActiveProspect, a SaaS provider of real-time lead optimization and compliance solutions, to independently certify its web leads using ActiveProspect’s TrustedForm product.<\/p>\n\n\n\n<p>With the rise of federal regulations such as\nthe Telephone Consumer Protection Act (TCPA), companies are increasingly\nrequired to document proof of prior express written consent to contact\nconsumers. Fluent has been and continues to be committed to verifying consent\nand staying ahead of changes in the legal and regulatory environment,\nparticularly as it relates to data privacy and consumer choice. <\/p>\n\n\n\n<p>Fluent interacts with over 700,000 consumers daily, using enhanced surveying techniques to build robust user-profiles and gather and document opt-in consent required under the TCPA. Helping Fortune 100 companies with their strategic user acquisition initiatives, Fluent leverages intelligent targeting to provide advertisers with verified leads on a massive scale. “By implementing ActiveProspect’s TrustedForm technology across our portfolio of owned and operated media properties, Fluent is able to provide our advertisers best in class proof of consent,” said Jeffrey Kauffman, Associate General Counsel, Litigation, Regulatory &amp; Privacy at Fluent. <\/p>\n\n\n\n<p>Providing the highest standard of independent\nproof of consent available, TrustedForm issues a unique certificate that is\nstored with each lead record and includes a video replay of the consumer’s\ninteraction with the web page when they submit a contact form. “TrustedForm has rapidly gained adoption across many\nindustries by protecting companies from costly TCPA violations. Partnering with\nFluent solidifies TrustedForm as the leader for TCPA consent documentation,”\nsaid Steve Rafferty, Founder and CEO of ActiveProspect. <\/p>\n\n\n\n<p><strong>About\nFluent <\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading\nperformance marketing company with an expertise in creating meaningful\nconnections between consumers and brands. Leveraging our proprietary\nfirst-party data asset of opted-in consumer profiles, Fluent, Inc. drives\nintelligent growth strategies that deliver superior outcomes. Founded in 2010,\nthe company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>About\nActiveProspect<\/strong><\/p>\n\n\n\n<p>ActiveProspect is an Austin-based marketing SaaS company that provides real-time lead optimization and compliance solutions for companies engaged in online lead generation. We give companies the insight and control to take real-time action on their leads. Our suite of products (LeadConduit, TrustedForm and SuppressionList) are used to filter out unwanted leads, document consent for TCPA compliance, and improve conversion rates. We’ve proudly processed over 2B leads for well known brands across a variety of industries. Our TrustedForm lead certification service captures ten billion user events every month across thousands of websites. For more information go to <a rel=\"noreferrer noopener\" aria-label=\"activeprospect.com (opens in a new tab)\" href=\"https:\/\/activeprospect.com\/\" target=\"_blank\">activeprospect.com<\/a>.<\/p>\n\n\n\n<p><strong>Contact Information:&nbsp;<\/strong><br>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a href=\"mailto:InvestorRelations@fluentco.com%C2%A0\">InvestorRelations@fluentco.com&nbsp;<\/a><\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[157],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8145"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8145"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8145"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}