{"id":8196,"date":"2019-12-12T14:01:17","date_gmt":"2019-12-12T14:01:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8196"},"modified":"2021-02-23T20:17:54","modified_gmt":"2021-02-23T20:17:54","slug":"barbara-shattuck-kohn-board-announcement","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/barbara-shattuck-kohn-board-announcement\/","title":{"rendered":"Fluent, Inc. Appoints Barbara Shattuck Kohn to Board of Directors"},"content":{"rendered":"\n<h4>Longtime Director of Penn National Gaming, Inc. joins Fluent Board<\/h4>\n\n\n\n<p>NEW YORK, Dec. 11, 2019 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2019\/12\/11\/1959558\/0\/en\/Fluent-Inc-Appoints-Barbara-Shattuck-Kohn-to-Board-of-Directors.html\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc. (NASDAQ: FLNT), a leading data-driven performance marketing company, today announced that the Board of Directors of the Company has appointed Barbara Shattuck Kohn as a Director of the Company. Ms. Shattuck Kohn will serve as a member of the Audit Committee, Compensation Committee and Nominating and Corporate Governance Committee of the Board of Directors.<\/p>\n\n\n\n<p>“With her remarkable financial background and significant public company board experience, Barbara brings a new level of expertise to our Board of Directors,” said Ryan Schulke, Chief Executive Officer. “We are incredibly pleased to welcome her to the Fluent team and look forward to her thoughtful advice as we continue to grow and evolve our business.”<\/p>\n\n\n\n<p>Ms. Shattuck Kohn has a wealth of experience in financial and strategic advisory roles, having co-founded investment banking firms, Cain Brothers, Shattuck &amp; Company, Inc. and Shattuck Hammond Partners, the latter of which was acquired by Morgan Keegan &amp; Company Inc. in 2007 and Raymond James Financial in 2012. Ms. Shattuck Kohn has also served as a director of Penn National Gaming, Inc. since 2004. Ms. Shattuck Kohn also serves as a director of Emblem Health, one of the nation&#8217;s largest non-profit health plans, and previously served as a director of Computer Task Group and a division of Sunlife Financial Corporation.<\/p>\n\n\n\n<p>“I am grateful for the opportunity to join Fluent’s Board of Directors and to help advise the Company as it fortifies its long-term growth strategies,” said Ms. Shattuck Kohn. “I look forward to working with the Fluent management team and am excited about the future of the Company.”<\/p>\n\n\n\n<p>The appointment of Ms. Shattuck Kohn is the latest in a number of moves by the Company to expand its public company expertise and focus on its long-term growth strategies.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking statements<\/strong><br>This press release contains &#8220;forward-looking statements,&#8221; as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as &#8220;expects,&#8221; &#8220;plans,&#8221; &#8220;projects,&#8221; &#8220;will,&#8221; &#8220;may,&#8221; &#8220;anticipate,&#8221; &#8220;believes,&#8221; &#8220;should,&#8221; &#8220;intends,&#8221; &#8220;estimates,&#8221; and other words of similar meaning. Such forward looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading &#8220;Forward-Looking Statements&#8221; and &#8220;Risk Factors&#8221; in the Company&#8217;s Annual Report on Form 10-K, as may be supplemented or amended by the Company&#8217;s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:&nbsp;<br><\/strong>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=ckQKs3WHb9qQL2bYczjHq3GJ7wlz4AWInsWM3oKiZSudCg3MSPHAm9xevbKiUkDWtex54afRPrA1a7XQeVM2V4bkjwbtyXzvHVl3U_GWmfP5LHaqMsk-0acsNp1Gv_sf\" rel=\"noreferrer noopener\" target=\"_blank\">InvestorRelations@fluentco.com<\/a><\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[153,170],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8196"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8196"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8196"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8196"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}