{"id":8335,"date":"2020-03-25T17:34:17","date_gmt":"2020-03-25T17:34:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8335"},"modified":"2021-02-23T20:19:52","modified_gmt":"2021-02-23T20:19:52","slug":"fluent-ad-council-partnership","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-ad-council-partnership\/","title":{"rendered":"Leading Digital and Tech Platforms Join Ad Council, White House, HHS and CDC to Address COVID-19 Crisis"},"content":{"rendered":"\n<h4>Digital and Technology Platforms Create Pro Bono Content, Donate Ad Space to Help Share Critical and Urgent COVID-19 Messaging <\/h4>\n\n\n\n<p><em>Reposted from the <a href=\"https:\/\/www.adcouncil.org\/News-Events\/Press-Releases\/Leading-Digital-and-Tech-Platforms-Join-Ad-Council-White-House-HHS-and-CDC-to-Address-COVID-19-Crisis\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Ad Council<\/a><\/em> <\/p>\n\n\n\n<p>In response to the COVID-19 pandemic, the Ad Council, White House, U.S. Department of Health and Human Services (HHS) and Centers for Disease Control and Prevention (CDC) announced today that they are partnering with leading digital and technology platforms, including Amazon, Apple, Facebook, Google, SiriusXM and Pandora, Pinterest, Snapchat, TikTok, Twitter and Verizon Media, among others, to extend the reach and impact of critical COVID-19 response messaging. From custom filters to emojis to influencer content, digital and technology partners are leveraging their tools to connect their audiences with life-saving messages to help slow the spread of the virus.<\/p>\n\n\n\n<p>&#8220;We have seen the media industry come together time and time again to address the most critical issues facing our country, and the COVID-19 pandemic is no exception,&#8221; said&nbsp;Lisa Sherman, president &amp; CEO of the Ad Council. &#8220;These digital and technology platforms have generously donated their talents and reach to empower millions of Americans to stay safe, informed and connected.&#8221;<\/p>\n\n\n\n<p>This most recent announcement is part of the Ad Council&#8217;s ongoing response to the COVID-19 crisis, convening the country&#8217;s largest digital platforms and broadcast media networks to ensure the American public is receiving crucial and vetted information during this unprecedented time.<\/p>\n\n\n\n<p>While each platform is providing customized support, the common goal is to drive audiences to&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2760745-1&amp;h=2110339644&amp;u=http%3A%2F%2Fwww.coronavirus.gov%2F&amp;a=www.coronavirus.gov\" rel=\"noreferrer noopener\" target=\"_blank\">www.coronavirus.gov<\/a>, a centralized resource from HHS and the CDC, which includes up-to-date information on the COVID-19 crisis.<\/p>\n\n\n\n<h4><strong>Donated Media<\/strong><\/h4>\n\n\n\n<p><\/p>\n\n\n\n<ul><li><strong>Amazon, Apple, Facebook, Group Nine Media, Google, Pluto TV, Pinterest, TikTok, TrueX, WarnerMedia, Xandr and YouTube&nbsp;<\/strong>are providing&nbsp;significant donated media space to run and amplify campaign assets, getting urgent messaging to audiences nationwide on the platforms they use daily.<\/li><li><strong>Cadreon, EMX,&nbsp;a division of Engine Group,<\/strong>&nbsp;<strong>and The Trade Desk&nbsp;<\/strong>are building Private Marketplaces for publishers to donate media inventory.&nbsp;<strong>Acxiom, Crossix and Fluent<\/strong>&nbsp;are donating audience targeting segments through&nbsp;<strong>LiveRamp<\/strong>&nbsp;to help reach millennials and those who are at higher risk for COVID-19.<\/li><li><strong>DoubleVerify and IAS<\/strong>&nbsp;are levering their ad blocking technologies to serve campaign messages across a breadth of publisher sites.<\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h4><strong>Influencer Engagement<\/strong><\/h4>\n\n\n\n<p><\/p>\n\n\n\n<ul><li>Popular talent – including&nbsp;<strong>Noah Cyrus,&nbsp;Taylor Bennet,&nbsp;Michelle Williams,&nbsp;Giannina Gibelli&nbsp;(&#8220;Love is Blind&#8221;),&nbsp;Shubham Goel&nbsp;(&#8220;The Circle&#8221;) and&nbsp;Joey Sasso&nbsp;(&#8220;The Circle&#8221;)&nbsp;<\/strong>– are starring in an upcoming PSA around social distancing. The new PSA, created in partnership with&nbsp;Pereira O&#8217;Dell, will be supported by donated media from&nbsp;<strong>Facebook&nbsp;<\/strong>and<strong>&nbsp;Google\/YouTube<\/strong>.<\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h4><strong>Custom Content Creation<\/strong><\/h4>\n\n\n\n<p><\/p>\n\n\n\n<ul><li><strong>Pandora&nbsp;<\/strong>and its Studio Resonate audio creative consultancy&nbsp;will be creating custom audio assets that will run across Pandora and SoundCloud and be available for all media partners to download.&nbsp;This is in addition to donated media.<\/li><li><strong>Reddit&nbsp;<\/strong>will be creating an interactive, custom campaign that will be supported by significant donated media, including its new &#8220;Trending Takeover&#8221; unit and a &#8220;Front Page Takeover.&#8221;<\/li><li><strong>Snapchat<\/strong>&nbsp;will be featuring #AloneTogether creative throughout its platform. Snapchat reaches 90% of 13-24 year olds in the U.S. on a daily basis. The content will be featured in its new &#8220;Here for You&#8221; section of the app, which will include PSAs from health experts. Snapchat is also donating two custom filters, designed by Snap&#8217;s creative team, to encourage people to stay connected while they are at home practicing social distancing. This is in addition to donated media.<\/li><li><strong>Twitter&nbsp;<\/strong>is developing a custom emoji for the Alone Together hashtag.<\/li><li><strong>Verizon Media<\/strong>&nbsp;is donating substantial media and creating custom #AloneTogether content to be shared across social media and its ecosystem of brands, including Yahoo News, Yahoo Lifestyle, Huffington Post and In the Know.<\/li><\/ul>\n\n\n\n<p>Additional platforms joining the cause by creating custom content and donating media to help amplify critical COVID-19 information include Audiomack, Brat, Bustle Digital Group, Chegg, eBay, Genies, Gfycat, GumGum, IBM Weather, Insider Inc., Jebbit, Kahoot, Nextdoor, Philo, Samsung Ads, Teads, TubiTV, TuneIn, Twitch, Whisper and Zynga.<\/p>\n\n\n\n<h4><strong>Partner Quotes<\/strong><\/h4>\n\n\n\n<p>&#8220;We are always at our best when we respond to challenges as a community,&#8221; said&nbsp;<strong>Tara Walpert Levy, Vice President, Agency and Brand Solutions, Google and YouTube.&nbsp;<\/strong>&#8220;Right now, helping people get the right information to stay healthy is more important than ever. We are proud to continue to support the work of the Ad Council and the industry and will keep doing everything we can to help people take care of themselves and their communities during this unprecedented time.&#8221;<\/p>\n\n\n\n<p>&#8220;Pandora is honored to partner with the Ad Council to raise awareness of the COVID-19 crisis among the millions of Americans on our platform and beyond, leveraging the audio creative expertise of our Studio Resonate team,&#8221; said&nbsp;<strong>Steven Kritzman, SVP of sales at Pandora.<\/strong>&nbsp;&#8220;As the industry comes together in this unprecedented time of need, it&#8217;s more important than ever to support these critical messages to help slow the spread and save lives.&#8221;<\/p>\n\n\n\n<p>&#8220;Public health officials have made clear how important it is that young people take this seriously &#8212; and that they have a key role to play in helping stop the spread,&#8221; said&nbsp;<strong>Jennifer Stout, VP of Global Public Policy at Snap Inc.<\/strong>&nbsp;&#8220;We are committed to helping Snapchatters do their part, by providing fact-based news and information from trusted sources on our content platform, along with creative tools and experiences that help raise awareness for our community to protect themselves, their loved ones and the greater public.&#8221;<\/p>\n\n\n\n<h4><strong>The Ad Council<\/strong><\/h4>\n\n\n\n<p>The Ad Council has a long history of creating life-saving public service communications in times of national crisis, starting in the organization&#8217;s earliest days during World War II to&nbsp;September 11<sup>th<\/sup>&nbsp;and natural disasters like Hurricane Katrina and Hurricane Sandy. Its deep relationships with media outlets, the creative community, issue experts and government leaders make the organization uniquely poised to quickly distribute life-saving information to millions of Americans.<\/p>\n\n\n\n<p>The Ad Council is where creativity and causes converge. The non-profit organization brings together the most creative minds in advertising, media, technology and marketing to address many of the nation&#8217;s most important causes. The Ad Council has created many of the most iconic campaigns in advertising history. Friends Don&#8217;t Let Friends Drive Drunk.&nbsp;Smokey Bear. Love Has No Labels.<\/p>\n\n\n\n<p>The Ad Council&#8217;s innovative social good campaigns raise awareness, inspire action and save lives. To learn more, visit&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2760745-1&amp;h=3857988414&amp;u=http%3A%2F%2Fwww.adcouncil.org%2F&amp;a=AdCouncil.org\" rel=\"noreferrer noopener\" target=\"_blank\">AdCouncil.org<\/a>, follow the Ad Council&#8217;s communities on&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2760745-1&amp;h=1341406679&amp;u=http%3A%2F%2Fwww.facebook.com%2Fadcouncil&amp;a=Facebook\" rel=\"noreferrer noopener\" target=\"_blank\">Facebook<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2760745-1&amp;h=1220354081&amp;u=http%3A%2F%2Fwww.twitter.com%2Fadcouncil&amp;a=Twitter\" rel=\"noreferrer noopener\" target=\"_blank\">Twitter<\/a>, and view the creative on&nbsp;<a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2760745-1&amp;h=2229069060&amp;u=http%3A%2F%2Fwww.youtube.com%2Fadcouncil&amp;a=YouTube\" rel=\"noreferrer noopener\" target=\"_blank\">YouTube<\/a>.<\/p>\n","protected":false},"featured_media":8336,"template":"","categories":[144],"tags":[157],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8335"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8336"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8335"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8335"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8335"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}