{"id":8340,"date":"2020-03-31T13:28:17","date_gmt":"2020-03-31T13:28:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8340"},"modified":"2021-02-23T20:20:19","modified_gmt":"2021-02-23T20:20:19","slug":"fluent-pulse-covid-19-announcement","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/fluent-pulse-covid-19-announcement\/","title":{"rendered":"New COVID-19 U.S. Consumer Sentiment Survey Reveals a 70% Spike in Overall Nervousness among American Adults Over the Last 20 Days"},"content":{"rendered":"\n<p class=\"has-text-align-left\"><strong><em>Fluent, Inc. launches weekly “Fluent Pulse” survey to track impact of COVID-19 on consumers’ daily lives<\/em><\/strong><\/p>\n\n\n\n<p>NEW YORK&#8211;(<a href=\"https:\/\/www.businesswire.com\/news\/home\/20200331005237\/en\/New-COVID-19-U.S.-Consumer-Sentiment-Survey-Reveals\">BUSINESS WIRE<\/a>)&#8211;March 31, 2020&#8211;Fluent, Inc. (NASDAQ: FLNT), a leading performance marketing company, today announced the launch of&nbsp;<strong><a href=\"https:\/\/fluentpulse.com\/\">Fluent Pulse<\/a><\/strong>, an ongoing insights initiative designed to track consumer sentiment and impact on everyday life as it relates to the COVID-19 outbreak. For its first installment of Fluent Pulse, Fluent conducted a survey of over 1.85 million opted-in U.S. adults. As of March 30, the survey revealed a 70% spike in overall nervousness over the last 20 days among Americans ages 18+. Of those, 46% of U.S. consumers surveyed reported being somewhat nervous or very nervous about the COVID-19 pandemic, compared to only 27% of consumers reporting this same sentiment two weeks prior.<\/p>\n\n\n\n<p>In addition to overall sentiment, Fluent Pulse will measure and track consumers’ compliance with social distancing recommendations, satisfaction with the Trump administration’s handling of the crisis and shifts in buying behavior and leisure activities, among other sentiments. Fluent Pulse also found that 83% of consumers are more concerned with the health of their families and fellow Americans than they are with their personal finances or the overall U.S. economy.<\/p>\n\n\n\n<p>Interacting with nearly a million Americans daily, Fluent is uniquely able to leverage its real-time survey and analytics capabilities to help businesses and municipalities better support people during this uncertain and rapidly changing period.<\/p>\n\n\n\n<p>“As one of the largest independent surveyors of consumers in the world, we believe it is our responsibility to offer access to timely and reliable insights that will better enable businesses, governments and other service providers to establish connections and offer support during this unprecedented time,” said Matthew Conlin, President of Fluent. “As people around the country are instructed to socially distance, our hope is that Fluent Pulse will allow us to monitor awareness, preparedness and overall impact so that our business partners and governmental authorities can rally to support those most in need. Everyone here at Fluent understands that stopping this pandemic requires all hands on deck, and we are proud to contribute our media inventory, survey capabilities and personnel to this collective effort.”<\/p>\n\n\n\n<p>The company’s goal is for Fluent Pulse to poll over 5 million Americans on COVID-19-related topics by the end of April using its own advertising inventory.<\/p>\n\n\n\n<p>For this first installment, Fluent Pulse insights were collected from March 10<sup>th<\/sup>&nbsp;through March 30<sup>th<\/sup>, via Fluent&#8217;s portfolio of owned and operated media properties. Sourced from a geographically diverse population of respondents, results are specific to the Fluent audience and not reflective of the general U.S. population.<\/p>\n\n\n\n<p>All forthcoming survey insights will be hosted at&nbsp;<a rel=\"noreferrer noopener\" target=\"_blank\" href=\"https:\/\/cts.businesswire.com\/ct\/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.fluentpulse.com%2Fcovid-19&amp;esheet=52196726&amp;newsitemid=20200331005237&amp;lan=en-US&amp;anchor=www.fluentpulse.com%2Fcovid-19&amp;index=1&amp;md5=42e9c9fc983da2d123a4f45ef7a3e85a\">www.fluentpulse.com\/covid-19<\/a>&nbsp;and will provide an ongoing evaluation of public sentiment over time. Fluent Pulse will publish new insights each Tuesday morning along with consumers’ reactions to other milestone events that may occur outside of this cycle. Survey results are intended to provide actionable insight into general sentiment around the outbreak as well as impact on the general population.<\/p>\n\n\n\n<div id=\"metaslider-id-8344\" style=\"max-width: 900px;\" class=\"ml-slider-3-20-3 metaslider metaslider-flex metaslider-8344 ml-slider  alignnormal\">\n    <div id=\"metaslider_container_8344\">\n        <div id=\"metaslider_8344\">\n            <ul aria-live=\"polite\" class=\"slides\">\n                <li style=\"display: block; width: 100%;\" class=\"slide-8345 ms-image\"><img src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/03\/Img__Nervousness-900x500.jpg\" height=\"500\" width=\"900\" alt=\"COVID-19 Nervousness\" class=\"slider-8344 slide-8345\" title=\"Img__Nervousness\" \/><\/li>\n                <li style=\"display: none; width: 100%;\" class=\"slide-8347 ms-image\"><img src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/03\/Press_Img__Nervousness_Map_-_Double-900x500.jpg\" height=\"500\" width=\"900\" alt=\"COVID-19 Nervous Map\" class=\"slider-8344 slide-8347\" title=\"Press_Img__Nervousness_Map_-_Double\" \/><\/li>\n                <li style=\"display: none; width: 100%;\" class=\"slide-8346 ms-image\"><img src=\"https:\/\/www.fluentco.com\/wp-content\/uploads\/2020\/03\/Press_Img__Nervous_Subjects_1-900x500.jpg\" height=\"500\" width=\"900\" alt=\"COVID-19 Nervous Subjects\" class=\"slider-8344 slide-8346\" title=\"Press_Img__Nervous_Subjects_1\" \/><\/li>\n            <\/ul>\n        <\/div>\n        \n    <\/div>\n<\/div>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking statements<\/strong><\/p>\n\n\n\n<p>This press release contains &#8220;forward-looking statements,&#8221; as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as &#8220;expects,&#8221; &#8220;plans,&#8221; &#8220;projects,&#8221; &#8220;will,&#8221; &#8220;may,&#8221; &#8220;anticipate,&#8221; &#8220;believes,&#8221; &#8220;should,&#8221; &#8220;intends,&#8221; &#8220;estimates,&#8221; and other words of similar meaning. Such forward looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading &#8220;Forward-Looking Statements&#8221; and &#8220;Risk Factors&#8221; in the Company&#8217;s Annual Report on Form 10-K, as may be supplemented or amended by the Company&#8217;s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contacts<\/strong><\/p>\n\n\n\n<p>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a target=\"_blank\" href=\"mailto:InvestorRelations@fluentco.com\" rel=\"noreferrer noopener\">InvestorRelations@fluentco.com<\/a><\/p>\n","protected":false},"featured_media":8348,"template":"","categories":[144],"tags":[153,171],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8340"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8348"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8340"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8340"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8340"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}