{"id":8356,"date":"2020-04-02T13:24:17","date_gmt":"2020-04-02T13:24:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8356"},"modified":"2021-02-23T20:20:46","modified_gmt":"2021-02-23T20:20:46","slug":"winopoly-acquisition","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/winopoly-acquisition\/","title":{"rendered":"Fluent, Inc. Announces Acquisition of 50% Stake in Winopoly, LLC"},"content":{"rendered":"\n<p>NEW YORK, April 02, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/04\/02\/2010806\/0\/en\/Fluent-Inc-Announces-Acquisition-of-50-Stake-in-Winopoly-LLC.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"GLOBE NEWSWIRE (opens in a new tab)\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc.&nbsp;(NASDAQ: FLNT), a leading performance marketing company, announced today that it has acquired a 50% stake in Winopoly, LLC, a marketplace matching consumers to brands through rewarded content and interactive experiences. This strategic investment will bolster Fluent’s ability to provide end-to-end customer acquisition solutions to a growing roster of top brands.<\/p>\n\n\n\n<p>“We are thrilled to welcome Luciano Rammairone and the team at Winopoly,” said Ryan Schulke, CEO of Fluent. “With its flagship media property and impressive live agent capabilities, Winopoly will enable us to further expand our media footprint and develop products that deliver more customers to our advertisers.”&nbsp;&nbsp;<br><br>Specializing in personalized consumer engagement, Winopoly will support Fluent in its continued mission to deliver economically efficient and scalable customer acquisition solutions across growing digital mediums. “Access to Winopoly’s media inventory and contact center technology, which enables agents to work from home, gives Fluent a great advantage in providing value to existing and future partners,” added Mr. Schulke.<br><br>“I am eager and excited to work alongside the Fluent team to enhance and expand consumer engagement and create new and impactful touchpoints for Fluent’s loyal consumers and its partners,” said Luciano Rammairone, Founder and CEO of Winopoly.<br><br>Luciano Rammairone is an entrepreneur with over 20 years of experience cultivating and curating meaningful online marketplaces from startup to growth and exit. He has founded three successful companies since 1999, including ClassesUSA, which was sold to Experian Interactive in 2005.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>About Winopoly<br><\/strong>Winopoly, LLC is a performance-based publishing company that specializes in consumer engagement through&nbsp;sustainable and productive digital meeting places bringing buyers and sellers together. We combine state-of-art art technology and the power of mobile communications to present impactful product and services opportunities to our members.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<br><\/strong>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Factors currently known to management that could cause actual results to differ materially from those in forward-looking statements include the following: the retention of key employees of Winopoly; the ability of Fluent to successfully integrate Winopoly to achieve expected benefits; the ability to maintain and grow key Winopoly client relationships; the ability to develop new products and services and enhance existing ones; competition; the potential effects of existing and new laws, rules or regulations; failure to maintain the integrity of systems and infrastructure through integration; and failure to adequately protect intellectual property rights or allegations of infringement of intellectual property rights. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:<br><\/strong>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=lStBJKERmB4VpiHn5nqvfbtUP-ESVvRiKR5P-_NxlNkclNPqqjVWb-bBAfbMh9SCDOV9GMqSxqYksfc3YPOUhK9Y9NDM9ZyUXkn2rBPQQN8deXCVSZ6TKF-mW_X1pu0o\" rel=\"noreferrer noopener\" target=\"_blank\">InvestorRelations@fluentco.com<\/a><\/p>\n","protected":false},"featured_media":8360,"template":"","categories":[144],"tags":[153,169],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8356"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8360"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8356"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8356"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8356"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}