{"id":8377,"date":"2020-04-08T15:16:17","date_gmt":"2020-04-08T15:16:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8377"},"modified":"2021-02-23T19:24:12","modified_gmt":"2021-02-23T19:24:12","slug":"covid-19-relief-donation","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/covid-19-relief-donation\/","title":{"rendered":"Fluent, Inc. Announces Donation of $100,000 to Benefit COVID-19 Relief Efforts"},"content":{"rendered":"\n<p>NEW YORK, April 08, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/04\/08\/2013624\/0\/en\/Fluent-Inc-Announces-Donation-of-100-000-to-Benefit-COVID-19-Relief-Efforts.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"GLOBE NEWSWIRE (opens in a new tab)\">GLOBE NEWSWIRE<\/a>) — Fluent, Inc. (NASDAQ: FLNT), a leading performance marketing company today announced that it will donate $100,000 to benefit COVID-19 relief efforts in the U.S. and Canada as part of its overarching response to the global crisis. <\/p>\n\n\n\n<p>Funds will go to <a href=\"https:\/\/shelteringarmsny.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Sheltering Arms<\/a>, an NYC-based social services organization\nand longtime beneficiary of Fluent’s support, as well as <a href=\"https:\/\/www.unitedway.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">United Way<\/a>, a\nnon-profit dedicated to improving\nlives by mobilizing the caring power of communities around the world. In conjunction\nwith this effort, Fluent has also pledged to match team members’ donations\nto the COVID-19-related causes they are supporting during this time. <\/p>\n\n\n\n<p>“Amidst this\nperiod of rapid change, we are making it a top priority to extend aid and\nsupport not only to our employees, but also the communities where they live and\nwork,” said Matt Conlin, President of Fluent. “With the coronavirus outbreak\nhaving a particularly severe impact in New York City – the home of Fluent’s\nheadquarters – it is crucial that the city’s most vulnerable communities can\ncontinue to rely on the services offered by Sheltering Arms and United Way.” <\/p>\n\n\n\n<p>“We do not yet know the full extent of the\nimpact that COVID-19 will have on New York City, but we do know that the\nchildren, youth, and families we serve need us now more than ever,” said\nElizabeth McCarthy, CEO, Sheltering Arms Children and Family Services. “We are\nso grateful for our generous supporters like Fluent who make it possible for us\nto continue providing vital programs and services to thousands of New\nYorkers.”&nbsp;<\/p>\n\n\n\n<p>Supporting Sheltering Arms’ mission to enhance the education, well-being, and\ndevelopment of children and their families across NYC for several years, Fluent\nhas recently added United Way to its roster of beneficiaries. “As part of its COVID-19 Community\nResponse and Recovery Fund, United Way is mobilizing to provide accurate\ninformation and services to those in need across each of the cities where\nFluent operates,” said Matt Conlin. “As\nwe continue to expand into new regions, we are proud to support an organization\nwith a powerful mission and global impact.”<\/p>\n\n\n\n<p>“We all are\nfortunate to live in a community that has consistently proven its generosity to\nthose in need,” said&nbsp;United Way of Greater Kansas City President and CEO,\nBrent Stewart.&nbsp;“The generous gift from Fluent is yet another example of\nhow businesses in the Kansas City region are giving at this critical time. At\nUnited Way, we call this ‘Kansas City taking care of its own.’ That need for\ncaring for our people – our community – has never been more acute than as a\nresult of this pandemic. We are so appreciative of the support from Fluent,\nAdParlor, and other businesses across our region.”<\/p>\n\n\n\n<p>United Way of Palm Beach\nCounty has also thanked Fluent for the generous donation stating, “As a\ncommunity champion in Boca Raton, Fluent&#8217;s donation will be used to meet urgent\nneeds like ensuring those impacted by the unintended consequences during this\nunprecedented time have access to the basics like food and financial stability.\nWe appreciate Fluent and their support.”<\/p>\n\n\n\n<p>Last week, Fluent also announced the launch of <a href=\"https:\/\/fluentpulse.com\/covid-19\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Fluent Pulse<\/a>, an ongoing insights initiative designed to track consumer sentiment and impact on everyday life as it relates to the COVID-19 outbreak.  Fluent Pulse will publish new insights each Tuesday morning along with consumers’ reactions to other milestone events that may occur outside of this cycle. <\/p>\n\n\n\n<p>“Our donations to Sheltering Arms and\nUnited Way are just one component of Fluent’s larger response to the COVID-19\noutbreak,” said Matt Conlin. “Surveying over 1.85 million consumers for the\nfirst installment of Fluent Pulse, we are proud to contribute our media inventory, survey\ncapabilities, and personnel to help businesses and municipalities best\nrespond to the needs of consumers during this uncertain time.” <\/p>\n\n\n\n<p>In addition to publishing\nweekly updates to the Fluent Pulse site, Fluent is partnering with the Ad\nCouncil to help extend the reach and impact of COVID-19 response\nmessaging as the pandemic continues to evolve. Along with other industry\nleaders, Fluent will donate audience targeting segments to help reach and\nempower millennials and those at the highest risk for COVID-19 with the information\nthey need to slow the spread of the virus. <\/p>\n\n\n\n<p><strong>About Fluent<\/strong><strong><\/strong><\/p>\n\n\n\n<p>Fluent, Inc.\n(NASDAQ: FLNT) is a leading performance marketing company with an expertise in\ncreating meaningful connections between consumers and brands. Leveraging our\nproprietary first-party data asset of opted-in consumer profiles, Fluent, Inc.\ndrives intelligent growth strategies that deliver superior outcomes. Founded in\n2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>About\nSheltering Arms<\/strong><\/p>\n\n\n\n<p>At\nSheltering Arms, our goal is to foster a society where every child and family\nwe serve will have the opportunity to succeed and thrive. We address the\neffects of social inequity in the most challenged communities in New York City.\nOur innovative programs and compassionate services measurably enhance the\neducation, well-being, and development of children, their families, and\ncommunities. We have maintained an unwavering commitment to our mission since\n1823.<\/p>\n\n\n\n<p><strong>About United Way <\/strong><\/p>\n\n\n\n<p>United Way fights for the health, education and financial stability of every person in every community. Supported by 2.9 million volunteers, 8.1 million donors worldwide and $4.8 billion raised every year, United Way is the world&#8217;s largest privately-funded nonprofit. We&#8217;re engaged in nearly 1,800 communities across more than 40 countries and territories worldwide to create sustainable solutions to the challenges facing our communities. United Way partners include global, national and local businesses, nonprofits, government, civic and faith-based organizations, along with educators, labor leaders, health providers, senior citizens, students and more. For more information about United Way, please visit <a href=\"https:\/\/www.unitedway.org\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">UnitedWay.org<\/a>. Follow us on Twitter: @UnitedWay and #LiveUnited. <\/p>\n\n\n\n<p><strong>Contact<\/strong><\/p>\n\n\n\n<p>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a rel=\"noreferrer noopener\" href=\"mailto:InvestorRelations@fluentco.com\" target=\"_blank\">InvestorRelations@fluentco.com<\/a><\/p>\n","protected":false},"featured_media":8378,"template":"","categories":[144],"tags":[145],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8377"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8378"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8377"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8377"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}