{"id":8410,"date":"2020-04-29T12:39:17","date_gmt":"2020-04-29T12:39:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8410"},"modified":"2021-02-23T20:25:13","modified_gmt":"2021-02-23T20:25:13","slug":"international-expansion","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/international-expansion\/","title":{"rendered":"Fluent Plans to Accelerate International Expansion in Response to Increased Demand from Advertisers"},"content":{"rendered":"\n<p>NEW YORK, April 29, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/04\/29\/2024211\/0\/en\/Fluent-Plans-to-Accelerate-International-Expansion-in-Response-to-Increased-Demand-from-Advertisers.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"GLOBE NEWSWIRE (opens in a new tab)\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc.&nbsp;(NASDAQ: FLNT), a leading performance marketing company, today announced it has launched in two European markets with additional international launches planned throughout the remainder of 2020 and 2021. This strategic initiative stems from increased demand among Fluent’s core performance advertiser base in reaching consumers across Western Europe, Canada, Australia, and APAC markets. <\/p>\n\n\n\n<p>“Fluent’s expansion\ninto additional international markets will enhance our ability to provide\nend-to-end customer acquisition solutions for advertisers, while further strengthening\nour existing relationships with media partners operating across the globe,”\nsaid Ryan Schulke, CEO of Fluent. “With our growing portfolio of owned and\noperated media properties, Fluent anticipates capturing at least half the\nmarket share per capita we currently hold in the U.S. by 2025.”<\/p>\n\n\n\n<p>Fluent launched its\nfirst international offering in the U.K. market in 2018 and has begun beta\ntesting in Germany as of Q1 2020. “We saw our revenues double in Q1 2020 –\npredominantly in the U.K. – with media margins that are in line with our core U.S.\nbusiness,” said Mr. Schulke. “Based on our success in the U.K., we expect to\nsee profitability for new markets within six months of beta launch.” <\/p>\n\n\n\n<p>Fluent has partnered with <a href=\"https:\/\/www.globalization-partners.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Globalization Partners (opens in a new tab)\">Globalization Partners<\/a> to establish a ground presence in Western Europe and more rapidly develop key local relationships in operating regions. The company plans to make further investments in international talent in the back half of the year to support its expansion efforts and strengthen its global network. <\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<br><\/strong>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:<br><\/strong>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br><a rel=\"noreferrer noopener\" href=\"https:\/\/www.globenewswire.com\/Tracker?data=lStBJKERmB4VpiHn5nqvfbtUP-ESVvRiKR5P-_NxlNkclNPqqjVWb-bBAfbMh9SCDOV9GMqSxqYksfc3YPOUhK9Y9NDM9ZyUXkn2rBPQQN8deXCVSZ6TKF-mW_X1pu0o\" target=\"_blank\">InvestorRelations@fluentco.com<\/a><\/p>\n","protected":false},"featured_media":8411,"template":"","categories":[144],"tags":[153],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8410"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8411"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8410"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8410"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8410"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}