{"id":8430,"date":"2020-06-10T13:17:17","date_gmt":"2020-06-10T13:17:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8430"},"modified":"2021-02-23T20:11:07","modified_gmt":"2021-02-23T20:11:07","slug":"zendesk-integration","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/zendesk-integration\/","title":{"rendered":"Fluent Partners with Zendesk to Enhance Consumer Experience"},"content":{"rendered":"\n<p><em>In response to changing consumer needs, Fluent engages Zendesk to help improve customer support services and support international expansion<\/em><\/p>\n\n\n\n<p><strong>New York, NY, June 10, 2020<\/strong> &#8211; <a href=\"https:\/\/www.fluentco.com\/\">Fluent, Inc<\/a>. (NASDAQ: FLNT), a leading performance marketing company, today announced it has partnered with <a href=\"https:\/\/www.zendesk.com\/\">Zendesk, Inc.<\/a> (NYSE: ZEN), a service-first customer relationship management (CRM) company, to enhance its customer support services. This move further signifies Fluent’s dedication to creating seamless digital experiences that empower consumers to engage with the products and services that enrich their lives.<\/p>\n\n\n\n<p>Collecting first-party, self-declared data across its proprietary media properties, Fluent helps advertisers deliver relevant offers to the right audiences. By integrating Zendesk, Fluent seeks to enable faster, more efficient processes for tracking, prioritizing, and resolving customer support tickets. Serving more than 150,000 customers across hundreds of industries, Zendesk’s flexible support and customer engagement software will also support Fluent’s international expansion efforts and help to create better digital experiences for consumers worldwide.<\/p>\n\n\n\n<p>“Each day we engage with nearly one million consumers across our portfolio of owned and operated media properties,” said Ryan Schulke, CEO of Fluent. “Our integration of Zendesk will allow us to deliver more meaningful experiences to existing users while also helping us to better serve the needs of new audiences as we expand into international markets.”<\/p>\n\n\n\n<p>To lead this integration and create a more elegant customer experience across Fluent’s proprietary websites, Peter DeCaro has been promoted to Senior Director, Business Process Operations. In this new role, DeCaro will work with various teams to streamline both Fluent’s customer support claims and fulfillment functions. With decades of experience overseeing workflow and process improvement in senior roles at companies like IAC and Bitly, DeCaro will work to strategically elevate Fluent’s consumer support approach.&nbsp;<\/p>\n\n\n\n<p>As exemplified by these moves, Fluent is committed to developing and executing high-performing customer acquisition programs that deliver better digital advertising experiences for consumers and measurable results for advertisers. Fluent plans to continue expanding its product offerings and business relationships to align with changing client and consumer needs.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><\/p>\n\n\n\n<p>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Media Contact:<\/strong><\/p>\n\n\n\n<p>N6A for Fluent<br>Fluent@n6a.com<br>401.464.1772<\/p>\n","protected":false},"featured_media":8431,"template":"","categories":[144],"tags":[147],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8430"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8431"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8430"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8430"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8430"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}