{"id":8806,"date":"2020-09-16T13:35:17","date_gmt":"2020-09-16T13:35:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8806"},"modified":"2021-02-23T20:25:52","modified_gmt":"2021-02-23T20:25:52","slug":"performance-marketing-platform","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/performance-marketing-platform\/","title":{"rendered":"Fluent Announces Launch of Enhanced Performance Marketing Platform Powered by AWS"},"content":{"rendered":"\n<p>NEW YORK, Sept. 16, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/09\/16\/2094525\/0\/en\/Fluent-Announces-Launch-of-Enhanced-Performance-Marketing-Platform-Powered-by-AWS.html\" target=\"_blank\" rel=\"noreferrer noopener\">GLOBE NEWSWIRE<\/a>) &#8212; Fluent, Inc. (NASDAQ: FLNT), a leading performance marketing company, today announced the launch of its new Performance Marketing Platform powered by Amazon Web Services, Inc. (“AWS”). Upgrades to Fluent’s marketing technology stack are part of the company’s long-standing investment in technology, analytics, and product innovation. The AWS partnership and accompanying product enhancements will support Fluent’s plans for international expansion and help drive continued growth for key trading partners.<\/p>\n\n\n\n<p>The AWS native cloud platform is designed to be easily deployed internationally and tailored to local regulatory requirements. Fluent has launched the platform in service of its U.K. operations and will continue to leverage this technology to strengthen existing partnerships and expand into additional markets. &#8220;This upgraded technology stack is ideally suited to drive value for our loyal U.S. clients, support our international growth goals, and enable us to stay nimble amidst the evolving regulatory landscape,” said Ryan Schulke, CEO of Fluent.<\/p>\n\n\n\n<p>Over the past year, all development within the platform has been with AWS, using modern process and design in support of Fluent’s performance marketing business. “The speed to market has been impressive, and we&#8217;re excited to see how these new capabilities and features allow us to propel our business forward in the back half of 2020 into 2021,” said Schulke.<\/p>\n\n\n\n<p>“We’re pleased to combine AWS’s portfolio of cloud services with Fluent’s expertise in connecting consumers and brands,” said Greg Pearson, Vice President, Worldwide Commercial Sales at Amazon Web Services, Inc. “Leveraging AWS’s global infrastructure, Fluent can continue to expand its service to reach consumers around the world with the proven operational experience and reliability that its customers depend on. Going forward, Fluent plans to enhance digital experiences with AWS machine learning to drive deeper insights and predict consumer trends and sentiments that will result in more engaging and relevant marketing campaigns for its customers.”<\/p>\n\n\n\n<p>Plans to extend its machine learning capabilities to the new platform are in line with Fluent’s continued commitment to executing high-performing customer acquisition programs that drive measurable results for advertisers.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><br>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Contact Information:<\/strong><br>Investor Relations<br>Fluent, Inc.<br>(917) 310-2070<br>InvestorRelations@fluentco.com<\/p>\n","protected":false},"featured_media":8807,"template":"","categories":[144],"tags":[147],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8806"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8807"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8806"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8806"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8806"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}