{"id":8867,"date":"2020-10-01T13:17:17","date_gmt":"2020-10-01T13:17:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8867"},"modified":"2021-02-23T20:26:14","modified_gmt":"2021-02-23T20:26:14","slug":"carla-newell-board-announcement","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/carla-newell-board-announcement\/","title":{"rendered":"Fluent, Inc. Appoints Carla Newell to Board of Directors"},"content":{"rendered":"\n<h4>Newell brings over three decades of experience facilitating growth for tech and digital businesses<\/h4>\n\n\n\n<p>NEW YORK, Oct. 1, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/10\/01\/2102194\/0\/en\/Fluent-Inc-Appoints-Carla-Newell-to-Board-of-Directors.html\">GLOBE NEWSWIRE<\/a>) &#8211; <a href=\"https:\/\/www.fluentco.com\/\">Fluent, Inc.<\/a> (NASDAQ: FLNT), a leading data-driven performance marketing company, today announced the appointment of Carla Newell to the Company’s Board of Directors. Ms. Newell is a seasoned business leader and board director with more than 30 years of success facilitating growth in the technology, digital business, and life sciences arenas. In her new role with Fluent, Ms. Newell will serve as a member of the Audit Committee, Compensation Committee, and Nominating and Corporate Governance Committee of the Company’s Board of Directors.<\/p>\n\n\n\n<p>Ms. Newell has been a trusted advisor to CEOs and boards of both private and public companies on a broad range of business, strategic, and legal issues. With an extensive network in Silicon Valley, she has worked across a variety of sectors including ecommerce, software and services, financial technology, life sciences, and social media. Ms. Newell currently serves as Chief Legal and Risk Officer and Head of Health Business Development for Ancestry. Ms. Newell is responsible for Ancestry&#8217;s global legal and enterprise risk as well as leading business development and partnership management for its emerging health business.<\/p>\n\n\n\n<p>Before Ancestry, Ms. Newell served as Operating General Partner at Technology Crossover Ventures, a leading technology-focused venture capital and private equity firm with $10B in capital raised and investments including Expedia, Netflix, Redback Networks, RiskMetrics and Zillow. While there, she led a wide range of responsibilities for legal, deal structuring, investor relations, fundraising, human resources, and other operating functions.<\/p>\n\n\n\n<p>“Carla Newell is a stalwart of the technology industry, and we are thrilled to welcome her to Fluent’s Board of Directors,” said Ryan Schulke, Chief Executive Officer of Fluent. “We are honored to have the opportunity to leverage her knowledge and experience and know that she will help to drive real value for the Company and future offerings for our clients.”<\/p>\n\n\n\n<p>Fluent leverages first-party, self-declared insights to develop and execute high-performing customer acquisition programs. Creating meaningful connections between consumers and brands, Fluent enables marketers to reach their most valuable customers in a scalable, efficient, and privacy-safe way. As a member of Fluent’s Board of Directors, Ms. Newell will help to guide the continual evolution of the business, as well as its expansion into international markets.<\/p>\n\n\n\n<p>&#8220;I am excited to join Fluent&#8217;s Board of Directors as the Company continues to expand its business and launch new capabilities,” said Ms. Newell. “As an advisor on a wide range of strategic initiatives, I look forward to helping the Company navigate this critical stage of its evolution and growth.&#8221;<\/p>\n\n\n\n<p>For more information on Fluent and its product offerings, please see here &#8211; <a href=\"https:\/\/www.fluentco.com\/\">https:\/\/www.fluentco.com\/<\/a><\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><\/p>\n\n\n\n<p>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><br>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Media Contact:<\/strong><br>N6A for Fluent<br>Fluent@n6a.com<br>401.464.1772<\/p>\n","protected":false},"featured_media":271,"template":"","categories":[144],"tags":[153,170],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8867"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/271"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8867"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8867"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8867"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}