{"id":8997,"date":"2020-10-27T14:12:17","date_gmt":"2020-10-27T14:12:17","guid":{"rendered":"https:\/\/www.fluentco.com\/?p=8997"},"modified":"2021-02-23T20:29:01","modified_gmt":"2021-02-23T20:29:01","slug":"business-empowerment-program-pr","status":"publish","type":"newsroom","link":"https:\/\/www.fluentco.com\/newsroom\/business-empowerment-program-pr\/","title":{"rendered":"Fluent to Support Minority and Women-Owned Businesses with Annual $250K Digital Marketing Program"},"content":{"rendered":"\n<h1 class=\"has-normal-font-size\">Fluent’s Business Empowerment Program will enable online businesses to reach and engage high-value consumers on Fluent’s performance marketing platform<\/h1>\n\n\n\n<p>NEW YORK, Oct. 27, 2020 (<a href=\"http:\/\/www.globenewswire.com\/news-release\/2020\/10\/27\/2115167\/0\/en\/Fluent-to-Support-Minority-and-Women-Owned-Businesses-with-Annual-250K-Digital-Marketing-Program.html\">GLOBE NEWSWIRE<\/a>) &#8212;&nbsp;Fluent, Inc.&nbsp;(NASDAQ: FLNT), a leading data-driven performance marketing company, announced its Business Empowerment Program, an initiative focused on supporting minority and women-owned businesses to succeed in today’s digital economy. By leveraging their proprietary platform and performance marketing solutions, Fluent has helped brands connect and engage with valuable consumers in a scalable, efficient, and transparent way. The company is awarding $50,000 worth of digital marketing resources to each of the five recipients of this program in an effort to accelerate the recovery and growth of their businesses.<\/p>\n\n\n\n<p>Minority-owned businesses&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=AB1vlMow2POPo522egvCwSeKqlz11PUkobz7BqC1Ff6Zc3pVPiBeEVXDAHLgWUh6hmoUxM5CGhj9RaI5Kdl3uHZZniWDtuIGV_apKTP_P16PIBFivvN9cLIFZ0RhJY2rL2-7IgpS5vSTSxZkR0NI6eX-8qiBYP-ukBLBBsatKxV-iMGNLnPDUqED4FeEBzO8RiqTNcQmf2GpHqsm2MXg5cjt2BQeo6jbwgmH-tRQFhpcuk9tfYK84OSBFaLIbQm5\" rel=\"noreferrer noopener\" target=\"_blank\">represent around 20%<\/a>&nbsp;of employer businesses in the US. This year, due to closures caused by the pandemic lockdowns, minority business owners have suffered the deepest losses, with&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=GbgF-Iau0dHJYMOKlAU6F6QQWp5DI79Z9Gqk2BU_z-23D_IzIETcp8M-aPBqduYil4loVipM7-cIvuFP0Jd_AzJPDWS5sDYVo_U_t0SbL7vZYlPd1rcfgebGVfCyMFygZfwxpvVrqoRf239hrqfKjNWlrl1M-z_yXnyqHigpoAV9Jn2NpDiY_E5BwQ9tpaRB\" rel=\"noreferrer noopener\" target=\"_blank\">41% of businesses shuttering<\/a>. In addition, women and other marginalized groups have also been disproportionately impacted by business closures with 25% of women owned businesses shuttering, along with&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=pZQsrG26J7-NZKreQSisnyJl28dpJFO8o6Ti-uej0WHdll7UCKikJd1G-KJE0XC29K7yt539YCxO6c1kdwaPfjJWAoqAeYF5DOaIm7go62o=\" rel=\"noreferrer noopener\" target=\"_blank\">32% of Latinx&nbsp;<\/a><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=L84tvDRvoavWW3YTf-PV6iCvVy1pRk4AaaUqxmRiIUje48kxRaeoitufmNlhb6f0d983anNYgBY20jwjT3pVIVNj60Mdozb6z1dn0q9cQcqvRoxmHKRyw2QH0laouUcw\" rel=\"noreferrer noopener\" target=\"_blank\">and 26% of Asian businesses<\/a>. Through the Fluent Business Empowerment Program, the company will help selected recipients to better target, acquire and retain high-value customers and thus contribute to an increase in the sales and growth of their businesses.<\/p>\n\n\n\n<p>Applications will be open until December 15, 2020, and selected recipients will be announced on January 15, 2021.<\/p>\n\n\n\n<p>“As a company that was founded and bootstrapped following the Great Recession, we wanted to help accelerate the growth trajectory for the next era of entrepreneurs to emerge from this pandemic,” said Matt Conlin, Co-Founder and President of Fluent. “Our Business Empowerment Program leverages our unique performance marketing platform and digital expertise to enable minority and women-led businesses to identify and engage new customers and support their sales and growth. We are excited to provide the same incredible value that we deliver to our Fortune 500 clients to companies who, during this challenging time, need it most.”<\/p>\n\n\n\n<p>“From day one, supporting local communities and finding ways to give back has been part of Fluent’s DNA,” said Ryan Schulke, Fluent’s CEO. “We felt that this initiative was a natural way to make an impact outside of our walls, while supporting the digital economy.”<\/p>\n\n\n\n<p>With millions of engaged users, Fluent’s performance marketing platform enables businesses to effectively meet their marketing goals. Each of the five program recipients will be able to utilize their grants in two ways:<\/p>\n\n\n\n<ul><li><strong><em>Outcome-based customer acquisition campaigns<\/em><\/strong>&nbsp;– Fluent will leverage its owned and operated inventory and unique targeting capabilities to drive highly engaged consumers to the recipient&#8217;s business&#8217; website or mobile app.<\/li><li><strong><em>Complete Facebook Campaign Audit<\/em><\/strong>&nbsp;– AdParlor (a social media agency owned by Fluent) will provide a full campaign assessment with best practices, and insights, as well as customized creative blueprint templates for the recipient’s product or service.<\/li><\/ul>\n\n\n\n<p>Candidates must be at least 51% minority and\/or women-owned, operated, and controlled, as well as physically located in North America. Candidates must currently have digital marketing programs in place in order to activate campaigns on Fluent’s platform. Five recipients will be chosen based on eligibility and their application. Interested candidates can <a href=\"https:\/\/www.fluentco.com\/investing-in-minority-led-businesses\/\" target=\"_blank\" rel=\"noreferrer noopener\">apply online<\/a>&nbsp;through December 15, 2020.<\/p>\n\n\n\n<p><strong>About Fluent, Inc.<\/strong><br>Fluent, Inc. (NASDAQ: FLNT) is a leading performance marketing company with an expertise in creating meaningful connections between consumers and brands. Leveraging our proprietary first-party data asset of opted-in consumer profiles, Fluent, Inc. drives intelligent growth strategies that deliver superior outcomes. Founded in 2010, the company is headquartered in New York City.<\/p>\n\n\n\n<p><strong>Forward-Looking Statements<\/strong><br>This press release contains “forward-looking statements,” as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as “expects,” “plans,” “projects,” “will,” “may,” “anticipate,” “believes,” “should,” “intends,” “estimates,” and other words of similar meaning. Such forward-looking statements are subject to risks and uncertainties that are often difficult to predict, are beyond our control and which may cause results to differ materially from expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release. Readers are also advised to consider the factors under the heading “Forward-Looking Statements” and “Risk Factors” in the Company’s Annual Report on Form 10-K, as may be supplemented or amended by the Company’s Quarterly Reports on Form 10-Q and other SEC filings. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.<\/p>\n\n\n\n<p><strong>Media Contact:<\/strong><br>N6A for Fluent<br><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=RoXDXEZipxxtK4cLdwibTDFJ24m_xJu1NjurlzeiwrDOuzbRJXsf5JqTeCMC2u9RvL66vjgjmppwWaDykPQaaw==\" rel=\"noreferrer noopener\" target=\"_blank\"><u>Fluent@n6a.com<\/u><\/a><br>401.464.1772<\/p>\n","protected":false},"featured_media":8998,"template":"","categories":[144],"tags":[145],"_links":{"self":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom\/8997"}],"collection":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/newsroom"}],"about":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/types\/newsroom"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media\/8998"}],"wp:attachment":[{"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/media?parent=8997"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/categories?post=8997"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fluentco.com\/wp-json\/wp\/v2\/tags?post=8997"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}